{
  "lastUpdated": "2025-08-17T09:41:06.818Z",
  "channels": {
    "UCXmAKxh_qFL5703W9VPgpnA": {
      "name": "Food Pharmer",
      "category": "health",
      "color": "green",
      "lastFetched": "2025-08-17T09:41:05.872Z",
      "fetchStatus": "success",
      "fetchDuration": 336,
      "videos": [
        {
          "id": "qyzgWYkp6sE",
          "title": "OWN July Report Card: Sales numbers, mistakes, price breakdown, next product launch, Amazon update",
          "description": "Cast Your Votes here: https://onlywhatsneeded.in/engage/?utm_source=social&utm_medium=yt&utm_campaign=yt-long Introducing Our First Monthly Report Card From ingredient decisions to label design to what comes next - everything on the OWN platform is built with your votes and ideas. In our first-ever Report Card, I’m showing you: - What actually happened behind the launch - What went wrong (yes, including delivery delays and payment bugs) - Why we dropped the price - Why we said no to Amazon and B",
          "publishedAt": "2025-08-12T12:33:47+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/qyzgWYkp6sE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=qyzgWYkp6sE",
          "duration": "PT0S",
          "viewCount": "66353",
          "isLive": false,
          "searchableText": "own july report card: sales numbers, mistakes, price breakdown, next product launch, amazon update cast your votes here: https://onlywhatsneeded.in/engage/?utm_source=social&utm_medium=yt&utm_campaign=yt-long introducing our first monthly report card from ingredient decisions to label design to what comes next - everything on the own platform is built with your votes and ideas. in our first-ever report card, i’m showing you: - what actually happened behind the launch - what went wrong (yes, including delivery delays and payment bugs) - why we dropped the price - why we said no to amazon and b   food pharmer",
          "keywords": "",
          "hash": "a0489aea"
        },
        {
          "id": "DgHdUtWu8Qs",
          "title": "Rethink God, Astrology, and Karma with Acharya Prashant",
          "description": "The question of the hour is,“Is man God made or God man-made?” And to answer this, I have Acharya Prashant with me, an author and a great speaker. In this episode of Rethink India, he drops truth bombs and questions the long followed belief system. In the most unfiltered conversation ever, he simplifies religion,God and belief to us. We spoke about: -If eating animals is right or wrong -The amount of animals we kill for food -God, religion and astrology: A myth or a reality? -The concept of Karm",
          "publishedAt": "2025-08-09T09:41:04+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/DgHdUtWu8Qs/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=DgHdUtWu8Qs",
          "duration": "PT0S",
          "viewCount": "255567",
          "isLive": false,
          "searchableText": "rethink god, astrology, and karma with acharya prashant the question of the hour is,“is man god made or god man-made?” and to answer this, i have acharya prashant with me, an author and a great speaker. in this episode of rethink india, he drops truth bombs and questions the long followed belief system. in the most unfiltered conversation ever, he simplifies religion,god and belief to us. we spoke about: -if eating animals is right or wrong -the amount of animals we kill for food -god, religion and astrology: a myth or a reality? -the concept of karm   food pharmer",
          "keywords": "",
          "hash": "c8354dc6"
        },
        {
          "id": "b_JZuowrBHQ",
          "title": "10+ noodles ranked from worst to most healthy",
          "description": "People complain that I don’t give enough healthier alternatives, so I want to start giving more healthy alternatives with every video. I want to go from being problem-focused to solution-focused. I mainly focused on sodium in the video to keep it simple. But I did extensive research on all ingredients, thickeners, colors and even acidity regulators for more than 10 noodles to make this video! Note: Since most noodles are cheap, almost all noodles are unhealthy. Even the noodles I recommended sho",
          "publishedAt": "2025-08-05T14:40:22+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/b_JZuowrBHQ/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=b_JZuowrBHQ",
          "duration": "PT0S",
          "viewCount": "282073",
          "isLive": false,
          "searchableText": "10+ noodles ranked from worst to most healthy people complain that i don’t give enough healthier alternatives, so i want to start giving more healthy alternatives with every video. i want to go from being problem-focused to solution-focused. i mainly focused on sodium in the video to keep it simple. but i did extensive research on all ingredients, thickeners, colors and even acidity regulators for more than 10 noodles to make this video! note: since most noodles are cheap, almost all noodles are unhealthy. even the noodles i recommended sho   food pharmer",
          "keywords": "",
          "hash": "12f47907"
        },
        {
          "id": "Gf-Zwqr8iMw",
          "title": "Transgenders on clapping, sex work, surgeries, gender change, LGBTQIA+ | Rethink India Ep.13",
          "description": "Most podcasts get only famous or rich people as their guests. That is why I decided to get transgenders in this episode. We usually see them during weddings and baby showers, but we rarely make the effort to get to know about what goes on in their life. We got Dr. Anshuman Manaswi - a gender reassignment surgeon to share his perspective. We spoke about: - Why many trans people are forced into sex work - What does LGBTQIA+ mean? - How most hospitals still deny them basic dignity - What it’s like ",
          "publishedAt": "2025-08-02T08:45:28+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/Gf-Zwqr8iMw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Gf-Zwqr8iMw",
          "duration": "PT0S",
          "viewCount": "36672",
          "isLive": false,
          "searchableText": "transgenders on clapping, sex work, surgeries, gender change, lgbtqia+ | rethink india ep.13 most podcasts get only famous or rich people as their guests. that is why i decided to get transgenders in this episode. we usually see them during weddings and baby showers, but we rarely make the effort to get to know about what goes on in their life. we got dr. anshuman manaswi - a gender reassignment surgeon to share his perspective. we spoke about: - why many trans people are forced into sex work - what does lgbtqia+ mean? - how most hospitals still deny them basic dignity - what it’s like    food pharmer",
          "keywords": "",
          "hash": "51f73565"
        },
        {
          "id": "_r7OosFhADo",
          "title": "Launching the Most Honest Food Label in India built with YOU",
          "description": "Order now- https://onlywhatsneeded.in/product/whey-protein-2?utm_source=social&utm_medium=yt&utm_campaign=yt-bio After calling out over 100 food brands for misleading labels, I spent the last year building something that can set a benchmark in the market. Here’s how my product is different: -Label on the front -QR Code for regional languages -Braille pamphlet for inclusivity -Transparent cost breakdown -Ingredient % shown as pie chart -Every batch tested for protein, heavy metals, and pesticides",
          "publishedAt": "2025-07-23T14:58:47+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/_r7OosFhADo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=_r7OosFhADo",
          "duration": "PT0S",
          "viewCount": "314321",
          "isLive": false,
          "searchableText": "launching the most honest food label in india built with you order now- https://onlywhatsneeded.in/product/whey-protein-2?utm_source=social&utm_medium=yt&utm_campaign=yt-bio after calling out over 100 food brands for misleading labels, i spent the last year building something that can set a benchmark in the market. here’s how my product is different: -label on the front -qr code for regional languages -braille pamphlet for inclusivity -transparent cost breakdown -ingredient % shown as pie chart -every batch tested for protein, heavy metals, and pesticides   food pharmer",
          "keywords": "",
          "hash": "4d1d33f8"
        },
        {
          "id": "Ps6IAALRED4",
          "title": "How we made India’s most transparent protein powder together| Only What’s Needed",
          "description": "Pre-Order Link: https://onlywhatsneeded.in/product/whey-protein-2?utm_source=social&utm_medium=yt&utm_campaign=yt-bio Only What's Needed is India's first democratic food platform. We wanted to build a protein that gives you Only What’s Needed, nothing more, nothing less. As it is normally difficult to understand the protein ingredients, we broke it down into 5 systems: 1. Protein System: We used 90%+ Whey Concentrate sourced from Europe (because you voted for it) 2. Taste System: We used only re",
          "publishedAt": "2025-07-17T13:52:52+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/Ps6IAALRED4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Ps6IAALRED4",
          "duration": "PT0S",
          "viewCount": "126878",
          "isLive": false,
          "searchableText": "how we made india’s most transparent protein powder together| only what’s needed pre-order link: https://onlywhatsneeded.in/product/whey-protein-2?utm_source=social&utm_medium=yt&utm_campaign=yt-bio only what's needed is india's first democratic food platform. we wanted to build a protein that gives you only what’s needed, nothing more, nothing less. as it is normally difficult to understand the protein ingredients, we broke it down into 5 systems: 1. protein system: we used 90%+ whey concentrate sourced from europe (because you voted for it) 2. taste system: we used only re   food pharmer",
          "keywords": "",
          "hash": "e3cb8ad8"
        }
      ]
    },
    "UCZknyXD-6tETm9aN8GQCi8g": {
      "name": "The Cutting Edge School",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-08-17T09:41:05.936Z",
      "fetchStatus": "success",
      "fetchDuration": 317,
      "videos": [
        {
          "id": "p6YDMnVQjhE",
          "title": "Figma Make Course for Beginners: AI for No-Code Product Building",
          "description": "Check out Figma Make - Figma main page: https://figma.bot/4mCgnQX Figma make: https://figma.bot/4mbEVjT In this video, we’ll walk you through Episode 1 of our free Figma AI course, where you'll learn how to turn your static designs into working web apps using Figma Make, without writing a single line of code. We’ll explore the interface, attach design files, style components, add backend with Supabase, and finally preview and publish a live prototype. This is a beginner-friendly lesson that cove",
          "publishedAt": "2025-08-14T12:28:41+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/p6YDMnVQjhE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=p6YDMnVQjhE",
          "duration": "PT0S",
          "viewCount": "9780",
          "isLive": false,
          "searchableText": "figma make course for beginners: ai for no-code product building check out figma make - figma main page: https://figma.bot/4mcgnqx figma make: https://figma.bot/4mbevjt in this video, we’ll walk you through episode 1 of our free figma ai course, where you'll learn how to turn your static designs into working web apps using figma make, without writing a single line of code. we’ll explore the interface, attach design files, style components, add backend with supabase, and finally preview and publish a live prototype. this is a beginner-friendly lesson that cove   the cutting edge school",
          "keywords": "",
          "hash": "0fa1fd81"
        }
      ]
    },
    "UCggPd3Vf9ooG2r4I_ZNWBzA": {
      "name": "Wint Wealth",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-08-17T09:41:05.915Z",
      "fetchStatus": "success",
      "fetchDuration": 294,
      "videos": [
        {
          "id": "CUM2xksBMtk",
          "title": "₹70 Lakhs loss to ₹10 Crore corpus in 10 years? ",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 He blew up ₹70 lakhs and walked away from stocks. In 2015 he came back with a clear, equity-first plan. ₹50 lakhs compounded into ₹10.2 crore in 10 years—16×. This is the mindset and simple rules behind that comeback. Wint Wealth: https://wintwealth.onelink.me/o6zX/wintWealth",
          "publishedAt": "2025-08-08T13:01:30+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/CUM2xksBMtk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=CUM2xksBMtk",
          "duration": "PT0S",
          "viewCount": "86507",
          "isLive": false,
          "searchableText": "₹70 lakhs loss to ₹10 crore corpus in 10 years?  fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 he blew up ₹70 lakhs and walked away from stocks. in 2015 he came back with a clear, equity-first plan. ₹50 lakhs compounded into ₹10.2 crore in 10 years—16×. this is the mindset and simple rules behind that comeback. wint wealth: https://wintwealth.onelink.me/o6zx/wintwealth   wint wealth",
          "keywords": "",
          "hash": "2f99e026"
        },
        {
          "id": "6DucxPSgPb8",
          "title": "This Couple chose OPEN FIELDS over OFFICE CUBICLES | LIFE BEYOND FREEDOM",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 A slow, thoughtful journey of leaving it all behind. In this video, we follow the story of a couple who traded deadlines and boardrooms for dirt roads and sunrise harvests. Tired of city chaos and corporate burnout, they made a bold move to a tier-3 town — not to escape work, but to redefine it. Through quiet mornings, simple routines, and a deep connection with nature, their story is less about leaving a job, and ",
          "publishedAt": "2025-07-19T06:30:03+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/6DucxPSgPb8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=6DucxPSgPb8",
          "duration": "PT0S",
          "viewCount": "235514",
          "isLive": false,
          "searchableText": "this couple chose open fields over office cubicles | life beyond freedom fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 a slow, thoughtful journey of leaving it all behind. in this video, we follow the story of a couple who traded deadlines and boardrooms for dirt roads and sunrise harvests. tired of city chaos and corporate burnout, they made a bold move to a tier-3 town — not to escape work, but to redefine it. through quiet mornings, simple routines, and a deep connection with nature, their story is less about leaving a job, and    wint wealth",
          "keywords": "",
          "hash": "1e963fc4"
        },
        {
          "id": "IM_qVg4pmT8",
          "title": "This guy became a Millionaire through Sports!",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 From chasing finish lines to building a financial foundation — this is the story of a professional triathlete who turned his passion for endurance sports into long-term financial security. In this episode, he breaks down how he planned his finances, navigated an unpredictable income stream, and built a corpus that supports him beyond his sporting career. A deep dive into discipline — both physical and financial. Wi",
          "publishedAt": "2025-07-08T12:31:21+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/IM_qVg4pmT8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=IM_qVg4pmT8",
          "duration": "PT0S",
          "viewCount": "23318",
          "isLive": false,
          "searchableText": "this guy became a millionaire through sports! fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 from chasing finish lines to building a financial foundation — this is the story of a professional triathlete who turned his passion for endurance sports into long-term financial security. in this episode, he breaks down how he planned his finances, navigated an unpredictable income stream, and built a corpus that supports him beyond his sporting career. a deep dive into discipline — both physical and financial. wi   wint wealth",
          "keywords": "",
          "hash": "5ddcc9c6"
        },
        {
          "id": "fYnHcgnpfBA",
          "title": "Are you SPENDING more than you EARN?  | Spender v/s Saver",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 In this episode of the Assumptions series, we pit two very different money mindsets against each other—the Spender and the Miser. What happens when someone who tracks every rupee meets someone who forgets where their last ₹10,000 went? From budgeting and credit card guilt to treating yourself vs saving for your kids' future, no topic is off-limits. Expect sharp questions, honest reactions, and a whole lot of uncomf",
          "publishedAt": "2025-06-29T10:50:00+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/fYnHcgnpfBA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=fYnHcgnpfBA",
          "duration": "PT0S",
          "viewCount": "58191",
          "isLive": false,
          "searchableText": "are you spending more than you earn?  | spender v/s saver fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 in this episode of the assumptions series, we pit two very different money mindsets against each other—the spender and the miser. what happens when someone who tracks every rupee meets someone who forgets where their last ₹10,000 went? from budgeting and credit card guilt to treating yourself vs saving for your kids' future, no topic is off-limits. expect sharp questions, honest reactions, and a whole lot of uncomf   wint wealth",
          "keywords": "",
          "hash": "5bd2467f"
        },
        {
          "id": "qH7YKlmOf1Q",
          "title": "She LEFT Her Job To Work on Her Passion? | Assumptions",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 In this new series, we bust common myths about the so-called \"safe\" corporate path vs the uncertain journey of passion-led careers. Joined by Mrunmayi Oke (Ex-Dunzo, now on a career break) and Srishti Malpath (wellness coach & yoga practitioner), we dive into privilege, paychecks, happiness—and everything in between. Wint Wealth: https://wintwealth.onelink.me/o6zX/wintWealth",
          "publishedAt": "2025-06-21T05:30:34+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/qH7YKlmOf1Q/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=qH7YKlmOf1Q",
          "duration": "PT0S",
          "viewCount": "16475",
          "isLive": false,
          "searchableText": "she left her job to work on her passion? | assumptions fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 in this new series, we bust common myths about the so-called \"safe\" corporate path vs the uncertain journey of passion-led careers. joined by mrunmayi oke (ex-dunzo, now on a career break) and srishti malpath (wellness coach & yoga practitioner), we dive into privilege, paychecks, happiness—and everything in between. wint wealth: https://wintwealth.onelink.me/o6zx/wintwealth   wint wealth",
          "keywords": "",
          "hash": "1a1dd522"
        },
        {
          "id": "h4TViR9nQ-Y",
          "title": "Banks Forced Him to Buy ULIPs?",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 To file your complaint visit RBI Ombudsman Complaint Portal: https://cms.rbi.org.in/cms/indexpage.html#english Who hasn't gotten calls from their banks pitching loans, ULIPs or other special investment products? But are these really good for you? Three former bank employees reveal how they were forced to sell bad products to customers through intense pressure tactics, impossible sales targets, and threats they face",
          "publishedAt": "2025-05-15T13:53:42+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/h4TViR9nQ-Y/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=h4TViR9nQ-Y",
          "duration": "PT0S",
          "viewCount": "107855",
          "isLive": false,
          "searchableText": "banks forced him to buy ulips? fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 to file your complaint visit rbi ombudsman complaint portal: https://cms.rbi.org.in/cms/indexpage.html#english who hasn't gotten calls from their banks pitching loans, ulips or other special investment products? but are these really good for you? three former bank employees reveal how they were forced to sell bad products to customers through intense pressure tactics, impossible sales targets, and threats they face   wint wealth",
          "keywords": "",
          "hash": "06f6f061"
        },
        {
          "id": "YuDRWrJteug",
          "title": "Why He Left 1 Crore+ Salary for a Career Break?",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 In this video, Vaibhav Jain (@VaibhavJain15) shares how he decided to take a career break leaving a 1 Crore+ Salary behind, how he manages his asset allocation for a balanced portfolio, and his roadmap to financial independence. If you're curious about career breaks, smart investing, and planning your corpus — this one’s for you! Wint Wealth: https://wintwealth.onelink.me/o6zX/wintWealth",
          "publishedAt": "2025-03-25T13:41:39+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/YuDRWrJteug/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=YuDRWrJteug",
          "duration": "PT0S",
          "viewCount": "79670",
          "isLive": false,
          "searchableText": "why he left 1 crore+ salary for a career break? fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 in this video, vaibhav jain (@vaibhavjain15) shares how he decided to take a career break leaving a 1 crore+ salary behind, how he manages his asset allocation for a balanced portfolio, and his roadmap to financial independence. if you're curious about career breaks, smart investing, and planning your corpus — this one’s for you! wint wealth: https://wintwealth.onelink.me/o6zx/wintwealth   wint wealth",
          "keywords": "",
          "hash": "f6262022"
        },
        {
          "id": "2IAbw7_wTu4",
          "title": "How Did He Retire With ₹1.3 Crores? | Life Beyond Freedom",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 Naveen Fernandez has been a Certified Financial Planner, insurance advisor, portfolio manager, capital markets professional. In 2016, he decided to retire and pursue what he enjoys - teaching. He talks about - How to plan your retirement - How to choose the right insurance policy - How to financially prepare for emergencies like cancer. Wint Wealth: https://wintwealth.onelink.me/o6zX/wintWealth",
          "publishedAt": "2025-03-11T12:35:30+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/2IAbw7_wTu4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=2IAbw7_wTu4",
          "duration": "PT0S",
          "viewCount": "223223",
          "isLive": false,
          "searchableText": "how did he retire with ₹1.3 crores? | life beyond freedom fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 naveen fernandez has been a certified financial planner, insurance advisor, portfolio manager, capital markets professional. in 2016, he decided to retire and pursue what he enjoys - teaching. he talks about - how to plan your retirement - how to choose the right insurance policy - how to financially prepare for emergencies like cancer. wint wealth: https://wintwealth.onelink.me/o6zx/wintwealth   wint wealth",
          "keywords": "",
          "hash": "833108ce"
        },
        {
          "id": "rDUEOTxbdK8",
          "title": "How Did He Retire With ₹3.5Lakhs Passive Income?",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 In this video, Anandkumar Vittal shares insights from his 25+ year career at companies like Apple and Wipro, revealing how his financial acumen and real estate strategies helped him build a 10Cr+ corpus for a comfortable retirement. Wint Wealth: https://bit.ly/bondsonwint",
          "publishedAt": "2025-03-03T12:36:04+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/rDUEOTxbdK8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=rDUEOTxbdK8",
          "duration": "PT0S",
          "viewCount": "442740",
          "isLive": false,
          "searchableText": "how did he retire with ₹3.5lakhs passive income? fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 in this video, anandkumar vittal shares insights from his 25+ year career at companies like apple and wipro, revealing how his financial acumen and real estate strategies helped him build a 10cr+ corpus for a comfortable retirement. wint wealth: https://bit.ly/bondsonwint   wint wealth",
          "keywords": "",
          "hash": "f7421540"
        },
        {
          "id": "aTCi3L9RzZY",
          "title": "Can this Couple Achieve their Financial Goals?",
          "description": "If you want to be on the next episode of this series, do fill out this form: http://bit.ly/4a5yyZM Vikas and Simran are a young couple on their journey to financial freedom. But they don't know how to go about planning for their goals, where to invest, how much to invest, etc. Preeti Zende, a SEBI Registered Investment Advisor, will be helping them in the financial planning process. Wint Wealth: https://bit.ly/bondsonwint Reach out to Preeti Ma'am on her website: https://apanadhan.com/",
          "publishedAt": "2025-02-16T05:00:00+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/aTCi3L9RzZY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=aTCi3L9RzZY",
          "duration": "PT0S",
          "viewCount": "99880",
          "isLive": false,
          "searchableText": "can this couple achieve their financial goals? if you want to be on the next episode of this series, do fill out this form: http://bit.ly/4a5yyzm vikas and simran are a young couple on their journey to financial freedom. but they don't know how to go about planning for their goals, where to invest, how much to invest, etc. preeti zende, a sebi registered investment advisor, will be helping them in the financial planning process. wint wealth: https://bit.ly/bondsonwint reach out to preeti ma'am on her website: https://apanadhan.com/   wint wealth",
          "keywords": "",
          "hash": "567fc70d"
        }
      ]
    },
    "UCnpekFV93kB1O0rVqEKSumg": {
      "name": "Backstage with Millionaires",
      "category": "upskilling",
      "color": "orange",
      "lastFetched": "2025-08-17T09:41:05.902Z",
      "fetchStatus": "success",
      "fetchDuration": 280,
      "videos": [
        {
          "id": "TUhilRfEMpU",
          "title": "Indian Startup Builds World's Largest 3D-printed Rocket Engine - Indian Startup News 274",
          "description": "https://lu.ma/ybw614eg Click on the link above to apply for the offline event for healthtech founders in Bangalore. Welcome to the Backstage with Millionaires weekly Indian startup news show. This week, Agnikul builds world’s largest single-piece 3d printed rocket engine, Pixxel-led consortium to build India’s first commercial satellite network, Theobroma acquired by ChrysCapital, Backbay launch, Dhruva Space building one of India’s largest satellite mass-production facilities, Fractal Analytics",
          "publishedAt": "2025-08-16T11:29:44+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/TUhilRfEMpU/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=TUhilRfEMpU",
          "duration": "PT0S",
          "viewCount": "6626",
          "isLive": false,
          "searchableText": "indian startup builds world's largest 3d-printed rocket engine - indian startup news 274 https://lu.ma/ybw614eg click on the link above to apply for the offline event for healthtech founders in bangalore. welcome to the backstage with millionaires weekly indian startup news show. this week, agnikul builds world’s largest single-piece 3d printed rocket engine, pixxel-led consortium to build india’s first commercial satellite network, theobroma acquired by chryscapital, backbay launch, dhruva space building one of india’s largest satellite mass-production facilities, fractal analytics   backstage with millionaires",
          "keywords": "",
          "hash": "2d84f654"
        },
        {
          "id": "r9rJkCDSs5I",
          "title": "Indian Startup News 273 - Ather Is Catching up With Ola Electric",
          "description": "Welcome to the Backstage with Millionaires weekly Indian startup news show, hosted by Caleb Friesen. This week, Ather Energy closes in on Ola Electric in the EV race, Dhruva Space announces its first commercial satellite launch with SpaceX, Swiggy considers exiting its stake in Rapido over a conflict of interest, Tesla opens its first charging station in India, PharmEasy appoints Rahul Guha as CEO, and Indian startups raise $187 million. 0:00 Ather Closes Gap With Ola Electric 2:25 Dhruva Space ",
          "publishedAt": "2025-08-09T09:01:55+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/r9rJkCDSs5I/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=r9rJkCDSs5I",
          "duration": "PT0S",
          "viewCount": "27511",
          "isLive": false,
          "searchableText": "indian startup news 273 - ather is catching up with ola electric welcome to the backstage with millionaires weekly indian startup news show, hosted by caleb friesen. this week, ather energy closes in on ola electric in the ev race, dhruva space announces its first commercial satellite launch with spacex, swiggy considers exiting its stake in rapido over a conflict of interest, tesla opens its first charging station in india, pharmeasy appoints rahul guha as ceo, and indian startups raise $187 million. 0:00 ather closes gap with ola electric 2:25 dhruva space    backstage with millionaires",
          "keywords": "",
          "hash": "cb67f449"
        },
        {
          "id": "Wx-GZPXjYv4",
          "title": "How Paytm Turned Profitable? A Case Study",
          "description": "On January 31, 2024, digital payments giant Paytm was hit with a major crisis. The Reserve Bank of India (RBI) imposed a strict penalty, halting transactions on its payments bank and sending shockwaves through the company. Millions of customers and merchants were left without a bank, and in just three days, Paytm’s stock lost more than half its value. Many predicted this was the end for the company that pioneered mobile payments in India. But this is not a story of failure. It's a story of a rem",
          "publishedAt": "2025-08-06T12:02:43+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/Wx-GZPXjYv4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Wx-GZPXjYv4",
          "duration": "PT0S",
          "viewCount": "64938",
          "isLive": false,
          "searchableText": "how paytm turned profitable? a case study on january 31, 2024, digital payments giant paytm was hit with a major crisis. the reserve bank of india (rbi) imposed a strict penalty, halting transactions on its payments bank and sending shockwaves through the company. millions of customers and merchants were left without a bank, and in just three days, paytm’s stock lost more than half its value. many predicted this was the end for the company that pioneered mobile payments in india. but this is not a story of failure. it's a story of a rem   backstage with millionaires",
          "keywords": "",
          "hash": "3096c8b7"
        },
        {
          "id": "gb2vAykHJwI",
          "title": "Indian Startup News 272 - India’s First Hydrogen-Oxygen Engine",
          "description": "Welcome to the Backstage with Millionaires weekly Indian startup news show, hosted by Caleb Friesen. This week, Stardour successfully test-fires India’s first hydrogen-oxygen propulsion engine, Garuda Aerospace secures a license to export drones to global markets, AI startup Astra shuts down just months after funding from Perplexity AI’s founder, Blinkit pilots 10-minute prescription deliveries, Krutrim executes fresh layoffs, and Indian startups raise $35 million. 0:00 Stardour Tests India’s Fi",
          "publishedAt": "2025-08-02T10:15:45+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/gb2vAykHJwI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=gb2vAykHJwI",
          "duration": "PT0S",
          "viewCount": "29965",
          "isLive": false,
          "searchableText": "indian startup news 272 - india’s first hydrogen-oxygen engine welcome to the backstage with millionaires weekly indian startup news show, hosted by caleb friesen. this week, stardour successfully test-fires india’s first hydrogen-oxygen propulsion engine, garuda aerospace secures a license to export drones to global markets, ai startup astra shuts down just months after funding from perplexity ai’s founder, blinkit pilots 10-minute prescription deliveries, krutrim executes fresh layoffs, and indian startups raise $35 million. 0:00 stardour tests india’s fi   backstage with millionaires",
          "keywords": "",
          "hash": "7789037c"
        },
        {
          "id": "09JjGpdGa04",
          "title": "India's Top 5 Defence Startups (2025)",
          "description": "\"Rise of India's Defence Sector\": https://youtu.be/SjJ2Khg3d_c 00:00 Intro 02:10 NewSpace Research and Technologies 04:18 Tonbo Imaging 06:16 Big Bang Boom Solutions 07:58 EyeROV 09:28 Optimized Electrotech The United States has long maintained its military superiority through a unique system where government and private entities collaborate on defense innovation. This model, where initial government funding fuels private sector competition and development, enables the US to build cutting-edge w",
          "publishedAt": "2025-07-29T16:12:26+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/09JjGpdGa04/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=09JjGpdGa04",
          "duration": "PT0S",
          "viewCount": "36007",
          "isLive": false,
          "searchableText": "india's top 5 defence startups (2025) \"rise of india's defence sector\": https://youtu.be/sjj2khg3d_c 00:00 intro 02:10 newspace research and technologies 04:18 tonbo imaging 06:16 big bang boom solutions 07:58 eyerov 09:28 optimized electrotech the united states has long maintained its military superiority through a unique system where government and private entities collaborate on defense innovation. this model, where initial government funding fuels private sector competition and development, enables the us to build cutting-edge w   backstage with millionaires",
          "keywords": "",
          "hash": "fe144680"
        },
        {
          "id": "YKopxrAuYdw",
          "title": "Indian Startup News 271 - Apollyon Dynamics Builds Kamikaze Drones for Indian Army",
          "description": "Welcome to the Backstage with Millionaires weekly Indian startup news show, hosted by Caleb Friesen. This week, the Good Glamm Group is officially breaking up and selling its brands, CoinDCX loses $44 million in a major crypto hack, Blinkit expands its 10-minute ambulance service across Gurugram, BITS Pilani-born Apollyon Dynamics delivers kamikaze drones to the Indian Army, and Indian startups raise $61 million across 5 deals. 0:00 Apollyon Dynamics Builds Kamikaze Drones for Indian Army 1:42 B",
          "publishedAt": "2025-07-26T06:45:17+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/YKopxrAuYdw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=YKopxrAuYdw",
          "duration": "PT0S",
          "viewCount": "23751",
          "isLive": false,
          "searchableText": "indian startup news 271 - apollyon dynamics builds kamikaze drones for indian army welcome to the backstage with millionaires weekly indian startup news show, hosted by caleb friesen. this week, the good glamm group is officially breaking up and selling its brands, coindcx loses $44 million in a major crypto hack, blinkit expands its 10-minute ambulance service across gurugram, bits pilani-born apollyon dynamics delivers kamikaze drones to the indian army, and indian startups raise $61 million across 5 deals. 0:00 apollyon dynamics builds kamikaze drones for indian army 1:42 b   backstage with millionaires",
          "keywords": "",
          "hash": "85e2f366"
        },
        {
          "id": "Ry-D10ISZBM",
          "title": "Indian Startup News 270 - Paras Chopra Announces Lossfunk Batch 5",
          "description": "Welcome to the Backstage with Millionaires weekly Indian startup news show, hosted by Caleb Friesen. This week, Paras Chopra announces 10 cutting-edge projects in Lossfunk’s batch five, Sarvam AI commits to open-sourcing its sovereign LLM under the IndiaAI Mission, Tesla officially enters India with its first showroom and a pricey Model Y launch, Zepto Cafe scales down its 10-minute food service, and Indian startups raise $83 million across sectors like quantum computing, quick commerce, AI vide",
          "publishedAt": "2025-07-19T05:30:18+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/Ry-D10ISZBM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Ry-D10ISZBM",
          "duration": "PT0S",
          "viewCount": "20781",
          "isLive": false,
          "searchableText": "indian startup news 270 - paras chopra announces lossfunk batch 5 welcome to the backstage with millionaires weekly indian startup news show, hosted by caleb friesen. this week, paras chopra announces 10 cutting-edge projects in lossfunk’s batch five, sarvam ai commits to open-sourcing its sovereign llm under the indiaai mission, tesla officially enters india with its first showroom and a pricey model y launch, zepto cafe scales down its 10-minute food service, and indian startups raise $83 million across sectors like quantum computing, quick commerce, ai vide   backstage with millionaires",
          "keywords": "",
          "hash": "f6f9f9c5"
        },
        {
          "id": "bJoxIFWvYYM",
          "title": "What's Really Going On with Ola Electric?",
          "description": "Ola Electric, once hailed as India's EV revolutionary, has seen its stock plummet by nearly 75% since its August 2024 IPO, crashing from a high of ₹157 to a historic low of ₹40. This dramatic fall has slashed its valuation from $7 billion to a mere $1.25 billion in less than a year, making it one of India's most significant new-age company crashes. 🚀 The Meteoric Rise: Founded in 2019, Ola Electric quickly captured investor imagination, raising hundreds of millions and achieving unicorn status ",
          "publishedAt": "2025-07-15T14:58:25+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/bJoxIFWvYYM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=bJoxIFWvYYM",
          "duration": "PT0S",
          "viewCount": "140180",
          "isLive": false,
          "searchableText": "what's really going on with ola electric? ola electric, once hailed as india's ev revolutionary, has seen its stock plummet by nearly 75% since its august 2024 ipo, crashing from a high of ₹157 to a historic low of ₹40. this dramatic fall has slashed its valuation from $7 billion to a mere $1.25 billion in less than a year, making it one of india's most significant new-age company crashes. 🚀 the meteoric rise: founded in 2019, ola electric quickly captured investor imagination, raising hundreds of millions and achieving unicorn status    backstage with millionaires",
          "keywords": "",
          "hash": "2140941d"
        },
        {
          "id": "8qFelT8o6tU",
          "title": "Indian Startup News 269 - The REAL Reason Zepto Is Raising $500M NOW",
          "description": "Welcome to the Backstage with Millionaires weekly Indian startup news show, hosted by Caleb Friesen. This week, Zepto nears a $500 million funding round at a $7 billion valuation, WeWork India’s IPO process resumes after a regulatory pause, Aditya Mangla takes over Zomato’s food delivery business, Starlink gets final approval to launch in India, Rapido enters food delivery, Amazon Now rolls out 10-minute delivery in Delhi, and Indian startups raise $78 million. 0:00 Zepto Close to Closing a $500",
          "publishedAt": "2025-07-12T05:30:06+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/8qFelT8o6tU/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=8qFelT8o6tU",
          "duration": "PT0S",
          "viewCount": "41532",
          "isLive": false,
          "searchableText": "indian startup news 269 - the real reason zepto is raising $500m now welcome to the backstage with millionaires weekly indian startup news show, hosted by caleb friesen. this week, zepto nears a $500 million funding round at a $7 billion valuation, wework india’s ipo process resumes after a regulatory pause, aditya mangla takes over zomato’s food delivery business, starlink gets final approval to launch in india, rapido enters food delivery, amazon now rolls out 10-minute delivery in delhi, and indian startups raise $78 million. 0:00 zepto close to closing a $500   backstage with millionaires",
          "keywords": "",
          "hash": "a8c96a0b"
        },
        {
          "id": "n2VFouvCvQo",
          "title": "Zomato's REAL Plan With District !!",
          "description": "00:00 Intro 01:48 Why District? 05:50 District's Right to Win Ever wondered what Zomato's up to beyond food delivery? Get ready to discover District, Zomato's ambitious new app that's set to revolutionize how we experience the offline world! Initially launched for movies, events, and dining out, District has quietly expanded to list diverse offline stores—from fashion and home decor to furniture. This isn't just a minor update; it's a peek into Deepinder Goyal's audacious plan to build a \"genera",
          "publishedAt": "2025-07-08T14:11:17+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/n2VFouvCvQo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=n2VFouvCvQo",
          "duration": "PT0S",
          "viewCount": "83680",
          "isLive": false,
          "searchableText": "zomato's real plan with district !! 00:00 intro 01:48 why district? 05:50 district's right to win ever wondered what zomato's up to beyond food delivery? get ready to discover district, zomato's ambitious new app that's set to revolutionize how we experience the offline world! initially launched for movies, events, and dining out, district has quietly expanded to list diverse offline stores—from fashion and home decor to furniture. this isn't just a minor update; it's a peek into deepinder goyal's audacious plan to build a \"genera   backstage with millionaires",
          "keywords": "",
          "hash": "8ace63b8"
        },
        {
          "id": "To1JKDrdbLg",
          "title": "Indian Startup News 268 - Indian Drone Startup Makes HISTORY with AMAZING Achievement",
          "description": "Welcome to the Backstage with Millionaires weekly Indian startup news show, hosted by Caleb Friesen. This week, Kalam Labs flies a drone higher than Mount Everest, Zoho acquires Asimov Robotics and launches a deep-tech studio, SatSure and Dhruva Space join forces for satellite-powered insights, the Indian government approves a ₹1 lakh crore deeptech fund, new aggregator rules officially legalize bike taxis, and Indian startups raise $280 million in funding. 0:00 Kalam Labs Drone Goes Higher Than",
          "publishedAt": "2025-07-05T06:53:16+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/To1JKDrdbLg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=To1JKDrdbLg",
          "duration": "PT0S",
          "viewCount": "39914",
          "isLive": false,
          "searchableText": "indian startup news 268 - indian drone startup makes history with amazing achievement welcome to the backstage with millionaires weekly indian startup news show, hosted by caleb friesen. this week, kalam labs flies a drone higher than mount everest, zoho acquires asimov robotics and launches a deep-tech studio, satsure and dhruva space join forces for satellite-powered insights, the indian government approves a ₹1 lakh crore deeptech fund, new aggregator rules officially legalize bike taxis, and indian startups raise $280 million in funding. 0:00 kalam labs drone goes higher than   backstage with millionaires",
          "keywords": "",
          "hash": "473f9116"
        },
        {
          "id": "qxuYUh-lvIk",
          "title": "Indian Startup News 267 - India’s First AI Voice Model Fluent in Hinglish?",
          "description": "Welcome to the Backstage with Millionaires weekly Indian startup news show, hosted by Caleb Friesen. This week, Maya Research launches Veena, an open-source TTS model tailored for Indian voices, Indian astronaut Shubhanshu Shukla boards the ISS via Axiom Space as they partner with Skyroot Aerospace, Tesla begins constructing its first India showroom in Mumbai, Ola Electric’s stock crashes 72% amid market share loss and customer complaints, four Indian deep-tech startups shine at WEF 2025, and In",
          "publishedAt": "2025-06-28T05:09:33+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/qxuYUh-lvIk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=qxuYUh-lvIk",
          "duration": "PT0S",
          "viewCount": "13448",
          "isLive": false,
          "searchableText": "indian startup news 267 - india’s first ai voice model fluent in hinglish? welcome to the backstage with millionaires weekly indian startup news show, hosted by caleb friesen. this week, maya research launches veena, an open-source tts model tailored for indian voices, indian astronaut shubhanshu shukla boards the iss via axiom space as they partner with skyroot aerospace, tesla begins constructing its first india showroom in mumbai, ola electric’s stock crashes 72% amid market share loss and customer complaints, four indian deep-tech startups shine at wef 2025, and in   backstage with millionaires",
          "keywords": "",
          "hash": "e407d9b9"
        },
        {
          "id": "Q2Mj6QEwLbw",
          "title": "Top 100 Startup Ideas from Top Entrepreneurs and VCs",
          "description": "Read the complete report of 100 Great Startup Ideas in 2025 - https://www.theoryofnext.com 00:00 - Intro 01:18 - AI 03:30 - Fintech 05:19 - About Antler 05:52 - Deeptech 07:21 - Consumer 08:52 - Climate 10:42 - Health 12:24 - SAAS Ever wonder what top VCs and successful founders are betting on for the next big thing? We’ve got the inside scoop! In this episode of \"Backstage With Millionaires,\" we're diving into a goldmine of opportunities: Antler India's exclusive report featuring 100 groundbrea",
          "publishedAt": "2025-06-25T12:00:55+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/Q2Mj6QEwLbw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Q2Mj6QEwLbw",
          "duration": "PT0S",
          "viewCount": "41018",
          "isLive": false,
          "searchableText": "top 100 startup ideas from top entrepreneurs and vcs read the complete report of 100 great startup ideas in 2025 - https://www.theoryofnext.com 00:00 - intro 01:18 - ai 03:30 - fintech 05:19 - about antler 05:52 - deeptech 07:21 - consumer 08:52 - climate 10:42 - health 12:24 - saas ever wonder what top vcs and successful founders are betting on for the next big thing? we’ve got the inside scoop! in this episode of \"backstage with millionaires,\" we're diving into a goldmine of opportunities: antler india's exclusive report featuring 100 groundbrea   backstage with millionaires",
          "keywords": "",
          "hash": "d277ad91"
        }
      ]
    },
    "UCf_XYgupvdx7rA44Ap3uI5w": {
      "name": "Full Disclosure",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-08-17T09:41:06.118Z",
      "fetchStatus": "success",
      "fetchDuration": 180,
      "videos": []
    },
    "UCIVl4K2afJgLJv0b2ToTs_g": {
      "name": "GrowthX",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-08-17T09:41:06.037Z",
      "fetchStatus": "success",
      "fetchDuration": 99,
      "videos": [
        {
          "id": "ic4UgTZG1EI",
          "title": "What Will AI Really Look Like in 2027 | Best AI Research Explained",
          "description": "Explore GrowthX: http://growthx.cc/explore-gx GrowthX is a private club of 4,000+ members who lead product, marketing, and growth at companies like SarvamAI, Apple, Zepto, Microsoft, Google, Zerodha, Netflix and Freshworks. CXOs, VPs, ICs — all united by one obsession: compounding their career & company’s growth. GrowthX members get access to : 💎 4,000+ member online private community 💎 In-person monthly events across India 💎 $100K worth credits from top brands 💎 All self-paced learning prog",
          "publishedAt": "2025-08-15T13:30:42+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/ic4UgTZG1EI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=ic4UgTZG1EI",
          "duration": "PT0S",
          "viewCount": "21245",
          "isLive": false,
          "searchableText": "what will ai really look like in 2027 | best ai research explained explore growthx: http://growthx.cc/explore-gx growthx is a private club of 4,000+ members who lead product, marketing, and growth at companies like sarvamai, apple, zepto, microsoft, google, zerodha, netflix and freshworks. cxos, vps, ics — all united by one obsession: compounding their career & company’s growth. growthx members get access to : 💎 4,000+ member online private community 💎 in-person monthly events across india 💎 $100k worth credits from top brands 💎 all self-paced learning prog   growthx",
          "keywords": "",
          "hash": "9307d8cd"
        },
        {
          "id": "xSLUxKlgCK4",
          "title": "Why Maruti Suzuki Dominates The ₹12,000 Crore Taxi Vehicle Market",
          "description": "Join GrowthX: https://growthx.cc/Unfair-Advantage GrowthX is a private club of 4,000+ members who lead product, marketing, and growth at companies like SarvamAI, Apple, Zepto, Microsoft, Google, Zerodha, Netflix and Freshworks. CXOs, VPs, ICs — all united by one obsession: compounding their career & company’s growth. Our members get access to : 💎 4,000+ member online private community 💎 In-person monthly events across India 💎 $100K worth credits from top brands 💎 All self-paced learning prog",
          "publishedAt": "2025-07-30T13:43:06+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/xSLUxKlgCK4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=xSLUxKlgCK4",
          "duration": "PT0S",
          "viewCount": "25018",
          "isLive": false,
          "searchableText": "why maruti suzuki dominates the ₹12,000 crore taxi vehicle market join growthx: https://growthx.cc/unfair-advantage growthx is a private club of 4,000+ members who lead product, marketing, and growth at companies like sarvamai, apple, zepto, microsoft, google, zerodha, netflix and freshworks. cxos, vps, ics — all united by one obsession: compounding their career & company’s growth. our members get access to : 💎 4,000+ member online private community 💎 in-person monthly events across india 💎 $100k worth credits from top brands 💎 all self-paced learning prog   growthx",
          "keywords": "",
          "hash": "3b3afa81"
        }
      ]
    },
    "UC3-IDKNIABI98_J2aqa2YjQ": {
      "name": "Think School Hindi by Zero1",
      "category": "upskilling",
      "color": "orange",
      "lastFetched": "2025-08-17T09:41:06.088Z",
      "fetchStatus": "success",
      "fetchDuration": 150,
      "videos": [
        {
          "id": "qAmdJKNN80Q",
          "title": "Secrets to Build Wealth in Your 30s : Wint Wealth co-founder Anshul Gupta | Indian Business Podcast",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉Spotify link: https://open.spotify.com/episode/3LmUlZycz11CcBGwUTS6X5?si=F2bLFZq5SvuY4LhAT1Nsrw 👉By Think School: https://thethinkschool.com/ 👉VIDEO INTRODUCTION: In this episode of the Indian Business Podcast, we sit down with Anshul Gupt",
          "publishedAt": "2025-08-13T13:45:07+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/qAmdJKNN80Q/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=qAmdJKNN80Q",
          "duration": "PT0S",
          "viewCount": "31833",
          "isLive": false,
          "searchableText": "secrets to build wealth in your 30s : wint wealth co-founder anshul gupta | indian business podcast 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉spotify link: https://open.spotify.com/episode/3lmulzycz11ccbgwuts6x5?si=f2blfzq5svuy4lhat1nsrw 👉by think school: https://thethinkschool.com/ 👉video introduction: in this episode of the indian business podcast, we sit down with anshul gupt   think school hindi by zero1",
          "keywords": "",
          "hash": "6a5a08d7"
        },
        {
          "id": "gUjPXeKImQU",
          "title": "How FOGG’s ₹500 Cr Formula DESTROYED AXE in India ? | Business Case Study",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉By Think School: https://thethinkschool.com/sp/communication-masterclass/ 👉VIDEO INTRODUCTION: Doston ye kahaani shuru hoti hai early 2000s ke Bharat me, jab AXE pure deodorant market ka baadshah hua karta tha!! Ab hum sab jaante hain ki AX",
          "publishedAt": "2025-07-28T12:30:07+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/gUjPXeKImQU/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=gUjPXeKImQU",
          "duration": "PT0S",
          "viewCount": "49321",
          "isLive": false,
          "searchableText": "how fogg’s ₹500 cr formula destroyed axe in india ? | business case study 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉by think school: https://thethinkschool.com/sp/communication-masterclass/ 👉video introduction: doston ye kahaani shuru hoti hai early 2000s ke bharat me, jab axe pure deodorant market ka baadshah hua karta tha!! ab hum sab jaante hain ki ax   think school hindi by zero1",
          "keywords": "",
          "hash": "31e89ec9"
        },
        {
          "id": "RThHElmIBX0",
          "title": "Why does Mumbai Flood every year? How can we fix it?",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉By Think School: https://thethinkschool.com/ 👉VIDEO INTRODUCTION: Mumbai mein floods ekdum waise hain jaise door ke rishtedaar— Har saal bina bulaaye aa jaate hain, poora ghar barbaad karte hain, aur jaate jaate keh jaate hain: \"Agli baar b",
          "publishedAt": "2025-07-23T12:01:02+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/RThHElmIBX0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=RThHElmIBX0",
          "duration": "PT0S",
          "viewCount": "70824",
          "isLive": false,
          "searchableText": "why does mumbai flood every year? how can we fix it? 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉by think school: https://thethinkschool.com/ 👉video introduction: mumbai mein floods ekdum waise hain jaise door ke rishtedaar— har saal bina bulaaye aa jaate hain, poora ghar barbaad karte hain, aur jaate jaate keh jaate hain: \"agli baar b   think school hindi by zero1",
          "keywords": "",
          "hash": "e3668341"
        },
        {
          "id": "r3Fpoi5G2f0",
          "title": "D2C Masterclass : They Laughed at His Achar Business… Now He Runs a ₹500 Cr Empire: Case study",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉By Think School: https://thethinkschool.com/ 👉VIDEO INTRODUCTION: In this episode of the Indian Business Podcast, we sit down with Mr. Dipak Sanghavi - the man behind one of India’s greatest FMCG empires, Nilon's. What started as a humble p",
          "publishedAt": "2025-07-18T12:00:23+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/r3Fpoi5G2f0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=r3Fpoi5G2f0",
          "duration": "PT0S",
          "viewCount": "113941",
          "isLive": false,
          "searchableText": "d2c masterclass : they laughed at his achar business… now he runs a ₹500 cr empire: case study 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉by think school: https://thethinkschool.com/ 👉video introduction: in this episode of the indian business podcast, we sit down with mr. dipak sanghavi - the man behind one of india’s greatest fmcg empires, nilon's. what started as a humble p   think school hindi by zero1",
          "keywords": "",
          "hash": "d235e630"
        },
        {
          "id": "useuxqsLxJ4",
          "title": "Iran’s Plan to DESTROY World Trade: Will PETROL Hit ₹140 in INDIA? | Geopolitical Case Study",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉By Think School: https://thethinkschool.com/sp/communication-masterclass/ 👉VIDEO INTRODUCTION: Doston, jab america ne Iran par airstikes kiye, Iran ne kuch aisa kiya jisse puri duniye ke stock markets hilne lage!! Kyu? Kyuki Iran strait of ",
          "publishedAt": "2025-06-25T10:37:42+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/useuxqsLxJ4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=useuxqsLxJ4",
          "duration": "PT0S",
          "viewCount": "133804",
          "isLive": false,
          "searchableText": "iran’s plan to destroy world trade: will petrol hit ₹140 in india? | geopolitical case study 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉by think school: https://thethinkschool.com/sp/communication-masterclass/ 👉video introduction: doston, jab america ne iran par airstikes kiye, iran ne kuch aisa kiya jisse puri duniye ke stock markets hilne lage!! kyu? kyuki iran strait of    think school hindi by zero1",
          "keywords": "",
          "hash": "be7a2bd6"
        },
        {
          "id": "VAdAzbmDiuc",
          "title": "American Hypocrisy EXPLAINED : 40 years of WAR in Iran | UPSC Geopolitical Case Study",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉By Think School: https://thethinkschool.com/sp/communication-masterclass/ 👉VIDEO INTRODUCTION: Doston, Aaj mai aapko America ki hypocrisy ki ek aisi kahaani batane jaa raha hoon jo aapka sochne ka tareeka hi badal degi. Kyuki ab tak hum sab",
          "publishedAt": "2025-06-23T11:17:25+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/VAdAzbmDiuc/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=VAdAzbmDiuc",
          "duration": "PT0S",
          "viewCount": "348463",
          "isLive": false,
          "searchableText": "american hypocrisy explained : 40 years of war in iran | upsc geopolitical case study 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉by think school: https://thethinkschool.com/sp/communication-masterclass/ 👉video introduction: doston, aaj mai aapko america ki hypocrisy ki ek aisi kahaani batane jaa raha hoon jo aapka sochne ka tareeka hi badal degi. kyuki ab tak hum sab   think school hindi by zero1",
          "keywords": "",
          "hash": "92830688"
        },
        {
          "id": "csQAXFF2P68",
          "title": "Iran is Burning : Why are US and Israel afraid of Iran’s Nuclear Progresss? : UPSC Case study",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉By Think School: https://thethinkschool.com/sp/communication-masterclass-2-1/ 👉VIDEO INTRODUCTION: Doston, Iran aur Israel ab jung ke maidan mein utar chuke hain! Aur har guzarti ghadi ke saath ye jung aur bhi zyada khatarnaak hoti ja rahi ",
          "publishedAt": "2025-06-19T15:25:10+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/csQAXFF2P68/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=csQAXFF2P68",
          "duration": "PT0S",
          "viewCount": "228447",
          "isLive": false,
          "searchableText": "iran is burning : why are us and israel afraid of iran’s nuclear progresss? : upsc case study 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉by think school: https://thethinkschool.com/sp/communication-masterclass-2-1/ 👉video introduction: doston, iran aur israel ab jung ke maidan mein utar chuke hain! aur har guzarti ghadi ke saath ye jung aur bhi zyada khatarnaak hoti ja rahi    think school hindi by zero1",
          "keywords": "",
          "hash": "5c0f4ab3"
        }
      ]
    },
    "UCyKj-yaTpbnWZY90ajxB8WQ": {
      "name": "Ditto Insurance",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-08-17T09:41:06.054Z",
      "fetchStatus": "success",
      "fetchDuration": 115,
      "videos": [
        {
          "id": "STE9mCgyVyc",
          "title": "Why You Should Pick These 2 Riders in Your Term Life Insurance | Riders & Add-ons EXPLAINED | Ditto",
          "description": "Want FREE Guidance for your Term or Health Insurance needs? Book a FREE call here - https://ditto.sh/q5cj7r In this video, we discuss some of the most important aspects of Riders in Term Insurance, including how different Life Insurance Riders work, which add-ons in Term Insurance are genuinely worth paying for, and how to evaluate add-ons on Life Insurance in 2025. We’ll also cover : → Why Terminal Illness Benefit is a must-have feature. →Whether Zero-Cost Exit Term Plans really make sense. → H",
          "publishedAt": "2025-08-16T08:04:09+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/STE9mCgyVyc/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=STE9mCgyVyc",
          "duration": "PT0S",
          "viewCount": "841",
          "isLive": false,
          "searchableText": "why you should pick these 2 riders in your term life insurance | riders & add-ons explained | ditto want free guidance for your term or health insurance needs? book a free call here - https://ditto.sh/q5cj7r in this video, we discuss some of the most important aspects of riders in term insurance, including how different life insurance riders work, which add-ons in term insurance are genuinely worth paying for, and how to evaluate add-ons on life insurance in 2025. we’ll also cover : → why terminal illness benefit is a must-have feature. →whether zero-cost exit term plans really make sense. → h   ditto insurance",
          "keywords": "",
          "hash": "ccedd0ad"
        },
        {
          "id": "NvEWSIX98F8",
          "title": "Acko Platinum or Digit Infinity Wallet Plus *DETAILED COMPARISON* | Health Insurance 2025 | Ditto",
          "description": "Ditto can help you compare plans, purchase a policy and stand with you during claims, for FREE. Book a free consultation today - https://ditto.sh/gjd6ne In this video, we compare ACKO Platinum Health Insurance Plan with its “Unlimited Sum Insured” and Digit Infinity Wallet Health Insurance Plan with its ₹3 crore cover — breaking down benefits, limits, premiums, waiting periods, and real-world performance. By the end, you’ll know which plan delivers, which one stumbles, and whether either truly d",
          "publishedAt": "2025-08-14T06:02:48+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/NvEWSIX98F8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=NvEWSIX98F8",
          "duration": "PT0S",
          "viewCount": "539",
          "isLive": false,
          "searchableText": "acko platinum or digit infinity wallet plus *detailed comparison* | health insurance 2025 | ditto ditto can help you compare plans, purchase a policy and stand with you during claims, for free. book a free consultation today - https://ditto.sh/gjd6ne in this video, we compare acko platinum health insurance plan with its “unlimited sum insured” and digit infinity wallet health insurance plan with its ₹3 crore cover — breaking down benefits, limits, premiums, waiting periods, and real-world performance. by the end, you’ll know which plan delivers, which one stumbles, and whether either truly d   ditto insurance",
          "keywords": "",
          "hash": "2cde6a9f"
        },
        {
          "id": "-K9IwnozzOY",
          "title": "This Mistake Can Cost Your Family Their Term Insurance Money | Nominee vs Assignee | Ditto Insurance",
          "description": "Looking for quality and FREE advice regarding Health or Term Insurance? Book a FREE call with our advisors. No spam guaranteed - https://ditto.sh/s0lk7h When people buy a term insurance policy, they often focus on the big things — the sum assured, the premium, the riders. But the fine print around nomination and assignment can decide whether your family smoothly gets the payout… or ends up stuck in a legal dispute. In this video, we break down the difference between nomination in term insurance ",
          "publishedAt": "2025-08-12T06:55:35+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/-K9IwnozzOY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=-K9IwnozzOY",
          "duration": "PT0S",
          "viewCount": "754",
          "isLive": false,
          "searchableText": "this mistake can cost your family their term insurance money | nominee vs assignee | ditto insurance looking for quality and free advice regarding health or term insurance? book a free call with our advisors. no spam guaranteed - https://ditto.sh/s0lk7h when people buy a term insurance policy, they often focus on the big things — the sum assured, the premium, the riders. but the fine print around nomination and assignment can decide whether your family smoothly gets the payout… or ends up stuck in a legal dispute. in this video, we break down the difference between nomination in term insurance    ditto insurance",
          "keywords": "",
          "hash": "2a3a7f83"
        },
        {
          "id": "_JOU1dWWWs0",
          "title": "Top ₹1 Crore Term Insurance Plans | Best Affordable Term Plans in India 2025 | Ditto",
          "description": "If you’re confused about which term insurance plan is right for you, book a FREE call with Ditto’s advisors - https://ditto.sh/38j20k In 2025, the term insurance market is full of plans that all promise the same basic benefit — financial protection for your family — yet differ significantly in pricing, features, and long-term value. In this video, we compare four of the most popular ₹1 crore term plans in India: ICICI iProtect Smart Plus, Axis Max Life Smart Term Plan Plus, Bajaj Allianz eTouch ",
          "publishedAt": "2025-08-11T06:54:56+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/_JOU1dWWWs0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=_JOU1dWWWs0",
          "duration": "PT0S",
          "viewCount": "1900",
          "isLive": false,
          "searchableText": "top ₹1 crore term insurance plans | best affordable term plans in india 2025 | ditto if you’re confused about which term insurance plan is right for you, book a free call with ditto’s advisors - https://ditto.sh/38j20k in 2025, the term insurance market is full of plans that all promise the same basic benefit — financial protection for your family — yet differ significantly in pricing, features, and long-term value. in this video, we compare four of the most popular ₹1 crore term plans in india: icici iprotect smart plus, axis max life smart term plan plus, bajaj allianz etouch    ditto insurance",
          "keywords": "",
          "hash": "3cc18202"
        },
        {
          "id": "VW0QtSzM8CY",
          "title": "Best Health Insurance Plans DIABETES Coverage in 2025 | Top Health Insurance Plans | Ditto Insurance",
          "description": "Confused about which health insurance plan to choose if you have diabetes? Book a FREE call with Ditto’s advisors & we’ll recommend the best health insurance for your diabetes profile - https://ditto.sh/2upqyp If you’re living with diabetes in India, finding the right health insurance plan can feel like a constant struggle. You might hear “diabetes covered” in the brochure, only to find out during underwriting that your application is rejected, or the policy excludes insulin users. This video br",
          "publishedAt": "2025-08-09T05:35:50+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/VW0QtSzM8CY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=VW0QtSzM8CY",
          "duration": "PT0S",
          "viewCount": "1144",
          "isLive": false,
          "searchableText": "best health insurance plans diabetes coverage in 2025 | top health insurance plans | ditto insurance confused about which health insurance plan to choose if you have diabetes? book a free call with ditto’s advisors & we’ll recommend the best health insurance for your diabetes profile - https://ditto.sh/2upqyp if you’re living with diabetes in india, finding the right health insurance plan can feel like a constant struggle. you might hear “diabetes covered” in the brochure, only to find out during underwriting that your application is rejected, or the policy excludes insulin users. this video br   ditto insurance",
          "keywords": "",
          "hash": "3e1f52e0"
        },
        {
          "id": "47bpFT87eNk",
          "title": "How to Select the Best Term Insurance Plan | Key Metrics to Consider | Ditto Insurance",
          "description": "If you're wondering how to pick the best term insurance company, don't worry and just book a FREE call with our certified advisors at Ditto: https://ditto.sh/bpi5tr When it comes to choosing term insurance, most people focus only on premiums. But what truly matters is whether your insurer will deliver when it counts — during a claim. In this video, we break down the key insurance company performance metrics that often get ignored but can make or break your family’s financial safety net. We’ll wa",
          "publishedAt": "2025-08-07T11:00:08+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/47bpFT87eNk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=47bpFT87eNk",
          "duration": "PT0S",
          "viewCount": "1080",
          "isLive": false,
          "searchableText": "how to select the best term insurance plan | key metrics to consider | ditto insurance if you're wondering how to pick the best term insurance company, don't worry and just book a free call with our certified advisors at ditto: https://ditto.sh/bpi5tr when it comes to choosing term insurance, most people focus only on premiums. but what truly matters is whether your insurer will deliver when it counts — during a claim. in this video, we break down the key insurance company performance metrics that often get ignored but can make or break your family’s financial safety net. we’ll wa   ditto insurance",
          "keywords": "",
          "hash": "be7eb5d5"
        },
        {
          "id": "NzvWmc6sPDE",
          "title": "Aditya Birla Activ One Max vs Niva Bupa Aspire | Best Health Insurance Comparison 2025 | Ditto",
          "description": "Confused about selecting the best health insurance plan? Don’t worry, we’re here to help! Book a free call with Ditto and let our experts guide you to the right choice - https://ditto.sh/nab8qt In this video, we compare Aditya Birla Activ One Max Health Insurance and Niva Bupa Aspire Titanium+ Health Insurance in detail — breaking down: - Which insurer is more trusted based on Claim Settlement Ratios (CSR), Incurred Claim Ratios (ICR), and complaints - Core built-in benefits and differences in r",
          "publishedAt": "2025-08-05T13:49:51+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/NzvWmc6sPDE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=NzvWmc6sPDE",
          "duration": "PT0S",
          "viewCount": "2633",
          "isLive": false,
          "searchableText": "aditya birla activ one max vs niva bupa aspire | best health insurance comparison 2025 | ditto confused about selecting the best health insurance plan? don’t worry, we’re here to help! book a free call with ditto and let our experts guide you to the right choice - https://ditto.sh/nab8qt in this video, we compare aditya birla activ one max health insurance and niva bupa aspire titanium+ health insurance in detail — breaking down: - which insurer is more trusted based on claim settlement ratios (csr), incurred claim ratios (icr), and complaints - core built-in benefits and differences in r   ditto insurance",
          "keywords": "",
          "hash": "ab3e86c2"
        },
        {
          "id": "pBg2x114tHw",
          "title": "The TRUTH About Family Floater Plans NOBODY Tells You | Family Floater Health Insurance Plan | Ditto",
          "description": "If you’re looking for help selecting the right plan or structuring your family’s health coverage the smart way, book a free 1-on-1 call with Ditto’s advisors. It only takes 2 minutes to book, and it’s completely free: https://ditto.sh/s9q6c9 In this video, we break down everything you need to know about family floater health insurance plans—how they work, who can be included, how premiums are calculated, and whether you should actually buy one. You’ll also learn when it’s smarter to split into i",
          "publishedAt": "2025-08-04T11:27:26+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/pBg2x114tHw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=pBg2x114tHw",
          "duration": "PT0S",
          "viewCount": "2896",
          "isLive": false,
          "searchableText": "the truth about family floater plans nobody tells you | family floater health insurance plan | ditto if you’re looking for help selecting the right plan or structuring your family’s health coverage the smart way, book a free 1-on-1 call with ditto’s advisors. it only takes 2 minutes to book, and it’s completely free: https://ditto.sh/s9q6c9 in this video, we break down everything you need to know about family floater health insurance plans—how they work, who can be included, how premiums are calculated, and whether you should actually buy one. you’ll also learn when it’s smarter to split into i   ditto insurance",
          "keywords": "",
          "hash": "e7153feb"
        },
        {
          "id": "KcSPXPGZlyA",
          "title": "Stop WASTING Money on Overlong Term Life Insurance Plans | How to Choose Term Insurance | Ditto",
          "description": "👉 Need help comparing and choosing the best health and term insurance? Book a FREE call with our advisors: https://ditto.sh/i2dclb Most people focus on how much term insurance they need. But very few ask: How long should I keep paying for it? Should your term plan last till you're 60? 65? 70? Or even 99? In this video, we’re unpacking one of the most misunderstood decisions in term insurance—how to choose the right policy duration based on your age, dependents, loans, and life goals. We’ll walk",
          "publishedAt": "2025-08-02T08:16:36+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/KcSPXPGZlyA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=KcSPXPGZlyA",
          "duration": "PT0S",
          "viewCount": "1395",
          "isLive": false,
          "searchableText": "stop wasting money on overlong term life insurance plans | how to choose term insurance | ditto 👉 need help comparing and choosing the best health and term insurance? book a free call with our advisors: https://ditto.sh/i2dclb most people focus on how much term insurance they need. but very few ask: how long should i keep paying for it? should your term plan last till you're 60? 65? 70? or even 99? in this video, we’re unpacking one of the most misunderstood decisions in term insurance—how to choose the right policy duration based on your age, dependents, loans, and life goals. we’ll walk   ditto insurance",
          "keywords": "",
          "hash": "941ce910"
        },
        {
          "id": "Q-4AtsedWPQ",
          "title": "Acko Health Insurance *DETAILED REVIEW* 2025 | Acko Platinum, Acko Standard | Ditto Insurance",
          "description": "For spam-free and unbiased health (or term) insurance advice, book a FREE call with Ditto's IRDAI-certified advisors - https://ditto.sh/94dngj ACKO Health Insurance is one of the newer players in India’s retail health insurance space. Their big promise? A paperless, agent-free, direct-to-customer plan that cuts down commission costs and gives you everything digitally—OPD coverage, unlimited hospitalisation, even wellness services. But is the reality as impressive as the brochure? In this video, ",
          "publishedAt": "2025-07-31T15:17:48+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/Q-4AtsedWPQ/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Q-4AtsedWPQ",
          "duration": "PT0S",
          "viewCount": "3013",
          "isLive": false,
          "searchableText": "acko health insurance *detailed review* 2025 | acko platinum, acko standard | ditto insurance for spam-free and unbiased health (or term) insurance advice, book a free call with ditto's irdai-certified advisors - https://ditto.sh/94dngj acko health insurance is one of the newer players in india’s retail health insurance space. their big promise? a paperless, agent-free, direct-to-customer plan that cuts down commission costs and gives you everything digitally—opd coverage, unlimited hospitalisation, even wellness services. but is the reality as impressive as the brochure? in this video,    ditto insurance",
          "keywords": "",
          "hash": "66cdc3fb"
        },
        {
          "id": "X4z9k0bgE1I",
          "title": "Should You Go With Regular Pay or Limited Pay in Term Life Insurance | Ditto Insurance",
          "description": "Need help with your term or health insurance needs? Book a FREE call with our expert advisors at Ditto. Takes just 2 minutes: https://ditto.sh/g63cn9 If you're planning to buy Term Insurance or already comparing Term Life Insurance plans, there's one question most people miss: how long should you actually pay premiums? Should you stretch payments over 30–40 years (Regular Pay)? Or finish it all in 10–15 years and never worry again (Limited Pay)? In this video, we break down the most under-rated ",
          "publishedAt": "2025-07-30T12:07:08+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/X4z9k0bgE1I/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=X4z9k0bgE1I",
          "duration": "PT0S",
          "viewCount": "2040",
          "isLive": false,
          "searchableText": "should you go with regular pay or limited pay in term life insurance | ditto insurance need help with your term or health insurance needs? book a free call with our expert advisors at ditto. takes just 2 minutes: https://ditto.sh/g63cn9 if you're planning to buy term insurance or already comparing term life insurance plans, there's one question most people miss: how long should you actually pay premiums? should you stretch payments over 30–40 years (regular pay)? or finish it all in 10–15 years and never worry again (limited pay)? in this video, we break down the most under-rated    ditto insurance",
          "keywords": "",
          "hash": "c620898c"
        }
      ]
    },
    "UCOu85KXcYcEClNAeiKrDA6Q": {
      "name": "Indian Silicon Valley by Jivraj Singh Sachar",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-08-17T09:41:06.047Z",
      "fetchStatus": "success",
      "fetchDuration": 107,
      "videos": [
        {
          "id": "Bhp3MjZg3as",
          "title": "The Indian Engineer Who Built Two $10B Startups From Scratch",
          "description": "What does it take to build two $10B enterprise companies from scratch—and then start again? In this episode, we sit down with Mohit Aron—founder of Nutanix and Cohesity, and now on his third venture—to break down the rare skill of building billion-dollar companies predictably. From Chandigarh to IIT Delhi to Google’s core infrastructure team, Mohit’s career has been a masterclass in spotting inflection points, creating new categories, and surrounding himself with the right people. We unpack his ",
          "publishedAt": "2025-08-15T14:13:22+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/Bhp3MjZg3as/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Bhp3MjZg3as",
          "duration": "PT0S",
          "viewCount": "618",
          "isLive": false,
          "searchableText": "the indian engineer who built two $10b startups from scratch what does it take to build two $10b enterprise companies from scratch—and then start again? in this episode, we sit down with mohit aron—founder of nutanix and cohesity, and now on his third venture—to break down the rare skill of building billion-dollar companies predictably. from chandigarh to iit delhi to google’s core infrastructure team, mohit’s career has been a masterclass in spotting inflection points, creating new categories, and surrounding himself with the right people. we unpack his    indian silicon valley by jivraj singh sachar",
          "keywords": "",
          "hash": "f1c960d9"
        },
        {
          "id": "zqZoU4acOHY",
          "title": "From Pune to NASA — Why He Left India to Build a Global SaaS Giant | Jaspreet Singh, Druva",
          "description": "What do you risk when you leave India, walk away from paying customers, and bet your entire company on the cloud—years before it’s obvious? In this episode, we sit down with Jaspreet Singh, founder & CEO of Druva—a cloud-native platform for backup, rapid cyber recovery, and data forensics. We trace how Druva pivoted from disaster-recovery pilots in India to remote-endpoint protection, and then all-in SaaS on AWS—earning trust from logos like NASA and the US Army, and becoming one of the largest ",
          "publishedAt": "2025-08-08T14:05:10+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/zqZoU4acOHY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=zqZoU4acOHY",
          "duration": "PT0S",
          "viewCount": "516",
          "isLive": false,
          "searchableText": "from pune to nasa — why he left india to build a global saas giant | jaspreet singh, druva what do you risk when you leave india, walk away from paying customers, and bet your entire company on the cloud—years before it’s obvious? in this episode, we sit down with jaspreet singh, founder & ceo of druva—a cloud-native platform for backup, rapid cyber recovery, and data forensics. we trace how druva pivoted from disaster-recovery pilots in india to remote-endpoint protection, and then all-in saas on aws—earning trust from logos like nasa and the us army, and becoming one of the largest    indian silicon valley by jivraj singh sachar",
          "keywords": "",
          "hash": "404c3db1"
        },
        {
          "id": "KgbNZ6tD7Xw",
          "title": "The Untold Story of India’s First Tech Empire | Arjun Malhotra: Co-Founder, HCL",
          "description": "What if India’s IT revolution didn’t begin with Infosys or TCS — but with a ₹1.75 lakh computer company in 1975? In this episode, we sit down with Arjun Malhotra, co-founder of HCL, to trace the real origin story of India’s tech industry. From building the country’s first microcomputer to mentoring the future giants of Indian IT, Arjun’s journey spans nearly five decades of impact. We unpack how six founders built a category-defining company at a time when India had no startup ecosystem, no vent",
          "publishedAt": "2025-08-02T13:30:16+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/KgbNZ6tD7Xw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=KgbNZ6tD7Xw",
          "duration": "PT0S",
          "viewCount": "3954",
          "isLive": false,
          "searchableText": "the untold story of india’s first tech empire | arjun malhotra: co-founder, hcl what if india’s it revolution didn’t begin with infosys or tcs — but with a ₹1.75 lakh computer company in 1975? in this episode, we sit down with arjun malhotra, co-founder of hcl, to trace the real origin story of india’s tech industry. from building the country’s first microcomputer to mentoring the future giants of indian it, arjun’s journey spans nearly five decades of impact. we unpack how six founders built a category-defining company at a time when india had no startup ecosystem, no vent   indian silicon valley by jivraj singh sachar",
          "keywords": "",
          "hash": "b6bf8fb1"
        }
      ]
    },
    "UCyUQxtFk3guy3WHaZ-2NNOg": {
      "name": "Anurag Bansal",
      "category": "upskilling",
      "color": "orange",
      "lastFetched": "2025-08-17T09:41:06.321Z",
      "fetchStatus": "success",
      "fetchDuration": 203,
      "videos": [
        {
          "id": "oPUL-mtwRE4",
          "title": "Aamir Khan’s ₹100 Experiment That Could Reshape Bollywood",
          "description": "Aamir Khan just released his latest film Sitaare Zameen Par, but not in theatres, and not on Netflix, Prime Video, or Hotstar. Instead, it’s available only on YouTube - for ₹100! In this video, I break down why this isn’t just a weird one-off move. It’s a bold experiment that challenges how films get distributed in India. With just 10,000 cinema screens and increasingly selective OTT platforms, has YouTube quietly become the most powerful distribution tool for Indian filmmakers? We’ll explore: -",
          "publishedAt": "2025-08-08T12:00:07+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/oPUL-mtwRE4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=oPUL-mtwRE4",
          "duration": "PT0S",
          "viewCount": "43550",
          "isLive": false,
          "searchableText": "aamir khan’s ₹100 experiment that could reshape bollywood aamir khan just released his latest film sitaare zameen par, but not in theatres, and not on netflix, prime video, or hotstar. instead, it’s available only on youtube - for ₹100! in this video, i break down why this isn’t just a weird one-off move. it’s a bold experiment that challenges how films get distributed in india. with just 10,000 cinema screens and increasingly selective ott platforms, has youtube quietly become the most powerful distribution tool for indian filmmakers? we’ll explore: -   anurag bansal",
          "keywords": "",
          "hash": "8a76aaff"
        },
        {
          "id": "aAYNV_D1gpo",
          "title": "Everyone says Labubu is just hype. I disagree.",
          "description": "Labubu, Pop Mart’s viral collectible toy, is being dismissed by many as nothing more than hype. From India to the US, critics call it just another passing craze. But what if that’s the wrong way to look at it? In this video, we explore why Labubu could be more than just a fad. From Pokémon cards to TikTok, history shows that what starts as “hype” can evolve into cultural icons. Could Labubu be on the same path? Big thanks to Zero1 Media Network (https://zero1byzerodha.com/network) for supporting",
          "publishedAt": "2025-08-04T10:30:01+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/aAYNV_D1gpo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=aAYNV_D1gpo",
          "duration": "PT0S",
          "viewCount": "5336",
          "isLive": false,
          "searchableText": "everyone says labubu is just hype. i disagree. labubu, pop mart’s viral collectible toy, is being dismissed by many as nothing more than hype. from india to the us, critics call it just another passing craze. but what if that’s the wrong way to look at it? in this video, we explore why labubu could be more than just a fad. from pokémon cards to tiktok, history shows that what starts as “hype” can evolve into cultural icons. could labubu be on the same path? big thanks to zero1 media network (https://zero1byzerodha.com/network) for supporting   anurag bansal",
          "keywords": "",
          "hash": "fbef6d42"
        },
        {
          "id": "9CPDTY2SS40",
          "title": "Why MRF’s Bet on Shubman Gill Isn’t Just Simple Marketing",
          "description": "In this video, I break down one of the most fascinating marketing strategies in Indian sports. For about 35 years, MRF - a tire company - has been putting red stickers on cricket bats carried by legendary cricketers like Sachin Tendulkar, Brian Lara, Virat Kohli, and now Shubman Gill. This isn't just a regular sponsorship deal. While most brands chase short-term targets, MRF focuses on playing a multi-decade customer loyalty game. They've cracked the code on turning a boring purchase like tyres ",
          "publishedAt": "2025-07-25T12:39:10+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/9CPDTY2SS40/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=9CPDTY2SS40",
          "duration": "PT0S",
          "viewCount": "70197",
          "isLive": false,
          "searchableText": "why mrf’s bet on shubman gill isn’t just simple marketing in this video, i break down one of the most fascinating marketing strategies in indian sports. for about 35 years, mrf - a tire company - has been putting red stickers on cricket bats carried by legendary cricketers like sachin tendulkar, brian lara, virat kohli, and now shubman gill. this isn't just a regular sponsorship deal. while most brands chase short-term targets, mrf focuses on playing a multi-decade customer loyalty game. they've cracked the code on turning a boring purchase like tyres    anurag bansal",
          "keywords": "",
          "hash": "2db490f3"
        }
      ]
    },
    "UCcPI9kEPhyUDLBHGOhKqxOw": {
      "name": "Breakdown",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-08-17T09:41:06.245Z",
      "fetchStatus": "success",
      "fetchDuration": 127,
      "videos": [
        {
          "id": "XcJKEilzcFo",
          "title": "Is OTT killing India's ₹12,000 crore Cinema Industry?",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Report PDF Link - https://www.ormaxmedia.com/insights/stories/the-ormax-box-office-2024-report.html 0:00 - lntro 1:42 - Zerodha shoutout 1:55 - History of Indian cinema 6:15 - The present of Indian cinema 9:32 - PVR’s financial report 12:38 - OTT’s impact on cinema industry 13:42 - The future of Indian cinema 17:42 - Conclusion",
          "publishedAt": "2025-08-14T12:30:40+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/XcJKEilzcFo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=XcJKEilzcFo",
          "duration": "PT0S",
          "viewCount": "5543",
          "isLive": false,
          "searchableText": "is ott killing india's ₹12,000 crore cinema industry? breakdown is a part of zero1 network - https://zero1byzerodha.com/network report pdf link - https://www.ormaxmedia.com/insights/stories/the-ormax-box-office-2024-report.html 0:00 - lntro 1:42 - zerodha shoutout 1:55 - history of indian cinema 6:15 - the present of indian cinema 9:32 - pvr’s financial report 12:38 - ott’s impact on cinema industry 13:42 - the future of indian cinema 17:42 - conclusion   breakdown",
          "keywords": "",
          "hash": "670f8fd2"
        },
        {
          "id": "_PC2KVfn2zA",
          "title": "What’s Next for India’s ₹40,000 Crore Quick Commerce Industry",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Source Link - Source tweet: 1. https://x.com/vaibhavbetter/status/1839308292616606068 2. TD’s blog – https://www.linkedin.com/pulse/why-we-invested-myra-potent-synthesis-technology-operations-davda/?lipi=urn%3Ali%3Apage%3Ad_flagship3_detail_base%3BwoMYzx5OQcC%2Br67W1oNUGQ%3D%3D 3. Link to discussion: https://www.linkedin.com/posts/rahul-jaideep-mathur_startups-india-activity-7290593137113128960-_uYX 4. Source: https://econ",
          "publishedAt": "2025-08-04T09:22:36+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/_PC2KVfn2zA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=_PC2KVfn2zA",
          "duration": "PT0S",
          "viewCount": "11736",
          "isLive": false,
          "searchableText": "what’s next for india’s ₹40,000 crore quick commerce industry breakdown is a part of zero1 network - https://zero1byzerodha.com/network source link - source tweet: 1. https://x.com/vaibhavbetter/status/1839308292616606068 2. td’s blog – https://www.linkedin.com/pulse/why-we-invested-myra-potent-synthesis-technology-operations-davda/?lipi=urn%3ali%3apage%3ad_flagship3_detail_base%3bwomyzx5oqcc%2br67w1onugq%3d%3d 3. link to discussion: https://www.linkedin.com/posts/rahul-jaideep-mathur_startups-india-activity-7290593137113128960-_uyx 4. source: https://econ   breakdown",
          "keywords": "",
          "hash": "b1d366ee"
        },
        {
          "id": "hv3GKosCnn4",
          "title": "How VCs make billions - explained by a VC",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Report PDF Link - https://docsend.com/view/dhsmcxgdtjweytjr In this video, we dive deep into the world of venture capital, uncovering the high-stakes bets that turned ordinary investments into billions! From David Sheridan's game-changing investment in Google to Accel Partners' stunning $1 million bet on Flipkart, venture capital has a fascinating history of creating tech giants. What is venture capital, and how did it evo",
          "publishedAt": "2025-07-27T07:30:19+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/hv3GKosCnn4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=hv3GKosCnn4",
          "duration": "PT0S",
          "viewCount": "18058",
          "isLive": false,
          "searchableText": "how vcs make billions - explained by a vc breakdown is a part of zero1 network - https://zero1byzerodha.com/network report pdf link - https://docsend.com/view/dhsmcxgdtjweytjr in this video, we dive deep into the world of venture capital, uncovering the high-stakes bets that turned ordinary investments into billions! from david sheridan's game-changing investment in google to accel partners' stunning $1 million bet on flipkart, venture capital has a fascinating history of creating tech giants. what is venture capital, and how did it evo   breakdown",
          "keywords": "",
          "hash": "1053b6b1"
        },
        {
          "id": "m6AH8KrQlHk",
          "title": "How India’s Top Creators Are Really Making Money",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report PDF Link - https://web-assets.bcg.com/c8/35/2a008ddf4e049d99a901b17233f0/gift-report.pdf India has over 25 lakh digital content creators. But guess what? Fewer than 3 lakh of them are actually making money. In this deep dive, we uncover the harsh truth behind India’s struggling creator economy — why monetization is broken, why the industry is stuck in a loop, and how creators can break free by thinking li",
          "publishedAt": "2025-07-19T08:53:31+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/m6AH8KrQlHk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=m6AH8KrQlHk",
          "duration": "PT0S",
          "viewCount": "30165",
          "isLive": false,
          "searchableText": "how india’s top creators are really making money breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report pdf link - https://web-assets.bcg.com/c8/35/2a008ddf4e049d99a901b17233f0/gift-report.pdf india has over 25 lakh digital content creators. but guess what? fewer than 3 lakh of them are actually making money. in this deep dive, we uncover the harsh truth behind india’s struggling creator economy — why monetization is broken, why the industry is stuck in a loop, and how creators can break free by thinking li   breakdown",
          "keywords": "",
          "hash": "00438a0d"
        },
        {
          "id": "98N46iJnPMM",
          "title": "The Story Of Lab Grown Diamonds",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report Link - The Future of the Natural Diamond Industry - https://web-assets.bcg.com/87/88/44ce24b646969ef49aa5a9c4b8b6/bcg-the-future-of-the-natural-diamond-industry-may.pdf In this week's Breakdown, we explore the fascinating history of diamonds — from their origins in ancient India to the marketing masterstroke by De Beers that made \"A diamond is forever\" a global truth. We also unpack the rise of lab-grown ",
          "publishedAt": "2025-07-07T12:30:12+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/98N46iJnPMM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=98N46iJnPMM",
          "duration": "PT0S",
          "viewCount": "7898",
          "isLive": false,
          "searchableText": "the story of lab grown diamonds breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report link - the future of the natural diamond industry - https://web-assets.bcg.com/87/88/44ce24b646969ef49aa5a9c4b8b6/bcg-the-future-of-the-natural-diamond-industry-may.pdf in this week's breakdown, we explore the fascinating history of diamonds — from their origins in ancient india to the marketing masterstroke by de beers that made \"a diamond is forever\" a global truth. we also unpack the rise of lab-grown    breakdown",
          "keywords": "",
          "hash": "8b044b85"
        },
        {
          "id": "EtI5rxlIW4c",
          "title": "Is Quick Commerce Killing Your Local Kirana Store? | Breakdown",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report Link - QC vs Kirana - https://www.pwc.in/assets/pdfs/retail-reinvention-paradigm-v1.pdf You've probably noticed it—fewer people walking into local kirana shops, more ordering from apps. But is quick commerce really to blame? In this Breakdown, we go beyond the headlines. We dive into fresh data from PWC and Kirana Club, and uncover what’s actually happening on the ground. 0:00 Introduction 1:25 Zerodha Sh",
          "publishedAt": "2025-06-29T07:30:10+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/EtI5rxlIW4c/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=EtI5rxlIW4c",
          "duration": "PT0S",
          "viewCount": "20799",
          "isLive": false,
          "searchableText": "is quick commerce killing your local kirana store? | breakdown breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report link - qc vs kirana - https://www.pwc.in/assets/pdfs/retail-reinvention-paradigm-v1.pdf you've probably noticed it—fewer people walking into local kirana shops, more ordering from apps. but is quick commerce really to blame? in this breakdown, we go beyond the headlines. we dive into fresh data from pwc and kirana club, and uncover what’s actually happening on the ground. 0:00 introduction 1:25 zerodha sh   breakdown",
          "keywords": "",
          "hash": "4f8b79fe"
        },
        {
          "id": "MPfarENJWVA",
          "title": "How India Spends: Consumer Habits and Trends | Breakdown",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report Link - How India Spends - https://marketing.perfios.com/how-india-spends-report/ What does the average Indian consumer spend their money on? How does income level influence choices in groceries, medical, entertainment, and even online gaming? This comprehensive report uncovers the latest trends in Indian consumer behaviour, providing invaluable insights for financial institutions, businesses, and policyma",
          "publishedAt": "2025-06-21T08:43:52+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/MPfarENJWVA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=MPfarENJWVA",
          "duration": "PT0S",
          "viewCount": "23171",
          "isLive": false,
          "searchableText": "how india spends: consumer habits and trends | breakdown breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report link - how india spends - https://marketing.perfios.com/how-india-spends-report/ what does the average indian consumer spend their money on? how does income level influence choices in groceries, medical, entertainment, and even online gaming? this comprehensive report uncovers the latest trends in indian consumer behaviour, providing invaluable insights for financial institutions, businesses, and policyma   breakdown",
          "keywords": "",
          "hash": "371f694b"
        },
        {
          "id": "bU42CJtqay8",
          "title": "How Coldplay changed INDIA FOREVER | Breakdown",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report URL: https://www.ey.com/en_in/insights/media-entertainment/india-s-rising-concert-economy-a-new-era-of-live-entertainment India’s concert economy just hit a massive turning point, and Coldplay’s historic Ahmedabad concert is at the heart of it. Drawing in over 222,000 attendees, generating an astonishing ₹641 crore in economic impact, and redefining Ahmedabad as India’s newest cultural hotspot—this was no",
          "publishedAt": "2025-06-14T07:58:55+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/bU42CJtqay8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=bU42CJtqay8",
          "duration": "PT0S",
          "viewCount": "22719",
          "isLive": false,
          "searchableText": "how coldplay changed india forever | breakdown breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report url: https://www.ey.com/en_in/insights/media-entertainment/india-s-rising-concert-economy-a-new-era-of-live-entertainment india’s concert economy just hit a massive turning point, and coldplay’s historic ahmedabad concert is at the heart of it. drawing in over 222,000 attendees, generating an astonishing ₹641 crore in economic impact, and redefining ahmedabad as india’s newest cultural hotspot—this was no   breakdown",
          "keywords": "",
          "hash": "dde289e3"
        },
        {
          "id": "u5-UMgNZs6k",
          "title": "How to Build Serious Wealth in India: The Untold Secrets to Success in 2025",
          "description": "https://docsend.com/view/5cacg5jgvd6cktz3 Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Want to make money in India? Discover the game-changing opportunities and strategies that successful entrepreneurs used to build empires. From India's digital revolution to the next big unlocks shaping the future, this video unveils the secrets to tapping into the fastest-growing economy in the world. Learn how to ride the wave of India's emerging tech, capital, and entr",
          "publishedAt": "2025-06-07T07:30:25+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/u5-UMgNZs6k/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=u5-UMgNZs6k",
          "duration": "PT0S",
          "viewCount": "91892",
          "isLive": false,
          "searchableText": "how to build serious wealth in india: the untold secrets to success in 2025 https://docsend.com/view/5cacg5jgvd6cktz3 breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network want to make money in india? discover the game-changing opportunities and strategies that successful entrepreneurs used to build empires. from india's digital revolution to the next big unlocks shaping the future, this video unveils the secrets to tapping into the fastest-growing economy in the world. learn how to ride the wave of india's emerging tech, capital, and entr   breakdown",
          "keywords": "",
          "hash": "00cb981a"
        },
        {
          "id": "dmn8XdxkPIE",
          "title": "10 Mind-Blowing Insights from Zerodha's 2024 Capital Markets Report",
          "description": "https://zerodha.com/z-connect/business-updates/introducing-the-2024-capital-markets-yearbook Explore the transformation of India's capital markets in this comprehensive 2024 report by Zerodha x IndianDataHub. From booming equity markets and record-breaking IPOs to regulatory shake-ups and the rise of finfluencers, discover what shaped investments in India this year—and what to expect next! Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network 0:00 Introduction - In",
          "publishedAt": "2025-05-30T15:48:51+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/dmn8XdxkPIE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=dmn8XdxkPIE",
          "duration": "PT0S",
          "viewCount": "39220",
          "isLive": false,
          "searchableText": "10 mind-blowing insights from zerodha's 2024 capital markets report https://zerodha.com/z-connect/business-updates/introducing-the-2024-capital-markets-yearbook explore the transformation of india's capital markets in this comprehensive 2024 report by zerodha x indiandatahub. from booming equity markets and record-breaking ipos to regulatory shake-ups and the rise of finfluencers, discover what shaped investments in india this year—and what to expect next! breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network 0:00 introduction - in   breakdown",
          "keywords": "",
          "hash": "08b23b9f"
        },
        {
          "id": "iraHLFVcTRc",
          "title": "Meesho Beats Flipkart : Breakdown of How India Shops | The Truth About India's Shopping Revolution",
          "description": "Use the URL: https://zoho.to/Z1RAHULBREAKDOWN Coupon Name : Z1RAHULBREAKDOWN Coupon Valid from : 23-Apr-2025 Coupon Valid to : 28-Sep-2025 Report Link - https://investor.meesho.com/financials https://www.bain.com/insights/how-india-shops-online-2025/ Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Did you know 1 in 10 Indians shopped on Meesho in 2024—beating Flipkart by over 15 lakh orders per day? India's shopping habits are shifting faster than you realize",
          "publishedAt": "2025-05-24T12:55:00+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/iraHLFVcTRc/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=iraHLFVcTRc",
          "duration": "PT0S",
          "viewCount": "19110",
          "isLive": false,
          "searchableText": "meesho beats flipkart : breakdown of how india shops | the truth about india's shopping revolution use the url: https://zoho.to/z1rahulbreakdown coupon name : z1rahulbreakdown coupon valid from : 23-apr-2025 coupon valid to : 28-sep-2025 report link - https://investor.meesho.com/financials https://www.bain.com/insights/how-india-shops-online-2025/ breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network did you know 1 in 10 indians shopped on meesho in 2024—beating flipkart by over 15 lakh orders per day? india's shopping habits are shifting faster than you realize   breakdown",
          "keywords": "",
          "hash": "352d5536"
        },
        {
          "id": "fTfO3sy_hYU",
          "title": "RCB vs CSK 2025: The Billion-Dollar Rivalry No One's Talking About! IPL final 2025",
          "description": "RCB vs CSK isn't just a cricket rivalry—it's a clash of billion-dollar empires. 🏆💰 In this IPL 2025 breakdown, we go beyond the stadium and deep into the boardroom. Who’s really winning the Indian Premier League? Is it Captain Cool's Chennai Super Kings or King Kohli's Royal Challengers Bangalore? Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network RESOURCES - https://www.diageoindia.com/en/investors/subsidiaries-financial https://x.com/Rahul_J_Mathur/status/19",
          "publishedAt": "2025-05-17T07:30:31+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/fTfO3sy_hYU/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=fTfO3sy_hYU",
          "duration": "PT0S",
          "viewCount": "5103",
          "isLive": false,
          "searchableText": "rcb vs csk 2025: the billion-dollar rivalry no one's talking about! ipl final 2025 rcb vs csk isn't just a cricket rivalry—it's a clash of billion-dollar empires. 🏆💰 in this ipl 2025 breakdown, we go beyond the stadium and deep into the boardroom. who’s really winning the indian premier league? is it captain cool's chennai super kings or king kohli's royal challengers bangalore? breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network resources - https://www.diageoindia.com/en/investors/subsidiaries-financial https://x.com/rahul_j_mathur/status/19   breakdown",
          "keywords": "",
          "hash": "63b049b4"
        }
      ]
    },
    "UCM7yoOhnMcfrEZ-5i9m-WFA": {
      "name": "Sonia Shenoy",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-08-17T09:41:06.288Z",
      "fetchStatus": "success",
      "fetchDuration": 169,
      "videos": [
        {
          "id": "fyyYKD7xnoY",
          "title": "7 Habits to Build Your Money Mindset | Money Mindset | Sonia Shenoy",
          "description": "In this episode of Money Mindset, Sonia Shenoy shares seven powerful habits she’s learned from interviewing India’s top wealth creators and business leaders over the last 17 years. These habits aren’t just about the money you make—they’re about the mindset shifts that truly help you grow, sustain, and manage wealth. Sonia breaks down simple yet impactful practices to improve your relationship with money, unlock opportunities, and align your actions with your financial goals. From learning to fai",
          "publishedAt": "2025-08-15T14:14:00+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/fyyYKD7xnoY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=fyyYKD7xnoY",
          "duration": "PT0S",
          "viewCount": "60726",
          "isLive": false,
          "searchableText": "7 habits to build your money mindset | money mindset | sonia shenoy in this episode of money mindset, sonia shenoy shares seven powerful habits she’s learned from interviewing india’s top wealth creators and business leaders over the last 17 years. these habits aren’t just about the money you make—they’re about the mindset shifts that truly help you grow, sustain, and manage wealth. sonia breaks down simple yet impactful practices to improve your relationship with money, unlock opportunities, and align your actions with your financial goals. from learning to fai   sonia shenoy",
          "keywords": "",
          "hash": "2ed55d22"
        },
        {
          "id": "_kN7DLrsXOM",
          "title": "From Loss to IPO: How Parth Jindal Transformed JSW Cement",
          "description": "In this episode of Money Mindset, we sit down with Parth Jindal, the MD of JSW Cement. Parth Jindal is the managing director of JSW cement and JSW Paints , he isn’t just the heir to one of India’s most powerful industrial empires he’s the architect of its next chapter and the young leader of the $20bn JSW group, a leader ins steel, energy and infrastructure. Parth took charge of JSW Cement—a struggling arm—and turned it into a growth engine. He launched JSW Paints, challenging industry giants wi",
          "publishedAt": "2025-08-07T07:55:11+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/_kN7DLrsXOM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=_kN7DLrsXOM",
          "duration": "PT0S",
          "viewCount": "76011",
          "isLive": false,
          "searchableText": "from loss to ipo: how parth jindal transformed jsw cement in this episode of money mindset, we sit down with parth jindal, the md of jsw cement. parth jindal is the managing director of jsw cement and jsw paints , he isn’t just the heir to one of india’s most powerful industrial empires he’s the architect of its next chapter and the young leader of the $20bn jsw group, a leader ins steel, energy and infrastructure. parth took charge of jsw cement—a struggling arm—and turned it into a growth engine. he launched jsw paints, challenging industry giants wi   sonia shenoy",
          "keywords": "",
          "hash": "6e8568d5"
        },
        {
          "id": "AbHUrmizPm8",
          "title": "Navigating the Changing Landscape of Tech and AI | Money Mindset",
          "description": "In this insightful episode of Money Mindset, we sit down with Sandip Agarwal, CEO at Sowilo Investments. Sandip, a chartered accountant with over 23 years of experience, shares his extensive journey in the tech and investment sectors. He offers valuable insights into the ongoing changes in the tech industry, the impact of AI, and how investors should adapt to the evolving landscape. 🔑 Key Topics Discussed: The Shift in the Tech Sector: Sandip shares his thoughts on TCS's decision to lay off 2% ",
          "publishedAt": "2025-08-05T12:52:13+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/AbHUrmizPm8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=AbHUrmizPm8",
          "duration": "PT0S",
          "viewCount": "33309",
          "isLive": false,
          "searchableText": "navigating the changing landscape of tech and ai | money mindset in this insightful episode of money mindset, we sit down with sandip agarwal, ceo at sowilo investments. sandip, a chartered accountant with over 23 years of experience, shares his extensive journey in the tech and investment sectors. he offers valuable insights into the ongoing changes in the tech industry, the impact of ai, and how investors should adapt to the evolving landscape. 🔑 key topics discussed: the shift in the tech sector: sandip shares his thoughts on tcs's decision to lay off 2%    sonia shenoy",
          "keywords": "",
          "hash": "d9580949"
        },
        {
          "id": "dVnDtO_YHi0",
          "title": "8 Habits of Wealthy People That Changed My Life | Money Mindset | Sonia Shenoy",
          "description": "In this episode of Money Mindset, host Sonia Shenoy distills her learnings from interviewing some of India’s most successful business leaders, stock market veterans, and wealth creators over the last 17 years. From mindset shifts to practical investing habits, Sonia shares 8 powerful habits that are common across the wealthy—and how anyone can adopt them on their journey to financial freedom. These are insights not found in textbooks, but learned from real conversations with those who’ve built, ",
          "publishedAt": "2025-08-02T12:45:55+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/dVnDtO_YHi0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=dVnDtO_YHi0",
          "duration": "PT0S",
          "viewCount": "341472",
          "isLive": false,
          "searchableText": "8 habits of wealthy people that changed my life | money mindset | sonia shenoy in this episode of money mindset, host sonia shenoy distills her learnings from interviewing some of india’s most successful business leaders, stock market veterans, and wealth creators over the last 17 years. from mindset shifts to practical investing habits, sonia shares 8 powerful habits that are common across the wealthy—and how anyone can adopt them on their journey to financial freedom. these are insights not found in textbooks, but learned from real conversations with those who’ve built,    sonia shenoy",
          "keywords": "",
          "hash": "e2298c65"
        },
        {
          "id": "al9Sa9bbpIE",
          "title": "The Jewelry Revolution No One’s Talking About | Angara’s $1B Vision | Money Mindset",
          "description": "In this insightful episode of Money Mindset, we sit down with Ankur Daga and Aditi Daga, the visionary founders of Angara, a leading global D2C jewelry brand. Together, they unravel the massive shifts reshaping the diamond and gemstone industries—from the rise of lab-grown diamonds to the resurgence of colored gemstones and how India is poised to lead this transformation. The conversation is a deep dive into the changing consumer psyche, the investment logic behind modern jewelry, and the future",
          "publishedAt": "2025-07-31T06:36:00+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/al9Sa9bbpIE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=al9Sa9bbpIE",
          "duration": "PT0S",
          "viewCount": "10771",
          "isLive": false,
          "searchableText": "the jewelry revolution no one’s talking about | angara’s $1b vision | money mindset in this insightful episode of money mindset, we sit down with ankur daga and aditi daga, the visionary founders of angara, a leading global d2c jewelry brand. together, they unravel the massive shifts reshaping the diamond and gemstone industries—from the rise of lab-grown diamonds to the resurgence of colored gemstones and how india is poised to lead this transformation. the conversation is a deep dive into the changing consumer psyche, the investment logic behind modern jewelry, and the future   sonia shenoy",
          "keywords": "",
          "hash": "5bbcd4cf"
        },
        {
          "id": "N3UXZri15Yg",
          "title": "Building Wealth with Saurabh Jain: Fixed income for dummies | Money Mindset",
          "description": "In this insightful episode of Money Mindset, we sit down with Saurabh Jain, the founder of Stable Money, a platform dedicated to fixed income investing. Saurabh shares his journey in the financial industry and his mission to bring more stability to wealth-building strategies through fixed income products. From fixed deposits to corporate bonds, learn how these traditional investments can play a key role in securing long-term wealth. 🔑 Key Topics Discussed: Why Fixed Income? Saurabh explains why",
          "publishedAt": "2025-07-18T14:59:23+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/N3UXZri15Yg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=N3UXZri15Yg",
          "duration": "PT0S",
          "viewCount": "86712",
          "isLive": false,
          "searchableText": "building wealth with saurabh jain: fixed income for dummies | money mindset in this insightful episode of money mindset, we sit down with saurabh jain, the founder of stable money, a platform dedicated to fixed income investing. saurabh shares his journey in the financial industry and his mission to bring more stability to wealth-building strategies through fixed income products. from fixed deposits to corporate bonds, learn how these traditional investments can play a key role in securing long-term wealth. 🔑 key topics discussed: why fixed income? saurabh explains why   sonia shenoy",
          "keywords": "",
          "hash": "5586825d"
        },
        {
          "id": "lsThZQ5ni0s",
          "title": "Market Caution & Long-Term Investing Strategies | Chirag Setalvad of HDFC | Money Mindset",
          "description": "In this insightful episode of Money Mindset, we sit down with Chirag Setalvad, a seasoned portfolio manager at HDFC Asset Management Company (AMC), with years of experience in navigating market volatility and guiding investors. Chirag shares his approach to cautious investing, portfolio management, and how a long-term perspective can help investors weather market corrections. 🔑 Key Topics Discussed: Current Market Outlook: Chirag discusses the market’s performance, rising concerns over inflated",
          "publishedAt": "2025-07-12T13:03:06+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/lsThZQ5ni0s/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=lsThZQ5ni0s",
          "duration": "PT0S",
          "viewCount": "89346",
          "isLive": false,
          "searchableText": "market caution & long-term investing strategies | chirag setalvad of hdfc | money mindset in this insightful episode of money mindset, we sit down with chirag setalvad, a seasoned portfolio manager at hdfc asset management company (amc), with years of experience in navigating market volatility and guiding investors. chirag shares his approach to cautious investing, portfolio management, and how a long-term perspective can help investors weather market corrections. 🔑 key topics discussed: current market outlook: chirag discusses the market’s performance, rising concerns over inflated   sonia shenoy",
          "keywords": "",
          "hash": "9f22386e"
        },
        {
          "id": "1Q1NKtdsYzg",
          "title": "Arun Jain on Building a $2B AI & FinTech Company, Intellect Design Arena | Money Mindset",
          "description": "In this thought-provoking episode of Money Mindset, we are joined by Arun Jain, the founder and CMD of Intellect Design Arena, a leading player in the enterprise AI and FinTech space. Arun discusses his journey from bootstrapping the company to reaching a market cap of nearly $2 billion, the evolution of AI in the business landscape, and the innovations he's driving to bridge the gap between foundational AI and business impact AI. 🔑 Key Topics Discussed: The Rise of Enterprise AI: Arun’s perspe",
          "publishedAt": "2025-07-04T08:24:15+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/1Q1NKtdsYzg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=1Q1NKtdsYzg",
          "duration": "PT0S",
          "viewCount": "28008",
          "isLive": false,
          "searchableText": "arun jain on building a $2b ai & fintech company, intellect design arena | money mindset in this thought-provoking episode of money mindset, we are joined by arun jain, the founder and cmd of intellect design arena, a leading player in the enterprise ai and fintech space. arun discusses his journey from bootstrapping the company to reaching a market cap of nearly $2 billion, the evolution of ai in the business landscape, and the innovations he's driving to bridge the gap between foundational ai and business impact ai. 🔑 key topics discussed: the rise of enterprise ai: arun’s perspe   sonia shenoy",
          "keywords": "",
          "hash": "072da6a3"
        },
        {
          "id": "9rTFDi7NjSg",
          "title": "Building Wealth with Anup Maheshwari: Understanding Stock Valuation & Market Trends | Money Mindset",
          "description": "In this insightful episode of Money Mindset, we sit down with Anup Maheshwari, the CIO of 360 One Asset Management, who brings over 30 years of experience in the equity markets. Anup shares his journey from his early days in the industry to managing large institutional and HNI investments. He also dives deep into his investment strategies, offering practical insights into valuation, stock picking, and navigating market volatility. 🔑 Key Topics Discussed: Understanding Stock Valuation: Anup expl",
          "publishedAt": "2025-06-23T14:36:15+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/9rTFDi7NjSg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=9rTFDi7NjSg",
          "duration": "PT0S",
          "viewCount": "159423",
          "isLive": false,
          "searchableText": "building wealth with anup maheshwari: understanding stock valuation & market trends | money mindset in this insightful episode of money mindset, we sit down with anup maheshwari, the cio of 360 one asset management, who brings over 30 years of experience in the equity markets. anup shares his journey from his early days in the industry to managing large institutional and hni investments. he also dives deep into his investment strategies, offering practical insights into valuation, stock picking, and navigating market volatility. 🔑 key topics discussed: understanding stock valuation: anup expl   sonia shenoy",
          "keywords": "",
          "hash": "dff14ee9"
        },
        {
          "id": "Uk2c3-w8PL0",
          "title": "Building Wealth with Madhu Kela: Value Investing, Stock Picking, and Future Markets | Money Mindset",
          "description": "In this insightful episode of Money Mindset, we sit down with Madhu Kela, a renowned investor and financial strategist with decades of experience in the Indian markets. Madhu shares his journey from a humble background to becoming one of India’s most respected figures in wealth management, offering valuable insights into his investment philosophy, stock-picking strategies, and the future of financial markets. 🔑 Key Topics Discussed: The Evolution of Stock Market Investing: Madhu discusses his p",
          "publishedAt": "2025-06-14T04:10:11+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/Uk2c3-w8PL0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Uk2c3-w8PL0",
          "duration": "PT0S",
          "viewCount": "221425",
          "isLive": false,
          "searchableText": "building wealth with madhu kela: value investing, stock picking, and future markets | money mindset in this insightful episode of money mindset, we sit down with madhu kela, a renowned investor and financial strategist with decades of experience in the indian markets. madhu shares his journey from a humble background to becoming one of india’s most respected figures in wealth management, offering valuable insights into his investment philosophy, stock-picking strategies, and the future of financial markets. 🔑 key topics discussed: the evolution of stock market investing: madhu discusses his p   sonia shenoy",
          "keywords": "",
          "hash": "dffabb0d"
        }
      ]
    },
    "UCxX-O7rPl35IajrJnAdzIyw": {
      "name": "The Other Side with Dilip",
      "category": "health",
      "color": "green",
      "lastFetched": "2025-08-17T09:41:06.645Z",
      "fetchStatus": "success",
      "fetchDuration": 161,
      "videos": [
        {
          "id": "pMW-oESODAs",
          "title": "How can fitness trackers save your life?  Know this before you buy one.",
          "description": "From detecting life-threatening heart conditions to helping you sleep better and manage stress, wearables are quietly becoming one of the most powerful tools in personal healthcare. In this episode, I'll take you into the rapidly growing world of health wearables in India, exploring why more Indians are turning to smartwatches, fitness bands, and rings to take control of their well-being. Learn how these compact devices use advanced sensors and smart software to track your movement, sleep, heart",
          "publishedAt": "2025-07-11T12:42:56+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/pMW-oESODAs/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=pMW-oESODAs",
          "duration": "PT0S",
          "viewCount": "950",
          "isLive": false,
          "searchableText": "how can fitness trackers save your life?  know this before you buy one. from detecting life-threatening heart conditions to helping you sleep better and manage stress, wearables are quietly becoming one of the most powerful tools in personal healthcare. in this episode, i'll take you into the rapidly growing world of health wearables in india, exploring why more indians are turning to smartwatches, fitness bands, and rings to take control of their well-being. learn how these compact devices use advanced sensors and smart software to track your movement, sleep, heart   the other side with dilip",
          "keywords": "",
          "hash": "a644601c"
        },
        {
          "id": "nrojtfmfIg0",
          "title": "Rainmatter (Zerodha) investor explains- How to build a large protein company for India.",
          "description": "India's protein market is EXPLODING - from $1.5B today to $2B by 2030, yet 75% of Indians are still protein-deficient. This creates a massive opportunity for entrepreneurs and investors. In this deep-dive, we break down India's $1.5 billion protein market and explore why over 100 startups have launched since 2020, with 90% of investment happening in just the last 2 years. We dive deep into winning strategies like \"snackification\" and why protein chocolates, wafers, and ready-to-drink beverages a",
          "publishedAt": "2025-07-01T12:31:09+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/nrojtfmfIg0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=nrojtfmfIg0",
          "duration": "PT0S",
          "viewCount": "4197",
          "isLive": false,
          "searchableText": "rainmatter (zerodha) investor explains- how to build a large protein company for india. india's protein market is exploding - from $1.5b today to $2b by 2030, yet 75% of indians are still protein-deficient. this creates a massive opportunity for entrepreneurs and investors. in this deep-dive, we break down india's $1.5 billion protein market and explore why over 100 startups have launched since 2020, with 90% of investment happening in just the last 2 years. we dive deep into winning strategies like \"snackification\" and why protein chocolates, wafers, and ready-to-drink beverages a   the other side with dilip",
          "keywords": "",
          "hash": "d73ba0a4"
        }
      ]
    },
    "UCMfazW6hC3eaWTW2q0ibhyQ": {
      "name": "Pranay Kapoor",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-08-17T09:41:06.643Z",
      "fetchStatus": "success",
      "fetchDuration": 157,
      "videos": [
        {
          "id": "_JPPSD_5ncU",
          "title": "E20 Petrol | Risks & How To Protect Your Car ft. @SunderdeepSingh ",
          "description": "E-20 is here, and it's in your petrol. But what does that really mean for your Petrol car? In this video, we're joined by Sunderdeep Singh from Volklub who cuts through the confusion to give you the honest truth. We'll discuss - - What is E20? - Why is it harmful and why should you care? - How can you safeguard against it? - If you're buying a new car, how should you think about it? - Diesel Cars vs EVs?",
          "publishedAt": "2025-08-13T13:31:11+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/_JPPSD_5ncU/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=_JPPSD_5ncU",
          "duration": "PT0S",
          "viewCount": "46668",
          "isLive": false,
          "searchableText": "e20 petrol | risks & how to protect your car ft. @sunderdeepsingh  e-20 is here, and it's in your petrol. but what does that really mean for your petrol car? in this video, we're joined by sunderdeep singh from volklub who cuts through the confusion to give you the honest truth. we'll discuss - - what is e20? - why is it harmful and why should you care? - how can you safeguard against it? - if you're buying a new car, how should you think about it? - diesel cars vs evs?   pranay kapoor",
          "keywords": "",
          "hash": "142f6505"
        },
        {
          "id": "1fuSSRin0a0",
          "title": "How to buy a used EV in 2025 | MG ZS EV ",
          "description": "Today we have Kaifi who recently purchased a pre-owned MG ZS EV at a great price. He shares his learnings on how he went about buying it, getting the battery tested and checked, how much did he get it for and how has his experience been. He also compares the ZS EV to his other car - Mahindra XUV400. If you're looking to buy a used EV in India, this video will help you.",
          "publishedAt": "2025-08-07T13:22:03+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/1fuSSRin0a0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=1fuSSRin0a0",
          "duration": "PT0S",
          "viewCount": "22767",
          "isLive": false,
          "searchableText": "how to buy a used ev in 2025 | mg zs ev  today we have kaifi who recently purchased a pre-owned mg zs ev at a great price. he shares his learnings on how he went about buying it, getting the battery tested and checked, how much did he get it for and how has his experience been. he also compares the zs ev to his other car - mahindra xuv400. if you're looking to buy a used ev in india, this video will help you.   pranay kapoor",
          "keywords": "",
          "hash": "39eecc7a"
        },
        {
          "id": "KoFnFuWdjeE",
          "title": "Axis Atlas | Why Is This The Best Card of 2025",
          "description": "We've spoken about the Axis Atlas credit in bits and pieces across different videos. But today we are going deeper into this card that both Anmol and I have started loving for our respective reasons. It's the card we recommend our friends and family and if you are looking for what card to get for 2025 - our pick is going to be Axis Atlas. Apply using the link below here: https://tinyurl.com/23y65ymp 0:00 Highlights 1:01 Intro 3:21 Accelerated Rewards 9:07 Milestone Rewards 14:41 Extensive Partne",
          "publishedAt": "2025-07-31T14:10:57+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/KoFnFuWdjeE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=KoFnFuWdjeE",
          "duration": "PT0S",
          "viewCount": "43467",
          "isLive": false,
          "searchableText": "axis atlas | why is this the best card of 2025 we've spoken about the axis atlas credit in bits and pieces across different videos. but today we are going deeper into this card that both anmol and i have started loving for our respective reasons. it's the card we recommend our friends and family and if you are looking for what card to get for 2025 - our pick is going to be axis atlas. apply using the link below here: https://tinyurl.com/23y65ymp 0:00 highlights 1:01 intro 3:21 accelerated rewards 9:07 milestone rewards 14:41 extensive partne   pranay kapoor",
          "keywords": "",
          "hash": "ae68411a"
        },
        {
          "id": "pB1Ktb4C3So",
          "title": "Best Life Insurance Calculator 2025 | How much term insurance should you get?",
          "description": "To get the calculator for free, go subscribe to my Substack here: https://tinyurl.com/3hdyzjfk Book a free call with Ditto's Senior Insurance Advisors: https://ditto.sh/rntlxh Ever since my little one came along, I've been obsessing about one thing: life insurance. Specifically, how much cover do we actually need? And for how long? And man, every time I started looking for answers, it was the same old thumb rule: 'just get 10x your income!' or 'make it 20x!' These 'thumb rules' drive me crazy. T",
          "publishedAt": "2025-07-24T13:01:26+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/pB1Ktb4C3So/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=pB1Ktb4C3So",
          "duration": "PT0S",
          "viewCount": "3352",
          "isLive": false,
          "searchableText": "best life insurance calculator 2025 | how much term insurance should you get? to get the calculator for free, go subscribe to my substack here: https://tinyurl.com/3hdyzjfk book a free call with ditto's senior insurance advisors: https://ditto.sh/rntlxh ever since my little one came along, i've been obsessing about one thing: life insurance. specifically, how much cover do we actually need? and for how long? and man, every time i started looking for answers, it was the same old thumb rule: 'just get 10x your income!' or 'make it 20x!' these 'thumb rules' drive me crazy. t   pranay kapoor",
          "keywords": "",
          "hash": "f69571ba"
        }
      ]
    },
    "UCs0Awb1WCz0dNsq8zhfYl1A": {
      "name": "Vishal Bhargava",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-08-17T09:41:06.629Z",
      "fetchStatus": "success",
      "fetchDuration": 144,
      "videos": [
        {
          "id": "FbXCH4BfwQs",
          "title": "Will Builders Change Mumbai Slums? | With Rajiv Dube | Unravel",
          "description": "In this interview, Mr. Rajiv Dube, the founder of Starwing Group, takes us behind the scenes of what it takes to make Mumbai slum-free. With over 30 years of experience in the real estate sector, Dube has been executing complex slum redevelopment projects in Andheri East. Dube dives deep into the challenges of this massive undertaking, from earning the trust of slum residents to overcoming financial hurdles and managing complex execution timelines. He reveals how slum dwellers are benefiting fro",
          "publishedAt": "2025-08-09T12:01:30+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/FbXCH4BfwQs/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=FbXCH4BfwQs",
          "duration": "PT0S",
          "viewCount": "11829",
          "isLive": false,
          "searchableText": "will builders change mumbai slums? | with rajiv dube | unravel in this interview, mr. rajiv dube, the founder of starwing group, takes us behind the scenes of what it takes to make mumbai slum-free. with over 30 years of experience in the real estate sector, dube has been executing complex slum redevelopment projects in andheri east. dube dives deep into the challenges of this massive undertaking, from earning the trust of slum residents to overcoming financial hurdles and managing complex execution timelines. he reveals how slum dwellers are benefiting fro   vishal bhargava",
          "keywords": "",
          "hash": "13cc092b"
        },
        {
          "id": "RJnOILNlV2A",
          "title": "How Naman Xana became India’s most expensive building?",
          "description": "In this video, we dive into how Naman Xana, a builder with little brand recognition, achieved India’s most expensive home purchase at ₹2.8 lakh per square foot in Mumbai. Despite not having top-of-mind recall, Xana managed to pull off this luxury sale by capitalizing on Mumbai’s coveted seafront properties, a market that exploded after new coastal regulations were introduced post-COVID. While areas like Marine Drive and Bandra have their limitations, Worli Sea Face emerged as a prime location du",
          "publishedAt": "2025-07-26T14:49:52+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/RJnOILNlV2A/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=RJnOILNlV2A",
          "duration": "PT0S",
          "viewCount": "67707",
          "isLive": false,
          "searchableText": "how naman xana became india’s most expensive building? in this video, we dive into how naman xana, a builder with little brand recognition, achieved india’s most expensive home purchase at ₹2.8 lakh per square foot in mumbai. despite not having top-of-mind recall, xana managed to pull off this luxury sale by capitalizing on mumbai’s coveted seafront properties, a market that exploded after new coastal regulations were introduced post-covid. while areas like marine drive and bandra have their limitations, worli sea face emerged as a prime location du   vishal bhargava",
          "keywords": "",
          "hash": "e61ceeb5"
        },
        {
          "id": "0E4dTypw5NE",
          "title": "Why Mumbai Never Gets Fixed | Ex BMC Chief Subodh Kumar | Real Deal",
          "description": "In this powerful episode, former BMC Commissioner Subodh Kumar shares how he transformed Mumbai's real estate landscape with bold reforms, challenged corruption, and redefined urban planning. From exposing FSI loopholes to driving policy changes that generated ₹20,000+ crores in civic revenue, Kumar opens up on the political resistance, the builder nexus, and why good governance is more about intent than popularity. We also discuss Mumbai’s infamous flooding, poor roads, and the future of infras",
          "publishedAt": "2025-07-20T06:33:11+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/0E4dTypw5NE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=0E4dTypw5NE",
          "duration": "PT0S",
          "viewCount": "50629",
          "isLive": false,
          "searchableText": "why mumbai never gets fixed | ex bmc chief subodh kumar | real deal in this powerful episode, former bmc commissioner subodh kumar shares how he transformed mumbai's real estate landscape with bold reforms, challenged corruption, and redefined urban planning. from exposing fsi loopholes to driving policy changes that generated ₹20,000+ crores in civic revenue, kumar opens up on the political resistance, the builder nexus, and why good governance is more about intent than popularity. we also discuss mumbai’s infamous flooding, poor roads, and the future of infras   vishal bhargava",
          "keywords": "",
          "hash": "bac2cf3d"
        }
      ]
    },
    "UC1MHVwwWd9l46ZeRM7qm_AA": {
      "name": "Tirthak Saha",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-08-17T09:41:06.617Z",
      "fetchStatus": "success",
      "fetchDuration": 130,
      "videos": [
        {
          "id": "7rtzUgmk_PM",
          "title": "The world’s FIRST celebrity chef",
          "description": "The insane but true story of how a talented cook from pre-partition India went to America in the late 1800s, made them fall in love with the flavours of the subcontinent, married a string of American models and actresses, conned a bunch of people, and became the world's first TRUE Celebrity Chef. This is Episode 2 of \"Under The Radar\" - a series that aims to uncover little-known stories from India that reveal unexpected global connections, showcasing how Indian and South Asian history, culture, ",
          "publishedAt": "2025-08-03T10:16:15+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/7rtzUgmk_PM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=7rtzUgmk_PM",
          "duration": "PT0S",
          "viewCount": "14378",
          "isLive": false,
          "searchableText": "the world’s first celebrity chef the insane but true story of how a talented cook from pre-partition india went to america in the late 1800s, made them fall in love with the flavours of the subcontinent, married a string of american models and actresses, conned a bunch of people, and became the world's first true celebrity chef. this is episode 2 of \"under the radar\" - a series that aims to uncover little-known stories from india that reveal unexpected global connections, showcasing how indian and south asian history, culture,    tirthak saha",
          "keywords": "",
          "hash": "9ed62d2a"
        },
        {
          "id": "D9n_299dd14",
          "title": "How an American Cult gave birth to an Indian Company",
          "description": "The story of a mysterious hidden connection between two companies that, on the surface, have nothing to do with each other. One was born in the 1800s as an American Cult and the other as an iconic Indian Electronics company born in the late 1900s. This is Episode 1 of \"Under The Radar\" - a series that aims to uncover little-known stories from India that reveal unexpected global connections, showcasing how Indian and South Asian history, culture, and innovation have shaped our world in ways most ",
          "publishedAt": "2025-07-20T12:54:09+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/D9n_299dd14/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=D9n_299dd14",
          "duration": "PT0S",
          "viewCount": "62067",
          "isLive": false,
          "searchableText": "how an american cult gave birth to an indian company the story of a mysterious hidden connection between two companies that, on the surface, have nothing to do with each other. one was born in the 1800s as an american cult and the other as an iconic indian electronics company born in the late 1900s. this is episode 1 of \"under the radar\" - a series that aims to uncover little-known stories from india that reveal unexpected global connections, showcasing how indian and south asian history, culture, and innovation have shaped our world in ways most    tirthak saha",
          "keywords": "",
          "hash": "99da86a6"
        },
        {
          "id": "CkwBpVH3bXQ",
          "title": "Under The Radar",
          "description": "This is a trailer for \"Under The Radar\" - a series that aims to uncover little-known stories from India that reveal unexpected global connections, showcasing how South Asian history, culture, and innovation have shaped our world in ways most people never realized. A huge shoutout to the Zero1 Network by Zerodha for supporting us with the resources that it takes to make these deep-dive content pieces possible!",
          "publishedAt": "2025-07-16T12:50:13+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/CkwBpVH3bXQ/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=CkwBpVH3bXQ",
          "duration": "PT0S",
          "viewCount": "21074",
          "isLive": false,
          "searchableText": "under the radar this is a trailer for \"under the radar\" - a series that aims to uncover little-known stories from india that reveal unexpected global connections, showcasing how south asian history, culture, and innovation have shaped our world in ways most people never realized. a huge shoutout to the zero1 network by zerodha for supporting us with the resources that it takes to make these deep-dive content pieces possible!   tirthak saha",
          "keywords": "",
          "hash": "4bd5cde6"
        },
        {
          "id": "EHQGNjO3tvg",
          "title": "How Sherlock Holmes Saved an Indian Man",
          "description": "In 1903, a quaint village in England named Great Wyrley became the epicenter of an International thriller. When a series of shocking animal killings rocked the community, George Edalji - the son of an Indian immigrant - found himself wrongfully accused with little evidence. Determined to clear his name, George turned to the mastermind behind the \"world's best detective\" - Sir Arthur Conan Doyle. What unfolded next is a gripping true crime saga, bursting with the intrigue and suspense that would ",
          "publishedAt": "2023-05-27T11:04:25+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/EHQGNjO3tvg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=EHQGNjO3tvg",
          "duration": "PT0S",
          "viewCount": "13604",
          "isLive": false,
          "searchableText": "how sherlock holmes saved an indian man in 1903, a quaint village in england named great wyrley became the epicenter of an international thriller. when a series of shocking animal killings rocked the community, george edalji - the son of an indian immigrant - found himself wrongfully accused with little evidence. determined to clear his name, george turned to the mastermind behind the \"world's best detective\" - sir arthur conan doyle. what unfolded next is a gripping true crime saga, bursting with the intrigue and suspense that would    tirthak saha",
          "keywords": "",
          "hash": "8664f468"
        }
      ]
    },
    "UCFdZETZpeX3G7Pe3zan2fHA": {
      "name": "Vyre",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-08-17T09:41:06.580Z",
      "fetchStatus": "success",
      "fetchDuration": 94,
      "videos": [
        {
          "id": "Tv0hwLSMry0",
          "title": "Why Are Indian Theatres Suddenly Empty? (Bollywood’s Big Problem)",
          "description": "Bollywood’s magic on the big screen is fading — but why? From overpriced tickets and poor content quality to the rise of OTT platforms, here’s what’s killing your love for movie theatres. We dive deep into why Indian audiences are skipping cinema halls and what it means for the future of Bollywood. 00:00 - Intro 3:47 - Chapter 1 8:28 - Chapter 2 12:59 - Chapter 3 Follow us on Instagram: Vyre: https://www.instagram.com/vyre.media Angad Kahai Singh: https://www.instagram.com/vyre.media Discord - h",
          "publishedAt": "2025-08-15T16:14:53+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/Tv0hwLSMry0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Tv0hwLSMry0",
          "duration": "PT0S",
          "viewCount": "1316",
          "isLive": false,
          "searchableText": "why are indian theatres suddenly empty? (bollywood’s big problem) bollywood’s magic on the big screen is fading — but why? from overpriced tickets and poor content quality to the rise of ott platforms, here’s what’s killing your love for movie theatres. we dive deep into why indian audiences are skipping cinema halls and what it means for the future of bollywood. 00:00 - intro 3:47 - chapter 1 8:28 - chapter 2 12:59 - chapter 3 follow us on instagram: vyre: https://www.instagram.com/vyre.media angad kahai singh: https://www.instagram.com/vyre.media discord - h   vyre",
          "keywords": "",
          "hash": "91f3baa7"
        },
        {
          "id": "6qDcTfCF-GI",
          "title": "Why GEN Z is BROKE! (simple fix)",
          "description": "These Apps Keep You POOR! (And You Don’t Even Realise It) We all use them. Zomato, Blinkit, Amazon, Swiggy, Myntra… But what if the apps designed to make life easier are actually making us broke? In this video, we break down the sneaky ways your favorite apps are draining your wallet — from impulse triggers to invisible fees, from dopamine-driven designs to subscription traps. You’ll finally understand why your salary disappears by the 20th of every month. Follow us on Instagram: Vyre: https://w",
          "publishedAt": "2025-08-05T14:34:06+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/6qDcTfCF-GI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=6qDcTfCF-GI",
          "duration": "PT0S",
          "viewCount": "1230",
          "isLive": false,
          "searchableText": "why gen z is broke! (simple fix) these apps keep you poor! (and you don’t even realise it) we all use them. zomato, blinkit, amazon, swiggy, myntra… but what if the apps designed to make life easier are actually making us broke? in this video, we break down the sneaky ways your favorite apps are draining your wallet — from impulse triggers to invisible fees, from dopamine-driven designs to subscription traps. you’ll finally understand why your salary disappears by the 20th of every month. follow us on instagram: vyre: https://w   vyre",
          "keywords": "",
          "hash": "d70ef42d"
        },
        {
          "id": "k31hNwsmvyk",
          "title": "This Ugly Doll Has People Addicted",
          "description": "From cute collectibles to a cultural craze, Labubu has taken over. But why are people spending thousands on these POP MART art toys? We dive into the hype, the blind box addiction, and the high-stakes resale market to uncover how these little monsters became so famous and controversial. Follow us on Instagram: Vyre: https://www.instagram.com/vyre.media Angad Kahai Singh: https://www.instagram.com/vyre.media Discord - https://discord.gg/aUBdyFhKbD 🌐 Learn more about Zero1 Network: https://zero1b",
          "publishedAt": "2025-07-19T14:43:18+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/k31hNwsmvyk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=k31hNwsmvyk",
          "duration": "PT0S",
          "viewCount": "704",
          "isLive": false,
          "searchableText": "this ugly doll has people addicted from cute collectibles to a cultural craze, labubu has taken over. but why are people spending thousands on these pop mart art toys? we dive into the hype, the blind box addiction, and the high-stakes resale market to uncover how these little monsters became so famous and controversial. follow us on instagram: vyre: https://www.instagram.com/vyre.media angad kahai singh: https://www.instagram.com/vyre.media discord - https://discord.gg/aubdyfhkbd 🌐 learn more about zero1 network: https://zero1b   vyre",
          "keywords": "",
          "hash": "7705d77b"
        },
        {
          "id": "zIdKGB9lwCE",
          "title": "The Zepto Situation is Getting WORSE!",
          "description": "Zepto’s 10-minute delivery might look magical on the outside, but behind the speed is a system that's starting to crack. From rotten groceries to dedicated subreddits — we dive into the dark side of India’s fastest unicorn. Follow us on Instagram: Vyre: https://www.instagram.com/vyre.media Angad Kahai Singh: https://www.instagram.com/vyre.media Discord - https://discord.gg/aUBdyFhKbD 🌐 Learn more about Zero1 Network: https://zero1byzerodha.com/network",
          "publishedAt": "2025-07-03T08:58:15+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/zIdKGB9lwCE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=zIdKGB9lwCE",
          "duration": "PT0S",
          "viewCount": "2715",
          "isLive": false,
          "searchableText": "the zepto situation is getting worse! zepto’s 10-minute delivery might look magical on the outside, but behind the speed is a system that's starting to crack. from rotten groceries to dedicated subreddits — we dive into the dark side of india’s fastest unicorn. follow us on instagram: vyre: https://www.instagram.com/vyre.media angad kahai singh: https://www.instagram.com/vyre.media discord - https://discord.gg/aubdyfhkbd 🌐 learn more about zero1 network: https://zero1byzerodha.com/network   vyre",
          "keywords": "",
          "hash": "97a2b9ab"
        },
        {
          "id": "SWc8QYqg2xE",
          "title": "Indian Airlines ARE NOT SAFE!",
          "description": "India’s airline industry is booming—but behind the scenes, there are growing concerns about aviation safety, overworked pilots, poor aircraft maintenance, and regulatory failure. This video explores the deeper problems hidden beneath our air travel system—especially in the aftermath of the Air India Boeing 787 Flight AI171 crash. Wyngx - ​⁠ @_WyngX Follow us on Instagram: Vyre: https://www.instagram.com/vyre.media Angad Kahai Singh: https://www.instagram.com/vyre.media 🌐 Learn more about Zero1 ",
          "publishedAt": "2025-06-21T06:32:34+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/SWc8QYqg2xE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=SWc8QYqg2xE",
          "duration": "PT0S",
          "viewCount": "7461",
          "isLive": false,
          "searchableText": "indian airlines are not safe! india’s airline industry is booming—but behind the scenes, there are growing concerns about aviation safety, overworked pilots, poor aircraft maintenance, and regulatory failure. this video explores the deeper problems hidden beneath our air travel system—especially in the aftermath of the air india boeing 787 flight ai171 crash. wyngx - ​⁠ @_wyngx follow us on instagram: vyre: https://www.instagram.com/vyre.media angad kahai singh: https://www.instagram.com/vyre.media 🌐 learn more about zero1    vyre",
          "keywords": "",
          "hash": "87b2918f"
        }
      ]
    },
    "UCtFCIACJgZK5cGVqWYWhGgg": {
      "name": "Americonomics by Akash Bhat",
      "category": "upskilling",
      "color": "orange",
      "lastFetched": "2025-08-17T09:41:06.780Z",
      "fetchStatus": "success",
      "fetchDuration": 135,
      "videos": [
        {
          "id": "zHr1tgoclHk",
          "title": "Indian Engineers in America Are Doing THIS With Their Money",
          "description": "What exactly is a trust fund — and why are so many tech employees, startup founders, and immigrants on visas setting them up? In this episode of Americonomics, we demystify trust funds and show how you can use them to protect your startup equity, minimize taxes, and plan generational wealth — even if you're not a billionaire. Whether you're on an H-1B visa or just closed your Series A, this guide explains how to legally move assets like RSUs and private shares into trusts, avoid estate taxes, an",
          "publishedAt": "2025-07-31T15:49:51+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/zHr1tgoclHk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=zHr1tgoclHk",
          "duration": "PT0S",
          "viewCount": "336",
          "isLive": false,
          "searchableText": "indian engineers in america are doing this with their money what exactly is a trust fund — and why are so many tech employees, startup founders, and immigrants on visas setting them up? in this episode of americonomics, we demystify trust funds and show how you can use them to protect your startup equity, minimize taxes, and plan generational wealth — even if you're not a billionaire. whether you're on an h-1b visa or just closed your series a, this guide explains how to legally move assets like rsus and private shares into trusts, avoid estate taxes, an   americonomics by akash bhat",
          "keywords": "",
          "hash": "342835b7"
        },
        {
          "id": "fNVQnl08_EM",
          "title": "Why Startup Founders Don’t Get Rich (Even at $100M)",
          "description": "Even founders of ₹800 crore ($100M) startups can struggle with basic needs – like paying rent or buying a home. Surprising? It’s the harsh reality of what’s known as the “secondary trap.” This trap kicks in when founders try to sell a small portion of their shares for personal cash – but find themselves blocked by investor-imposed restrictions: board approvals, transfer limitations, and ROFR (Right of First Refusal). Their equity may look impressive on paper, but in reality, it's often just lock",
          "publishedAt": "2025-07-19T15:27:08+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/fNVQnl08_EM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=fNVQnl08_EM",
          "duration": "PT0S",
          "viewCount": "915",
          "isLive": false,
          "searchableText": "why startup founders don’t get rich (even at $100m) even founders of ₹800 crore ($100m) startups can struggle with basic needs – like paying rent or buying a home. surprising? it’s the harsh reality of what’s known as the “secondary trap.” this trap kicks in when founders try to sell a small portion of their shares for personal cash – but find themselves blocked by investor-imposed restrictions: board approvals, transfer limitations, and rofr (right of first refusal). their equity may look impressive on paper, but in reality, it's often just lock   americonomics by akash bhat",
          "keywords": "",
          "hash": "aaea510d"
        },
        {
          "id": "EBqMzBLGWdY",
          "title": "The REAL Truth About Startup Equity for NRIs",
          "description": "Startup equity can be tempting, but before you get too excited, it's important to understand the harsh realities that come with it. In this video, we dive deep into the complexities of startup equity, showing you how things like liquidation preferences, multiple funding rounds, and dilution can drastically change your payout. From the promise of a life-changing payout to the disappointing reality of walking away with little to nothing, we break down real-world scenarios that could happen to you.",
          "publishedAt": "2025-07-10T15:49:59+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/EBqMzBLGWdY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=EBqMzBLGWdY",
          "duration": "PT0S",
          "viewCount": "333",
          "isLive": false,
          "searchableText": "the real truth about startup equity for nris startup equity can be tempting, but before you get too excited, it's important to understand the harsh realities that come with it. in this video, we dive deep into the complexities of startup equity, showing you how things like liquidation preferences, multiple funding rounds, and dilution can drastically change your payout. from the promise of a life-changing payout to the disappointing reality of walking away with little to nothing, we break down real-world scenarios that could happen to you.   americonomics by akash bhat",
          "keywords": "",
          "hash": "3f5d3cb7"
        },
        {
          "id": "ZRESj9A2wN0",
          "title": "How To Get A Job In Venture Capital (From a Former VC!)",
          "description": "I sent 137 cold emails to VCs and got zero responses. Most people will never get a job in venture capital. Not because they’re not smart enough. But because they’re following advice from people who were born inside the \"system\". I wasn’t. I went from being an outsider to writing checks to founders now building billion-dollar startups – and broke into one of the most exclusive clubs in the world. You can too. In this video, I’ll break down the real ways people get into VC today – and why the trad",
          "publishedAt": "2025-07-03T15:31:07+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/ZRESj9A2wN0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=ZRESj9A2wN0",
          "duration": "PT0S",
          "viewCount": "534",
          "isLive": false,
          "searchableText": "how to get a job in venture capital (from a former vc!) i sent 137 cold emails to vcs and got zero responses. most people will never get a job in venture capital. not because they’re not smart enough. but because they’re following advice from people who were born inside the \"system\". i wasn’t. i went from being an outsider to writing checks to founders now building billion-dollar startups – and broke into one of the most exclusive clubs in the world. you can too. in this video, i’ll break down the real ways people get into vc today – and why the trad   americonomics by akash bhat",
          "keywords": "",
          "hash": "58addd6f"
        },
        {
          "id": "wuNIk9Xr7sI",
          "title": "How NRIs Can Start A Business on F1/H1B Visa",
          "description": "Can you start a business on an F1 student visa or H1B visa in the US? The short answer is yes, but it comes with challenges. In this video, I share my journey of building a successful startup while navigating the H1B visa restrictions. I’ll walk you through the exact process to start your own company on an F1 or H1B visa, including the legal frameworks and work restrictions. Whether you’re an NRI, Indian entrepreneur, or someone considering NRI investments, this guide provides strategies to help",
          "publishedAt": "2025-06-26T15:28:43+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/wuNIk9Xr7sI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=wuNIk9Xr7sI",
          "duration": "PT0S",
          "viewCount": "942",
          "isLive": false,
          "searchableText": "how nris can start a business on f1/h1b visa can you start a business on an f1 student visa or h1b visa in the us? the short answer is yes, but it comes with challenges. in this video, i share my journey of building a successful startup while navigating the h1b visa restrictions. i’ll walk you through the exact process to start your own company on an f1 or h1b visa, including the legal frameworks and work restrictions. whether you’re an nri, indian entrepreneur, or someone considering nri investments, this guide provides strategies to help   americonomics by akash bhat",
          "keywords": "",
          "hash": "1d73609e"
        }
      ]
    },
    "UCM1vynzlNMa4r5MxwiEO6ag": {
      "name": "NRI Diaries by Nupur Dave",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-08-17T09:41:06.818Z",
      "fetchStatus": "success",
      "fetchDuration": 172,
      "videos": [
        {
          "id": "RPxNu7yUkzU",
          "title": "FAANG Interview Secrets for 2025",
          "description": "This isn't another video. It's THE video for NRIs and Indians that gives advice over and above what you hear in other videos. Learn about interview and resume tips from me, and what it takes to get into FAANG jobs. Strap up and enjoy the ride! CHAPTERS 00:00 Introduction to FAANG Companies 00:23 The Importance of Strategy 01:05 Key Traits for Success 02:31 Crafting the Perfect Resume 03:49 Interview Preparation Tips 04:42 Articulation for Desis 07:38 Understanding FAANG Hiring 07:58 Application ",
          "publishedAt": "2025-08-06T16:03:03+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/RPxNu7yUkzU/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=RPxNu7yUkzU",
          "duration": "PT0S",
          "viewCount": "1189",
          "isLive": false,
          "searchableText": "faang interview secrets for 2025 this isn't another video. it's the video for nris and indians that gives advice over and above what you hear in other videos. learn about interview and resume tips from me, and what it takes to get into faang jobs. strap up and enjoy the ride! chapters 00:00 introduction to faang companies 00:23 the importance of strategy 01:05 key traits for success 02:31 crafting the perfect resume 03:49 interview preparation tips 04:42 articulation for desis 07:38 understanding faang hiring 07:58 application    nri diaries by nupur dave",
          "keywords": "",
          "hash": "dbd554af"
        },
        {
          "id": "6u5c7MTR158",
          "title": "Dark Truth About Racism Abroad",
          "description": "Indians face a lot of racism abroad, and this video breaks down the types of racism, how it feels and actual stories from YOU! Keep in touch for events via https://forms.gle/RtKeTuavgnrehjL5A CHAPTERS 00:00 Introduction: The Reality of Racism for Indians Abroad 00:31 Personal Stories and Collective Trauma 01:32 Blatant Racism in Europe 01:59 Gender Racism 02:26 Workplace Discrimination 02:54 Subtle Racism 04:53 Racism from Minority Communities 05:57 Stereotypes 08:57 Internalized Racism Among In",
          "publishedAt": "2025-07-27T16:07:52+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/6u5c7MTR158/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=6u5c7MTR158",
          "duration": "PT0S",
          "viewCount": "23072",
          "isLive": false,
          "searchableText": "dark truth about racism abroad indians face a lot of racism abroad, and this video breaks down the types of racism, how it feels and actual stories from you! keep in touch for events via https://forms.gle/rtketuavgnrehjl5a chapters 00:00 introduction: the reality of racism for indians abroad 00:31 personal stories and collective trauma 01:32 blatant racism in europe 01:59 gender racism 02:26 workplace discrimination 02:54 subtle racism 04:53 racism from minority communities 05:57 stereotypes 08:57 internalized racism among in   nri diaries by nupur dave",
          "keywords": "",
          "hash": "d59b0116"
        }
      ]
    },
    "UC19ruvzi32BWrWFpek4p3hA": {
      "name": "Been There, Done That",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-08-17T09:41:06.209Z",
      "fetchStatus": "success",
      "fetchDuration": 90,
      "videos": [
        {
          "id": "O-cFsO9jk3I",
          "title": "\"I Almost Died Catching a King Cobra at 77\" — Romulus Whitaker",
          "description": "At 82 years old, most people enjoy retirement. Romulus Whitaker still goes into the wild to catch King Cobras. In this conversation, India’s legendary “Snake Man” reveals why he refuses to slow down, what it feels like to face a 12-foot cobra charging at you, and the life lessons he’s learned after decades of surviving snake bites and close calls. From transporting over 1,000 crocodiles across India to building a global reputation as a conservationist, Romulus shares stories that are equal parts",
          "publishedAt": "2025-08-16T13:16:13+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/O-cFsO9jk3I/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=O-cFsO9jk3I",
          "duration": "PT0S",
          "viewCount": "23",
          "isLive": false,
          "searchableText": "\"i almost died catching a king cobra at 77\" — romulus whitaker at 82 years old, most people enjoy retirement. romulus whitaker still goes into the wild to catch king cobras. in this conversation, india’s legendary “snake man” reveals why he refuses to slow down, what it feels like to face a 12-foot cobra charging at you, and the life lessons he’s learned after decades of surviving snake bites and close calls. from transporting over 1,000 crocodiles across india to building a global reputation as a conservationist, romulus shares stories that are equal parts   been there, done that",
          "keywords": "",
          "hash": "6a67fc53"
        },
        {
          "id": "lgz8KfscRYc",
          "title": "The Mystery Female Voice of Delhi Metro Revealed ft Rini Simon Khanna",
          "description": "You’ve heard her voice every single day — on the Delhi Metro, Mumbai Metro, and even Indian Railways. But who is the woman behind those iconic announcements? In this episode of Been There Done That, we sit down with Rini Simon Khanna, the legendary broadcaster whose calm, reassuring voice became the soundtrack of India’s public transport. From anchoring Doordarshan’s prime-time news to becoming the voice of millions of daily commuters, Rini shares stories about: How she first got chosen to recor",
          "publishedAt": "2025-08-06T14:18:33+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/lgz8KfscRYc/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=lgz8KfscRYc",
          "duration": "PT0S",
          "viewCount": "556",
          "isLive": false,
          "searchableText": "the mystery female voice of delhi metro revealed ft rini simon khanna you’ve heard her voice every single day — on the delhi metro, mumbai metro, and even indian railways. but who is the woman behind those iconic announcements? in this episode of been there done that, we sit down with rini simon khanna, the legendary broadcaster whose calm, reassuring voice became the soundtrack of india’s public transport. from anchoring doordarshan’s prime-time news to becoming the voice of millions of daily commuters, rini shares stories about: how she first got chosen to recor   been there, done that",
          "keywords": "",
          "hash": "4406cf10"
        },
        {
          "id": "C-iOGzke424",
          "title": "Asking a 1971 War Veteran About War, Regrets, and Staying Young ft Colonel RV Subramaniam",
          "description": "What does it take to stay fit, fearless, and full of life at 85? Meet Colonel RV Subramaniam — a 1971 war veteran, former national-level athlete, and someone who still follows his army routine every single day. In this episode of Been There Done That, Rajneil Kamat sits down with the Colonel to talk about: His unforgettable experiences in the 1971 war The discipline and fitness habits that keep him stronger than most Gen Z Life after leaving the Indian Army and adapting to civilian life The bigg",
          "publishedAt": "2025-07-30T12:30:15+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/C-iOGzke424/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=C-iOGzke424",
          "duration": "PT0S",
          "viewCount": "335",
          "isLive": false,
          "searchableText": "asking a 1971 war veteran about war, regrets, and staying young ft colonel rv subramaniam what does it take to stay fit, fearless, and full of life at 85? meet colonel rv subramaniam — a 1971 war veteran, former national-level athlete, and someone who still follows his army routine every single day. in this episode of been there done that, rajneil kamat sits down with the colonel to talk about: his unforgettable experiences in the 1971 war the discipline and fitness habits that keep him stronger than most gen z life after leaving the indian army and adapting to civilian life the bigg   been there, done that",
          "keywords": "",
          "hash": "f073e872"
        }
      ]
    },
    "UCv0ZVHNQmQF1M681j6kK-Hw": {
      "name": "gen.E",
      "category": "sustainability",
      "color": "teal",
      "lastFetched": "2025-08-17T09:41:06.224Z",
      "fetchStatus": "success",
      "fetchDuration": 103,
      "videos": []
    },
    "UCbMzIZqxM7pf8GuyaJDP0Vg": {
      "name": "The Plate India",
      "category": "sustainability",
      "color": "teal",
      "lastFetched": "2025-08-17T09:41:06.484Z",
      "fetchStatus": "success",
      "fetchDuration": 163,
      "videos": [
        {
          "id": "2S7iSj4O59I",
          "title": "The Chai Story | How tea became India's national drink",
          "description": "Chai is the drink that fuels India today. But just over a century ago, hardly anyone in India knew about tea, forget drinking it. So how did India go from ignorance and indifference to becoming one of the largest producers and consumers of tea in the world? Hint: It was the result of one of the greatest marketing campaigns the world has ever seen! We help you understand India from farm to plate. Visit https://ThePlate.in for more The Plate on Instagram: https://Instagram.com/theplateindia The Pl",
          "publishedAt": "2025-08-13T01:30:04+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/2S7iSj4O59I/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=2S7iSj4O59I",
          "duration": "PT0S",
          "viewCount": "520",
          "isLive": false,
          "searchableText": "the chai story | how tea became india's national drink chai is the drink that fuels india today. but just over a century ago, hardly anyone in india knew about tea, forget drinking it. so how did india go from ignorance and indifference to becoming one of the largest producers and consumers of tea in the world? hint: it was the result of one of the greatest marketing campaigns the world has ever seen! we help you understand india from farm to plate. visit https://theplate.in for more the plate on instagram: https://instagram.com/theplateindia the pl   the plate india",
          "keywords": "",
          "hash": "7dd65eea"
        },
        {
          "id": "iMqGYgboKr8",
          "title": "How a young Punjab woman farmer revived forgotten wheat | And created a pan-India business",
          "description": "Anushka Neyol is a young seventh generation farmer from India's wheat basket of Punjab. Anushka decided to marry her education in business management and economics with her passion for farming, launching a farm business that grows and sells nearly 20 different varieties of heirloom wheats that we've forgotten. Listen to her life story of accidentally turning a wheat nerd and the journey as a self-taught farmpreneur. Contents of video --- 0:00 Intro 1:40 Finding a farm idea 3:30 Black wheat 4:38 ",
          "publishedAt": "2025-07-08T02:30:37+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/iMqGYgboKr8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=iMqGYgboKr8",
          "duration": "PT0S",
          "viewCount": "827",
          "isLive": false,
          "searchableText": "how a young punjab woman farmer revived forgotten wheat | and created a pan-india business anushka neyol is a young seventh generation farmer from india's wheat basket of punjab. anushka decided to marry her education in business management and economics with her passion for farming, launching a farm business that grows and sells nearly 20 different varieties of heirloom wheats that we've forgotten. listen to her life story of accidentally turning a wheat nerd and the journey as a self-taught farmpreneur. contents of video --- 0:00 intro 1:40 finding a farm idea 3:30 black wheat 4:38    the plate india",
          "keywords": "",
          "hash": "306105c3"
        },
        {
          "id": "10jiqwZmELY",
          "title": "India’s High-Value Export Behind Luxury Perfumes | From Madurai to Paris",
          "description": "In the world of luxury perfumes, jasmine and rose are the king and queen—no floral fragrance is complete without them. And some 100,000 farmers in a tiny area around Madurai produce the world’s best jasmine that powers scents by Dior, Guerlain or Tom Ford. It takes more than 1,000 kilos of these tiny milky-white flowers to make just one kilo of jasmine oil—an oil that sells for nearly ₹4 lakh. The jasmine sambac or Madurai jasmine is considered a symbol of love, beauty and purity. In this video ",
          "publishedAt": "2025-05-29T13:30:03+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/10jiqwZmELY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=10jiqwZmELY",
          "duration": "PT0S",
          "viewCount": "96102",
          "isLive": false,
          "searchableText": "india’s high-value export behind luxury perfumes | from madurai to paris in the world of luxury perfumes, jasmine and rose are the king and queen—no floral fragrance is complete without them. and some 100,000 farmers in a tiny area around madurai produce the world’s best jasmine that powers scents by dior, guerlain or tom ford. it takes more than 1,000 kilos of these tiny milky-white flowers to make just one kilo of jasmine oil—an oil that sells for nearly ₹4 lakh. the jasmine sambac or madurai jasmine is considered a symbol of love, beauty and purity. in this video    the plate india",
          "keywords": "",
          "hash": "71507b6c"
        }
      ]
    }
  },
  "metadata": {
    "totalVideos": 109,
    "totalChannels": 22,
    "successfulChannels": 22,
    "lastSuccessfulFetch": "2025-08-17T09:41:06.819Z",
    "fetchDuration": 1293
  }
}