{
  "lastUpdated": "2025-09-17T02:39:18.883Z",
  "channels": {
    "UCXmAKxh_qFL5703W9VPgpnA": {
      "name": "Food Pharmer",
      "category": "health",
      "color": "green",
      "lastFetched": "2025-09-17T02:39:17.188Z",
      "fetchStatus": "success",
      "fetchDuration": 686,
      "videos": [
        {
          "id": "XqVwwLKHZIg",
          "title": "India’s top Dentist on Brushing, Whitening, Cavity, Braces & Cancer | Dr. Sandesh Mayekar Ep. 16",
          "description": "Are you brushing your teeth the right way? Can whitening damage your enamel? Do chocolates really cause cavities? Well, to answer all of these, we have Dr. Sandesh Mayekar with us, one of India’s most respected dentists. In this episode of Rethink India, we’ve brought in Dr. Sandesh Mayekar, widely acclaimed as the Father of Aesthetic & Cosmetic Dentistry in India and often referred to as the “Father of Modern Dentistry in India” to unpack the big and little truths behind oral health. From oral ",
          "publishedAt": "2025-09-13T09:30:17+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/XqVwwLKHZIg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=XqVwwLKHZIg",
          "duration": "PT0S",
          "viewCount": "81300",
          "isLive": false,
          "searchableText": "india’s top dentist on brushing, whitening, cavity, braces & cancer | dr. sandesh mayekar ep. 16 are you brushing your teeth the right way? can whitening damage your enamel? do chocolates really cause cavities? well, to answer all of these, we have dr. sandesh mayekar with us, one of india’s most respected dentists. in this episode of rethink india, we’ve brought in dr. sandesh mayekar, widely acclaimed as the father of aesthetic & cosmetic dentistry in india and often referred to as the “father of modern dentistry in india” to unpack the big and little truths behind oral health. from oral    food pharmer",
          "keywords": "",
          "hash": "6c40f0ae"
        },
        {
          "id": "1iOMLIu_osA",
          "title": "REVENUE REVEALED | August Report Card ft. @badshahlive @samanthaofficial @SamayRainaOfficial",
          "description": "Order Now - https://onlywhatsneeded.in/product/whey-protein-2?utm_source=social&utm_medium=youtube&utm_campaign=monthly-yt Welcome to our August Board Meeting 🚀 This is where I share everything openly with you - the good, the bad, the stockouts, the fixes - because OWN is India’s first democratically built food platform. Agenda for this month: - Badshah’s shock review (along with Samantha, Namita, Fukra Insaan & more) - Problems you called out & how we fixed them (mixability, zip locks, deliver",
          "publishedAt": "2025-09-11T15:11:55+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/1iOMLIu_osA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=1iOMLIu_osA",
          "duration": "PT0S",
          "viewCount": "211841",
          "isLive": false,
          "searchableText": "revenue revealed | august report card ft. @badshahlive @samanthaofficial @samayrainaofficial order now - https://onlywhatsneeded.in/product/whey-protein-2?utm_source=social&utm_medium=youtube&utm_campaign=monthly-yt welcome to our august board meeting 🚀 this is where i share everything openly with you - the good, the bad, the stockouts, the fixes - because own is india’s first democratically built food platform. agenda for this month: - badshah’s shock review (along with samantha, namita, fukra insaan & more) - problems you called out & how we fixed them (mixability, zip locks, deliver   food pharmer",
          "keywords": "",
          "hash": "41755ed1"
        },
        {
          "id": "besg1MmOepw",
          "title": "10+ Rusks Ranked from Worst to Best",
          "description": "People complain that I don’t give enough healthier alternatives, so I want to start giving more healthy alternatives with every video. I want to go from being problem-focused to solution-focused. For something that is our go-to snack, choosing the right type matters. Watch to learn about the best and worst rusks in the market. Share with someone who loves rusks! I want to thank @Zero1byZerodha for always supporting me. Zero1 by Zerodha financially supports creators and storytellers through its n",
          "publishedAt": "2025-09-10T13:18:29+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/besg1MmOepw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=besg1MmOepw",
          "duration": "PT0S",
          "viewCount": "93152",
          "isLive": false,
          "searchableText": "10+ rusks ranked from worst to best people complain that i don’t give enough healthier alternatives, so i want to start giving more healthy alternatives with every video. i want to go from being problem-focused to solution-focused. for something that is our go-to snack, choosing the right type matters. watch to learn about the best and worst rusks in the market. share with someone who loves rusks! i want to thank @zero1byzerodha for always supporting me. zero1 by zerodha financially supports creators and storytellers through its n   food pharmer",
          "keywords": "",
          "hash": "6cf524ff"
        },
        {
          "id": "4sgQ7cU5ag4",
          "title": "Maggi launches 2 masala sachets in 1 pack | HONEST REVIEW",
          "description": "In this video, I break down the shocking truth about Maggi’s new 2 masala sachet packet, its high sodium content, and what it means for your health. If you care about your family’s health, watch this before you eat it! Maggi was already a high sodium food, and it is shocking that they have now introduced a pack with double masala. On average, Indians consume around 4400 mg of sodium per day, when the recommended maximum limit is only 2000 mg. This is one of the reasons why India is also becoming",
          "publishedAt": "2025-09-02T10:35:07+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/4sgQ7cU5ag4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=4sgQ7cU5ag4",
          "duration": "PT0S",
          "viewCount": "198487",
          "isLive": false,
          "searchableText": "maggi launches 2 masala sachets in 1 pack | honest review in this video, i break down the shocking truth about maggi’s new 2 masala sachet packet, its high sodium content, and what it means for your health. if you care about your family’s health, watch this before you eat it! maggi was already a high sodium food, and it is shocking that they have now introduced a pack with double masala. on average, indians consume around 4400 mg of sodium per day, when the recommended maximum limit is only 2000 mg. this is one of the reasons why india is also becoming   food pharmer",
          "keywords": "",
          "hash": "827255ac"
        },
        {
          "id": "4lts0pW8zXA",
          "title": "The Hidden Cruelty of Indian Hospitals | How to solve India’s healthcare crisis | Rethink India Ep15",
          "description": "Are hospitals fooling you with their bill structure? Are doctors not being paid well? Can there ever be solutions to the needs of the patients? Well, to answer all of these, we have Varun Dubey with us, the CEO of Superhealth Hospital. In this episode of Rethink India, he drops truth bombs about how our hospitals function. In the most unfiltered conversation ever, he spoke about doctors, hospitals and what is the need of the hour. We spoke about: - Doctors being asked to be salesperson - Issues ",
          "publishedAt": "2025-08-30T08:54:31+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/4lts0pW8zXA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=4lts0pW8zXA",
          "duration": "PT0S",
          "viewCount": "173053",
          "isLive": false,
          "searchableText": "the hidden cruelty of indian hospitals | how to solve india’s healthcare crisis | rethink india ep15 are hospitals fooling you with their bill structure? are doctors not being paid well? can there ever be solutions to the needs of the patients? well, to answer all of these, we have varun dubey with us, the ceo of superhealth hospital. in this episode of rethink india, he drops truth bombs about how our hospitals function. in the most unfiltered conversation ever, he spoke about doctors, hospitals and what is the need of the hour. we spoke about: - doctors being asked to be salesperson - issues    food pharmer",
          "keywords": "",
          "hash": "50c1c12a"
        },
        {
          "id": "gszbTkRYQwA",
          "title": "SCOOP SCAM : How protein powder companies fool you?",
          "description": "Order now- https://onlywhatsneeded.in/product/whey-protein-2?utm_source=social&utm_medium=youtube&utm_campaign=scoop-size-yt Most people assume that if a brand says 26g or 28g protein per scoop, it must be better than another brand offering 24g per scoop. But that’s not the full picture. What really matters is not just the protein number (the numerator) but the scoop size (the denominator). A company can give you a huge scoop filled with fillers, carbs, or other stuff—making the protein per scoo",
          "publishedAt": "2025-08-29T12:53:24+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/gszbTkRYQwA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=gszbTkRYQwA",
          "duration": "PT0S",
          "viewCount": "41800",
          "isLive": false,
          "searchableText": "scoop scam : how protein powder companies fool you? order now- https://onlywhatsneeded.in/product/whey-protein-2?utm_source=social&utm_medium=youtube&utm_campaign=scoop-size-yt most people assume that if a brand says 26g or 28g protein per scoop, it must be better than another brand offering 24g per scoop. but that’s not the full picture. what really matters is not just the protein number (the numerator) but the scoop size (the denominator). a company can give you a huge scoop filled with fillers, carbs, or other stuff—making the protein per scoo   food pharmer",
          "keywords": "",
          "hash": "cad869c9"
        },
        {
          "id": "KZGl_rKULEA",
          "title": "20+ Chocolates Ranked from Worst to Best",
          "description": "Toothsi teeth aligners straighten crooked teeth and close teeth gaps. Book your FREE teeth scan now: https://toothsi.makeo.app/FoodPharmer Discount code: FDP25TS #toothsibymakeO #makeO #toothsialigners #toothsiclearaligners #toothsiindia #teethaligners #aligners #clearaligners #teethcare #smile #AD People complain that I don’t give enough healthier alternatives, so I want to start giving more healthy alternatives with every video. I want to go from being problem-focused to solution-focused. Note",
          "publishedAt": "2025-08-28T14:41:43+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/KZGl_rKULEA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=KZGl_rKULEA",
          "duration": "PT0S",
          "viewCount": "487976",
          "isLive": false,
          "searchableText": "20+ chocolates ranked from worst to best toothsi teeth aligners straighten crooked teeth and close teeth gaps. book your free teeth scan now: https://toothsi.makeo.app/foodpharmer discount code: fdp25ts #toothsibymakeo #makeo #toothsialigners #toothsiclearaligners #toothsiindia #teethaligners #aligners #clearaligners #teethcare #smile #ad people complain that i don’t give enough healthier alternatives, so i want to start giving more healthy alternatives with every video. i want to go from being problem-focused to solution-focused. note   food pharmer",
          "keywords": "",
          "hash": "ff5bc57b"
        }
      ]
    },
    "UCZknyXD-6tETm9aN8GQCi8g": {
      "name": "The Cutting Edge School",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-09-17T02:39:17.160Z",
      "fetchStatus": "success",
      "fetchDuration": 604,
      "videos": [
        {
          "id": "XTa25WnPgTg",
          "title": "Speaking Skills for the AI Era (Gamma Tutorial)",
          "description": "⚡Start designing today with Gamma for free ➡ https://gamma.app From being an introverted kid in 2015 to speaking on stages across India and abroad, I’ve learned how powerful, confident and stage presence can be. In this video, I share the 3 pillars of stage confidence - content mastery, delivery, and deck design. If you want to communicate with impact and hold attention on stage, this is your roadmap. Resources mentioned in the video - 👉 How to Write & Document on Notion: https://youtu.be/ZhitF",
          "publishedAt": "2025-09-16T12:31:43+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/XTa25WnPgTg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=XTa25WnPgTg",
          "duration": "PT0S",
          "viewCount": "3372",
          "isLive": false,
          "searchableText": "speaking skills for the ai era (gamma tutorial) ⚡start designing today with gamma for free ➡ https://gamma.app from being an introverted kid in 2015 to speaking on stages across india and abroad, i’ve learned how powerful, confident and stage presence can be. in this video, i share the 3 pillars of stage confidence - content mastery, delivery, and deck design. if you want to communicate with impact and hold attention on stage, this is your roadmap. resources mentioned in the video - 👉 how to write & document on notion: https://youtu.be/zhitf   the cutting edge school",
          "keywords": "",
          "hash": "e892f97d"
        },
        {
          "id": "4wMMB6ZmiFw",
          "title": "Best AI Courses, Roadmaps & Reports for Beginners in 2025",
          "description": "Want to master the most valuable AI skills of 2025? 👉 Check out the links to all the mentioned Simplilearn programs: Professional Certificate Program in GenAI & Machine Learning: https://bit.ly/Professional-Certificate-GenAI-ML Professional Certificate Course in Generative AI & Machine Learning: https://bit.ly/Professional-Certificate-AI-ML Advanced Executive Program in Applied Generative AI: https://bit.ly/Applied-GenerativeAI-Program Links to all the resources mentioned in the video: https://",
          "publishedAt": "2025-09-11T12:31:21+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/4wMMB6ZmiFw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=4wMMB6ZmiFw",
          "duration": "PT0S",
          "viewCount": "13238",
          "isLive": false,
          "searchableText": "best ai courses, roadmaps & reports for beginners in 2025 want to master the most valuable ai skills of 2025? 👉 check out the links to all the mentioned simplilearn programs: professional certificate program in genai & machine learning: https://bit.ly/professional-certificate-genai-ml professional certificate course in generative ai & machine learning: https://bit.ly/professional-certificate-ai-ml advanced executive program in applied generative ai: https://bit.ly/applied-generativeai-program links to all the resources mentioned in the video: https://   the cutting edge school",
          "keywords": "",
          "hash": "3d80d3cd"
        }
      ]
    },
    "UCggPd3Vf9ooG2r4I_ZNWBzA": {
      "name": "Wint Wealth",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-09-17T02:39:16.777Z",
      "fetchStatus": "success",
      "fetchDuration": 218,
      "videos": [
        {
          "id": "7qJhtvi98e4",
          "title": "How he Retired at 34 and Now Makes 1Cr Per Year?",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 At just 34 years old, Mayur Channagere took a bold step most people only dream of, he retired early from corporate life. With a carefully built corpus , he walked away from a stable Infosys career in 2009 to pursue his passion for photography. A true Bangalorean, he began his journey with a Bachelor’s in Business Management in Bangalore and an MBA in London. Returning to India in 2002, he climbed the corporate ladd",
          "publishedAt": "2025-09-12T13:30:08+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/7qJhtvi98e4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=7qJhtvi98e4",
          "duration": "PT0S",
          "viewCount": "33150",
          "isLive": false,
          "searchableText": "how he retired at 34 and now makes 1cr per year? fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 at just 34 years old, mayur channagere took a bold step most people only dream of, he retired early from corporate life. with a carefully built corpus , he walked away from a stable infosys career in 2009 to pursue his passion for photography. a true bangalorean, he began his journey with a bachelor’s in business management in bangalore and an mba in london. returning to india in 2002, he climbed the corporate ladd   wint wealth",
          "keywords": "",
          "hash": "71ef7f56"
        },
        {
          "id": "A8tpFRIjFTA",
          "title": "They left DELHI for a MEANINGFUL Life ? ",
          "description": "Meet the couple who traded their cushy Delhi jobs for the sunny shores of Goa to chase their dream of running a food business. A story of passion, risks, and new beginnings! Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 Wint Wealth: - www.wintwealth.com",
          "publishedAt": "2025-08-23T10:30:52+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/A8tpFRIjFTA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=A8tpFRIjFTA",
          "duration": "PT0S",
          "viewCount": "38189",
          "isLive": false,
          "searchableText": "they left delhi for a meaningful life ?  meet the couple who traded their cushy delhi jobs for the sunny shores of goa to chase their dream of running a food business. a story of passion, risks, and new beginnings! fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 wint wealth: - www.wintwealth.com   wint wealth",
          "keywords": "",
          "hash": "ce8b5f03"
        },
        {
          "id": "CUM2xksBMtk",
          "title": "₹70 Lakhs loss to ₹10 Crore corpus in 10 years? ",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 He blew up ₹70 lakhs and walked away from stocks. In 2015 he came back with a clear, equity-first plan. ₹50 lakhs compounded into ₹10.2 crore in 10 years—16×. This is the mindset and simple rules behind that comeback. Wint Wealth: https://wintwealth.onelink.me/o6zX/wintWealth",
          "publishedAt": "2025-08-08T13:01:30+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/CUM2xksBMtk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=CUM2xksBMtk",
          "duration": "PT0S",
          "viewCount": "107528",
          "isLive": false,
          "searchableText": "₹70 lakhs loss to ₹10 crore corpus in 10 years?  fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 he blew up ₹70 lakhs and walked away from stocks. in 2015 he came back with a clear, equity-first plan. ₹50 lakhs compounded into ₹10.2 crore in 10 years—16×. this is the mindset and simple rules behind that comeback. wint wealth: https://wintwealth.onelink.me/o6zx/wintwealth   wint wealth",
          "keywords": "",
          "hash": "2f99e026"
        },
        {
          "id": "6DucxPSgPb8",
          "title": "From Corporate Hustle to Financial Freedom on a Farm | LIFE BEYOND FREEDOM",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 A slow, thoughtful journey of leaving it all behind. In this video, we follow the story of a couple who traded deadlines and boardrooms for dirt roads and sunrise harvests. Tired of city chaos and corporate burnout, they made a bold move to a tier-3 town — not to escape work, but to redefine it. Through quiet mornings, simple routines, and a deep connection with nature, their story is less about leaving a job, and ",
          "publishedAt": "2025-07-19T06:30:03+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/6DucxPSgPb8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=6DucxPSgPb8",
          "duration": "PT0S",
          "viewCount": "340213",
          "isLive": false,
          "searchableText": "from corporate hustle to financial freedom on a farm | life beyond freedom fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 a slow, thoughtful journey of leaving it all behind. in this video, we follow the story of a couple who traded deadlines and boardrooms for dirt roads and sunrise harvests. tired of city chaos and corporate burnout, they made a bold move to a tier-3 town — not to escape work, but to redefine it. through quiet mornings, simple routines, and a deep connection with nature, their story is less about leaving a job, and    wint wealth",
          "keywords": "",
          "hash": "1e963fc4"
        },
        {
          "id": "IM_qVg4pmT8",
          "title": "This guy became a Millionaire through Sports!",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 From chasing finish lines to building a financial foundation — this is the story of a professional triathlete who turned his passion for endurance sports into long-term financial security. In this episode, he breaks down how he planned his finances, navigated an unpredictable income stream, and built a corpus that supports him beyond his sporting career. A deep dive into discipline — both physical and financial. Wi",
          "publishedAt": "2025-07-08T12:31:21+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/IM_qVg4pmT8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=IM_qVg4pmT8",
          "duration": "PT0S",
          "viewCount": "25271",
          "isLive": false,
          "searchableText": "this guy became a millionaire through sports! fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 from chasing finish lines to building a financial foundation — this is the story of a professional triathlete who turned his passion for endurance sports into long-term financial security. in this episode, he breaks down how he planned his finances, navigated an unpredictable income stream, and built a corpus that supports him beyond his sporting career. a deep dive into discipline — both physical and financial. wi   wint wealth",
          "keywords": "",
          "hash": "5ddcc9c6"
        },
        {
          "id": "fYnHcgnpfBA",
          "title": "Are you SPENDING more than you EARN?  | Spender v/s Saver",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 In this episode of the Assumptions series, we pit two very different money mindsets against each other—the Spender and the Miser. What happens when someone who tracks every rupee meets someone who forgets where their last ₹10,000 went? From budgeting and credit card guilt to treating yourself vs saving for your kids' future, no topic is off-limits. Expect sharp questions, honest reactions, and a whole lot of uncomf",
          "publishedAt": "2025-06-29T10:50:00+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/fYnHcgnpfBA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=fYnHcgnpfBA",
          "duration": "PT0S",
          "viewCount": "60911",
          "isLive": false,
          "searchableText": "are you spending more than you earn?  | spender v/s saver fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 in this episode of the assumptions series, we pit two very different money mindsets against each other—the spender and the miser. what happens when someone who tracks every rupee meets someone who forgets where their last ₹10,000 went? from budgeting and credit card guilt to treating yourself vs saving for your kids' future, no topic is off-limits. expect sharp questions, honest reactions, and a whole lot of uncomf   wint wealth",
          "keywords": "",
          "hash": "5bd2467f"
        },
        {
          "id": "qH7YKlmOf1Q",
          "title": "She LEFT Her Job To Work on Her Passion? | Assumptions",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 In this new series, we bust common myths about the so-called \"safe\" corporate path vs the uncertain journey of passion-led careers. Joined by Mrunmayi Oke (Ex-Dunzo, now on a career break) and Srishti Malpath (wellness coach & yoga practitioner), we dive into privilege, paychecks, happiness—and everything in between. Wint Wealth: https://wintwealth.onelink.me/o6zX/wintWealth",
          "publishedAt": "2025-06-21T05:30:34+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/qH7YKlmOf1Q/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=qH7YKlmOf1Q",
          "duration": "PT0S",
          "viewCount": "17324",
          "isLive": false,
          "searchableText": "she left her job to work on her passion? | assumptions fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 in this new series, we bust common myths about the so-called \"safe\" corporate path vs the uncertain journey of passion-led careers. joined by mrunmayi oke (ex-dunzo, now on a career break) and srishti malpath (wellness coach & yoga practitioner), we dive into privilege, paychecks, happiness—and everything in between. wint wealth: https://wintwealth.onelink.me/o6zx/wintwealth   wint wealth",
          "keywords": "",
          "hash": "1a1dd522"
        },
        {
          "id": "h4TViR9nQ-Y",
          "title": "Banks Forced Him to Buy ULIPs?",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 To file your complaint visit RBI Ombudsman Complaint Portal: https://cms.rbi.org.in/cms/indexpage.html#english Who hasn't gotten calls from their banks pitching loans, ULIPs or other special investment products? But are these really good for you? Three former bank employees reveal how they were forced to sell bad products to customers through intense pressure tactics, impossible sales targets, and threats they face",
          "publishedAt": "2025-05-15T13:53:42+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/h4TViR9nQ-Y/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=h4TViR9nQ-Y",
          "duration": "PT0S",
          "viewCount": "108440",
          "isLive": false,
          "searchableText": "banks forced him to buy ulips? fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 to file your complaint visit rbi ombudsman complaint portal: https://cms.rbi.org.in/cms/indexpage.html#english who hasn't gotten calls from their banks pitching loans, ulips or other special investment products? but are these really good for you? three former bank employees reveal how they were forced to sell bad products to customers through intense pressure tactics, impossible sales targets, and threats they face   wint wealth",
          "keywords": "",
          "hash": "06f6f061"
        }
      ]
    },
    "UCnpekFV93kB1O0rVqEKSumg": {
      "name": "Backstage with Millionaires",
      "category": "upskilling",
      "color": "orange",
      "lastFetched": "2025-09-17T02:39:17.177Z",
      "fetchStatus": "success",
      "fetchDuration": 618,
      "videos": [
        {
          "id": "TqjNTqpHxfA",
          "title": "Top 5 Investments in Indian Startup History",
          "description": "Form to register for D2C event in Bangalore - https://forms.gle/kQEUf3Lb4UWvGi3F6 00:00 Intro 01:24 Titan Capital- Urban Company 03:12 Anupam Mittal - Ola 04:46 Hero - Ather Energy 07:17 Accel - Flipkart 08:40 Info Edge - Zomato India's startup ecosystem transformation has been driven by strategic investments that provided not just capital but credibility. These five landmark investments shaped entire sectors and demonstrated India's potential for building massive technology companies. 5. Titan ",
          "publishedAt": "2025-09-16T10:56:08+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/TqjNTqpHxfA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=TqjNTqpHxfA",
          "duration": "PT0S",
          "viewCount": "15637",
          "isLive": false,
          "searchableText": "top 5 investments in indian startup history form to register for d2c event in bangalore - https://forms.gle/kqeuf3lb4uwvgi3f6 00:00 intro 01:24 titan capital- urban company 03:12 anupam mittal - ola 04:46 hero - ather energy 07:17 accel - flipkart 08:40 info edge - zomato india's startup ecosystem transformation has been driven by strategic investments that provided not just capital but credibility. these five landmark investments shaped entire sectors and demonstrated india's potential for building massive technology companies. 5. titan    backstage with millionaires",
          "keywords": "",
          "hash": "11f85d3f"
        },
        {
          "id": "pOuSmchhlws",
          "title": "How Karnataka is Building India's Quantum Future? - Indian Startups News 278",
          "description": "Form to register for D2C event in Bangalore - https://forms.gle/kQEUf3Lb4UWvGi3F6 00:00 Karnataka's Quantum City 04:31 D2C Founders Meetup 05:24 RMG Ban After Effects 06:54 Licious shuts down Uncrave 07:15 OpenAi-Reliance Deal 07:39 OYO's Name Change 07:57 Funding News Karnataka's Quantum City Bengaluru, India’s tech hub, is aiming to become a global leader in quantum technology with an ambitious plan to build a \"Quantum City.\" The goal is to create a $20 billion quantum economy by 2035, transfo",
          "publishedAt": "2025-09-13T06:46:29+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/pOuSmchhlws/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=pOuSmchhlws",
          "duration": "PT0S",
          "viewCount": "23704",
          "isLive": false,
          "searchableText": "how karnataka is building india's quantum future? - indian startups news 278 form to register for d2c event in bangalore - https://forms.gle/kqeuf3lb4uwvgi3f6 00:00 karnataka's quantum city 04:31 d2c founders meetup 05:24 rmg ban after effects 06:54 licious shuts down uncrave 07:15 openai-reliance deal 07:39 oyo's name change 07:57 funding news karnataka's quantum city bengaluru, india’s tech hub, is aiming to become a global leader in quantum technology with an ambitious plan to build a \"quantum city.\" the goal is to create a $20 billion quantum economy by 2035, transfo   backstage with millionaires",
          "keywords": "",
          "hash": "8c2fcfa4"
        },
        {
          "id": "Kh-jTbJjp04",
          "title": "Can PocketFM be India's Answer to Netflix? - Startup Case Study",
          "description": "00:00 Intro 01:18 Origin Story 05:50 Cracking the Code 07:38 Scaling the Product 11:08 Future Plans This video talks about the remarkable journey of Pocket FM, an Indian company that has pioneered a new entertainment category: audio series. Beginning with an annual revenue of Rs. 1,768 crore in FY25, Pocket FM's success is particularly notable because over 70% of its revenue comes from the US market—a rare feat for an Indian consumer platform. The company's story began in 2014, when co-founder R",
          "publishedAt": "2025-09-08T12:20:00+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/Kh-jTbJjp04/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Kh-jTbJjp04",
          "duration": "PT0S",
          "viewCount": "26405",
          "isLive": false,
          "searchableText": "can pocketfm be india's answer to netflix? - startup case study 00:00 intro 01:18 origin story 05:50 cracking the code 07:38 scaling the product 11:08 future plans this video talks about the remarkable journey of pocket fm, an indian company that has pioneered a new entertainment category: audio series. beginning with an annual revenue of rs. 1,768 crore in fy25, pocket fm's success is particularly notable because over 70% of its revenue comes from the us market—a rare feat for an indian consumer platform. the company's story began in 2014, when co-founder r   backstage with millionaires",
          "keywords": "",
          "hash": "5e429fad"
        },
        {
          "id": "b851aysiA58",
          "title": "What is Mukesh Ambani's AI Plan for India? - Indian Startups News 277",
          "description": "00:00 Reliance's AI Plans 04:08 ISRO's Vikram-32 Chip 05:37 Boat-HrdWyr Partnership 05:55 Ola Layoffs 06:13 Urban Company IPO 06:33 OpenAi's India Data Centre 06:51 Ather's Project Redux 07:17 Funding News Reliance's AI Gamble At its recent AGM, Mukesh Ambani announced Reliance Intelligence, a new subsidiary focused on artificial intelligence. The goal is to build a robust AI infrastructure in India by collaborating with global leaders. Reliance has formed a $100 million joint venture with Meta,",
          "publishedAt": "2025-09-06T05:24:53+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/b851aysiA58/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=b851aysiA58",
          "duration": "PT0S",
          "viewCount": "37433",
          "isLive": false,
          "searchableText": "what is mukesh ambani's ai plan for india? - indian startups news 277 00:00 reliance's ai plans 04:08 isro's vikram-32 chip 05:37 boat-hrdwyr partnership 05:55 ola layoffs 06:13 urban company ipo 06:33 openai's india data centre 06:51 ather's project redux 07:17 funding news reliance's ai gamble at its recent agm, mukesh ambani announced reliance intelligence, a new subsidiary focused on artificial intelligence. the goal is to build a robust ai infrastructure in india by collaborating with global leaders. reliance has formed a $100 million joint venture with meta,   backstage with millionaires",
          "keywords": "",
          "hash": "c14b8f86"
        },
        {
          "id": "7DLnrh7p2pU",
          "title": "Truth Behind OpenAI's new India Office - Indian Startups News 276",
          "description": "00:00 OpenAI's India Plans 04:26 Modi's Spacetech Vision 06:11 Pixxel's New Launch 06:31 Rapido Vs Uber 06:54 Gaming Bill Update 07:11 Funding News Segment OpenAI's India Plans OpenAI is making a major push into the Indian market, and this is framed not just as a business expansion, but as a strategic move for the company's survival. The article highlights three key initiatives by OpenAI in India: opening a new office in Delhi, launching a learning accelerator, and introducing a special, low-cos",
          "publishedAt": "2025-08-30T05:16:54+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/7DLnrh7p2pU/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=7DLnrh7p2pU",
          "duration": "PT0S",
          "viewCount": "65445",
          "isLive": false,
          "searchableText": "truth behind openai's new india office - indian startups news 276 00:00 openai's india plans 04:26 modi's spacetech vision 06:11 pixxel's new launch 06:31 rapido vs uber 06:54 gaming bill update 07:11 funding news segment openai's india plans openai is making a major push into the indian market, and this is framed not just as a business expansion, but as a strategic move for the company's survival. the article highlights three key initiatives by openai in india: opening a new office in delhi, launching a learning accelerator, and introducing a special, low-cos   backstage with millionaires",
          "keywords": "",
          "hash": "616b4262"
        },
        {
          "id": "ps4QlKnTMsk",
          "title": "Edtech 2.0: What's the Future of Indian Edtech after BYJU's fall?",
          "description": "India’s edtech sector has experienced a dramatic and rapid evolution, characterized by a massive boom and an equally swift bust. In 2020, fueled by the COVID-19 pandemic, investors poured billions of dollars into edtech startups, believing India’s vast student population presented a \"once-in-a-lifetime opportunity.\" The sector’s rise was largely catalyzed by BYJU’S, which became a unicorn in 2018, signaling to investors that significant returns could be made. This event, much like Flipkart's ris",
          "publishedAt": "2025-08-26T12:06:31+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/ps4QlKnTMsk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=ps4QlKnTMsk",
          "duration": "PT0S",
          "viewCount": "22391",
          "isLive": false,
          "searchableText": "edtech 2.0: what's the future of indian edtech after byju's fall? india’s edtech sector has experienced a dramatic and rapid evolution, characterized by a massive boom and an equally swift bust. in 2020, fueled by the covid-19 pandemic, investors poured billions of dollars into edtech startups, believing india’s vast student population presented a \"once-in-a-lifetime opportunity.\" the sector’s rise was largely catalyzed by byju’s, which became a unicorn in 2018, signaling to investors that significant returns could be made. this event, much like flipkart's ris   backstage with millionaires",
          "keywords": "",
          "hash": "1d53dc8b"
        },
        {
          "id": "XLNc9b8Anhk",
          "title": "Real Reason the Government Banned Real Money Gaming: Indian Startup News 275",
          "description": "Welcome to the Backstage with Millionaires weekly Indian startup news show. This week, India bans Real Money Gaming, ChatGPT GO Launched in India & Dhruv Rathee's AI Fiesta, Astrophel Aerospace has signed an MoU, IIT Hyderabad's Driverless Car, Neeraj Tyaji passes away, and Indian startups raise $276 million. 0:00 India Bans Real Money Gaming 4:26 ChatGPT Go launched in India at INR 399/month 6:32 Astrophel Aerospace's MoU to develop reusable rockets 7:05 Neeraj Tyagi passes away 7:30 Funding ro",
          "publishedAt": "2025-08-23T07:45:47+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/XLNc9b8Anhk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=XLNc9b8Anhk",
          "duration": "PT0S",
          "viewCount": "18541",
          "isLive": false,
          "searchableText": "real reason the government banned real money gaming: indian startup news 275 welcome to the backstage with millionaires weekly indian startup news show. this week, india bans real money gaming, chatgpt go launched in india & dhruv rathee's ai fiesta, astrophel aerospace has signed an mou, iit hyderabad's driverless car, neeraj tyaji passes away, and indian startups raise $276 million. 0:00 india bans real money gaming 4:26 chatgpt go launched in india at inr 399/month 6:32 astrophel aerospace's mou to develop reusable rockets 7:05 neeraj tyagi passes away 7:30 funding ro   backstage with millionaires",
          "keywords": "",
          "hash": "63e37bac"
        },
        {
          "id": "JbNS8n4QX3A",
          "title": "Who will be India's First $100 Billion Internet Company?",
          "description": "Link for our Offline Event for Healthech founders in Bangalore: https://lu.ma/ybw614eg 00:00 Intro 01:31 Flipkart 04:55 BwM's Healthech Event 06:27 Eternal 08:35 PhonePe 11:10 Groww 13:02 Ola Electric Can an Indian technology company achieve a $100 billion valuation? While India has five companies with this market cap, none are ‘internet-first’ tech companies started after the 2000s. The first milestone for Indian startups was reaching a $1 billion unicorn valuation, a feat Flipkart achieved in ",
          "publishedAt": "2025-08-19T11:59:50+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/JbNS8n4QX3A/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=JbNS8n4QX3A",
          "duration": "PT0S",
          "viewCount": "110546",
          "isLive": false,
          "searchableText": "who will be india's first $100 billion internet company? link for our offline event for healthech founders in bangalore: https://lu.ma/ybw614eg 00:00 intro 01:31 flipkart 04:55 bwm's healthech event 06:27 eternal 08:35 phonepe 11:10 groww 13:02 ola electric can an indian technology company achieve a $100 billion valuation? while india has five companies with this market cap, none are ‘internet-first’ tech companies started after the 2000s. the first milestone for indian startups was reaching a $1 billion unicorn valuation, a feat flipkart achieved in    backstage with millionaires",
          "keywords": "",
          "hash": "e22abcfe"
        },
        {
          "id": "TUhilRfEMpU",
          "title": "Indian Startup Builds World's Largest 3D-printed Rocket Engine - Indian Startup News 274",
          "description": "https://lu.ma/ybw614eg Click on the link above to apply for the offline event for healthtech founders in Bangalore. Welcome to the Backstage with Millionaires weekly Indian startup news show. This week, Agnikul builds world’s largest single-piece 3d printed rocket engine, Pixxel-led consortium to build India’s first commercial satellite network, Theobroma acquired by ChrysCapital, Backbay launch, Dhruva Space building one of India’s largest satellite mass-production facilities, Fractal Analytics",
          "publishedAt": "2025-08-16T11:29:44+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/TUhilRfEMpU/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=TUhilRfEMpU",
          "duration": "PT0S",
          "viewCount": "12406",
          "isLive": false,
          "searchableText": "indian startup builds world's largest 3d-printed rocket engine - indian startup news 274 https://lu.ma/ybw614eg click on the link above to apply for the offline event for healthtech founders in bangalore. welcome to the backstage with millionaires weekly indian startup news show. this week, agnikul builds world’s largest single-piece 3d printed rocket engine, pixxel-led consortium to build india’s first commercial satellite network, theobroma acquired by chryscapital, backbay launch, dhruva space building one of india’s largest satellite mass-production facilities, fractal analytics   backstage with millionaires",
          "keywords": "",
          "hash": "2d84f654"
        },
        {
          "id": "r9rJkCDSs5I",
          "title": "Indian Startup News 273 - Ather Is Catching up With Ola Electric",
          "description": "Welcome to the Backstage with Millionaires weekly Indian startup news show, hosted by Caleb Friesen. This week, Ather Energy closes in on Ola Electric in the EV race, Dhruva Space announces its first commercial satellite launch with SpaceX, Swiggy considers exiting its stake in Rapido over a conflict of interest, Tesla opens its first charging station in India, PharmEasy appoints Rahul Guha as CEO, and Indian startups raise $187 million. 0:00 Ather Closes Gap With Ola Electric 2:25 Dhruva Space ",
          "publishedAt": "2025-08-09T09:01:55+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/r9rJkCDSs5I/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=r9rJkCDSs5I",
          "duration": "PT0S",
          "viewCount": "30922",
          "isLive": false,
          "searchableText": "indian startup news 273 - ather is catching up with ola electric welcome to the backstage with millionaires weekly indian startup news show, hosted by caleb friesen. this week, ather energy closes in on ola electric in the ev race, dhruva space announces its first commercial satellite launch with spacex, swiggy considers exiting its stake in rapido over a conflict of interest, tesla opens its first charging station in india, pharmeasy appoints rahul guha as ceo, and indian startups raise $187 million. 0:00 ather closes gap with ola electric 2:25 dhruva space    backstage with millionaires",
          "keywords": "",
          "hash": "cb67f449"
        },
        {
          "id": "Wx-GZPXjYv4",
          "title": "How Paytm Turned Profitable? A Case Study",
          "description": "On January 31, 2024, digital payments giant Paytm was hit with a major crisis. The Reserve Bank of India (RBI) imposed a strict penalty, halting transactions on its payments bank and sending shockwaves through the company. Millions of customers and merchants were left without a bank, and in just three days, Paytm’s stock lost more than half its value. Many predicted this was the end for the company that pioneered mobile payments in India. But this is not a story of failure. It's a story of a rem",
          "publishedAt": "2025-08-06T12:02:43+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/Wx-GZPXjYv4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Wx-GZPXjYv4",
          "duration": "PT0S",
          "viewCount": "109054",
          "isLive": false,
          "searchableText": "how paytm turned profitable? a case study on january 31, 2024, digital payments giant paytm was hit with a major crisis. the reserve bank of india (rbi) imposed a strict penalty, halting transactions on its payments bank and sending shockwaves through the company. millions of customers and merchants were left without a bank, and in just three days, paytm’s stock lost more than half its value. many predicted this was the end for the company that pioneered mobile payments in india. but this is not a story of failure. it's a story of a rem   backstage with millionaires",
          "keywords": "",
          "hash": "3096c8b7"
        }
      ]
    },
    "UCf_XYgupvdx7rA44Ap3uI5w": {
      "name": "Full Disclosure",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-09-17T02:39:17.334Z",
      "fetchStatus": "success",
      "fetchDuration": 146,
      "videos": [
        {
          "id": "vv1WdzU7yk0",
          "title": "How To CORRECTLY Start Up In 2025? | The ULTIMATE Guide",
          "description": "Check out Zoho Creator: https://www.zoho.com/creator/lp/ideas-shouldnt-wait.html?utm_source=youtube&utm_medium=influencer&utm_campaign=ideas-shouldnt-wait&utm_content=full-disclosure Why do 9 out of 10 startups FAIL? In this video, Loveena Kamath breaks down the ABC of starting up. Perfect for anyone who’s wanted to test an idea in the market but never quite took the leap. She’ll also share how you can launch your business with AI in 2025 and show how Zoho Creator, an AI-powered low-code platfor",
          "publishedAt": "2025-09-12T14:30:33+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/vv1WdzU7yk0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=vv1WdzU7yk0",
          "duration": "PT0S",
          "viewCount": "32861",
          "isLive": false,
          "searchableText": "how to correctly start up in 2025? | the ultimate guide check out zoho creator: https://www.zoho.com/creator/lp/ideas-shouldnt-wait.html?utm_source=youtube&utm_medium=influencer&utm_campaign=ideas-shouldnt-wait&utm_content=full-disclosure why do 9 out of 10 startups fail? in this video, loveena kamath breaks down the abc of starting up. perfect for anyone who’s wanted to test an idea in the market but never quite took the leap. she’ll also share how you can launch your business with ai in 2025 and show how zoho creator, an ai-powered low-code platfor   full disclosure",
          "keywords": "",
          "hash": "808dcc0a"
        }
      ]
    },
    "UCIVl4K2afJgLJv0b2ToTs_g": {
      "name": "GrowthX",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-09-17T02:39:17.324Z",
      "fetchStatus": "success",
      "fetchDuration": 135,
      "videos": [
        {
          "id": "dLe0U-98ECY",
          "title": "AI hype vs Reality: The Only video, you need",
          "description": "Explore GrowthX: http://growthx.cc/ai GrowthX is a community of 4,000+ members who lead product, marketing, and growth at companies like SarvamAI, ElevenLabs, Lovable, Google, Microsoft & more. CXOs, VPs, ICs — all united by one obsession: compounding their career in the AI-first world. GrowthX members get access to : 💎 4,000+ member AI-first private community 💎 In-person monthly AI events across India 💎 AI credits & perks worth ₹4,00,000 💎 All self-paced learning programs 💎 Live weekly AI ",
          "publishedAt": "2025-09-16T13:35:00+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/dLe0U-98ECY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=dLe0U-98ECY",
          "duration": "PT0S",
          "viewCount": "2455",
          "isLive": false,
          "searchableText": "ai hype vs reality: the only video, you need explore growthx: http://growthx.cc/ai growthx is a community of 4,000+ members who lead product, marketing, and growth at companies like sarvamai, elevenlabs, lovable, google, microsoft & more. cxos, vps, ics — all united by one obsession: compounding their career in the ai-first world. growthx members get access to : 💎 4,000+ member ai-first private community 💎 in-person monthly ai events across india 💎 ai credits & perks worth ₹4,00,000 💎 all self-paced learning programs 💎 live weekly ai    growthx",
          "keywords": "",
          "hash": "43847967"
        },
        {
          "id": "GjvYNJg3-V4",
          "title": "How I Made A 500 Crore AI Editing Tool From India | ft Sanket, Invideo",
          "description": "Join GrowthX: https://growthx.cc/explore-gx-ic-invid On this episode of GrowthX Inner Circle, we sit down with Sanket Shah, co-founder and CEO of InVideo. Sanket shares the story of how InVideo disrupted the video creation industry by removing the timeline, a feature every competitor considers essential. From plateauing at $5M revenue to breaking through with AI to reach $70M+, he reveals the risky pivot that transformed InVideo from a struggling prosumer tool into an AI video creation platform.",
          "publishedAt": "2025-09-11T13:30:13+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/GjvYNJg3-V4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=GjvYNJg3-V4",
          "duration": "PT0S",
          "viewCount": "7626",
          "isLive": false,
          "searchableText": "how i made a 500 crore ai editing tool from india | ft sanket, invideo join growthx: https://growthx.cc/explore-gx-ic-invid on this episode of growthx inner circle, we sit down with sanket shah, co-founder and ceo of invideo. sanket shares the story of how invideo disrupted the video creation industry by removing the timeline, a feature every competitor considers essential. from plateauing at $5m revenue to breaking through with ai to reach $70m+, he reveals the risky pivot that transformed invideo from a struggling prosumer tool into an ai video creation platform.   growthx",
          "keywords": "",
          "hash": "ef772545"
        },
        {
          "id": "Nhm2ZaML1Ho",
          "title": "This deal will kill every AI company",
          "description": "Explore GrowthX: growthx.cc/AI GrowthX is a community of 4,000+ members who lead product, marketing, and growth at companies like SarvamAI, ElevenLabs, Lovable, Google, Microsoft & more. CXOs, VPs, ICs — all united by one obsession: compounding their career in the AI-first world. GrowthX members get access to : 💎 4,000+ member AI-first private community 💎 In-person monthly AI events across India 💎 AI credits & perks worth ₹4,00,000 💎 All self-paced learning programs 💎 Live weekly AI masterc",
          "publishedAt": "2025-09-08T13:30:22+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/Nhm2ZaML1Ho/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Nhm2ZaML1Ho",
          "duration": "PT0S",
          "viewCount": "31167",
          "isLive": false,
          "searchableText": "this deal will kill every ai company explore growthx: growthx.cc/ai growthx is a community of 4,000+ members who lead product, marketing, and growth at companies like sarvamai, elevenlabs, lovable, google, microsoft & more. cxos, vps, ics — all united by one obsession: compounding their career in the ai-first world. growthx members get access to : 💎 4,000+ member ai-first private community 💎 in-person monthly ai events across india 💎 ai credits & perks worth ₹4,00,000 💎 all self-paced learning programs 💎 live weekly ai masterc   growthx",
          "keywords": "",
          "hash": "77efb7e1"
        }
      ]
    },
    "UC3-IDKNIABI98_J2aqa2YjQ": {
      "name": "Think School Hindi by Zero1",
      "category": "upskilling",
      "color": "orange",
      "lastFetched": "2025-09-17T02:39:17.381Z",
      "fetchStatus": "success",
      "fetchDuration": 192,
      "videos": [
        {
          "id": "iaFMlGCMEMQ",
          "title": "How to Raise Funds for Your Startup ?Millionaire Investor drops INSIDER Secrets | Arjun Vaidya",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉Spotify Link: https://open.spotify.com/episode/1duQrgdgOnQkuf5s61ZrRk?si=5woursO_TWKVMgVXWq2sKg&nd=1&dlsi=05fd52f1e1fd4a2d 👉By Think School: https://thethinkschool.com/ 👉VIDEO INTRODUCTION: In this episode of the Indian Business Podcast, w",
          "publishedAt": "2025-08-31T12:02:13+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/iaFMlGCMEMQ/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=iaFMlGCMEMQ",
          "duration": "PT0S",
          "viewCount": "28071",
          "isLive": false,
          "searchableText": "how to raise funds for your startup ?millionaire investor drops insider secrets | arjun vaidya 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉spotify link: https://open.spotify.com/episode/1duqrgdgonqkuf5s61zrrk?si=5wourso_twkvmgvxwq2skg&nd=1&dlsi=05fd52f1e1fd4a2d 👉by think school: https://thethinkschool.com/ 👉video introduction: in this episode of the indian business podcast, w   think school hindi by zero1",
          "keywords": "",
          "hash": "5224384b"
        }
      ]
    },
    "UCyKj-yaTpbnWZY90ajxB8WQ": {
      "name": "Ditto Insurance",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-09-17T02:39:17.344Z",
      "fetchStatus": "success",
      "fetchDuration": 154,
      "videos": [
        {
          "id": "PZHK9BvOJO0",
          "title": "Star Health Insurance HONEST Review 2025 | Plans Analysis, Performance & Problems | Ditto Insurance",
          "description": "→ Get FREE expert guidance on Health and Term Insurance from Ditto's IRDAI-certified advisors. Book your free consultation here - https://ditto.sh/olf24h Ditto's Cut—How we select plans and insurers: https://joinditto.in/articles/general/dittos-cut/ Star Health didn't become India's largest standalone health insurer by accident. Since 2006, they've built an impressive portfolio covering everything from comprehensive family plans to specialized cancer and cardiac care. With 14,000+ network hospit",
          "publishedAt": "2025-09-15T05:27:47+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/PZHK9BvOJO0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=PZHK9BvOJO0",
          "duration": "PT0S",
          "viewCount": "1133",
          "isLive": false,
          "searchableText": "star health insurance honest review 2025 | plans analysis, performance & problems | ditto insurance → get free expert guidance on health and term insurance from ditto's irdai-certified advisors. book your free consultation here - https://ditto.sh/olf24h ditto's cut—how we select plans and insurers: https://joinditto.in/articles/general/dittos-cut/ star health didn't become india's largest standalone health insurer by accident. since 2006, they've built an impressive portfolio covering everything from comprehensive family plans to specialized cancer and cardiac care. with 14,000+ network hospit   ditto insurance",
          "keywords": "",
          "hash": "faa919c2"
        },
        {
          "id": "1LygrwUr_NQ",
          "title": "Zero GST on Health & Term Life Insurance from 22 September | Nirmala Sitharaman's Big NEWS | Ditto",
          "description": "GST on health and term insurance is now ZERO from September 22, 2025. Get expert clarity on timing, savings, and strategy from Ditto's IRDAI-certified advisors - https://ditto.sh/it224t #gstlatestupdate #gstexplained #healthinsurance #termlifeinsurance At the 56th GST Council Meeting, Finance Minister Nirmala Sitharaman announced that from 22 September 2025, premiums for health and term insurance will be exempt from GST. On the surface, this looks like an instant 18% discount for everyone. But a",
          "publishedAt": "2025-09-12T13:25:56+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/1LygrwUr_NQ/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=1LygrwUr_NQ",
          "duration": "PT0S",
          "viewCount": "5314",
          "isLive": false,
          "searchableText": "zero gst on health & term life insurance from 22 september | nirmala sitharaman's big news | ditto gst on health and term insurance is now zero from september 22, 2025. get expert clarity on timing, savings, and strategy from ditto's irdai-certified advisors - https://ditto.sh/it224t #gstlatestupdate #gstexplained #healthinsurance #termlifeinsurance at the 56th gst council meeting, finance minister nirmala sitharaman announced that from 22 september 2025, premiums for health and term insurance will be exempt from gst. on the surface, this looks like an instant 18% discount for everyone. but a   ditto insurance",
          "keywords": "",
          "hash": "5ab26fd4"
        },
        {
          "id": "bG_mkKOhD7s",
          "title": "This HACK REDUCES Your PREMIUMS | HDFC Ergo Optima Secure vs HDFC Ergo Optima Super Secure REVIEW",
          "description": "Confused about selecting the best health insurance plan? Don't worry, we're here to help! Book a free call with Ditto and let our experts guide you to the right choice — https://ditto.sh/86zmqh Ditto's Cut — How we select plans and insurers: https://joinditto.in/articles/general/dittos-cut/ Watch Ditto's review of HDFC Ergo Optima Secure - https://youtu.be/R4ehMh3z9UA?feature=shared HDFC Ergo's Optima Secure has been praised as one of the standout health insurance plans in the market. But there'",
          "publishedAt": "2025-09-11T14:00:24+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/bG_mkKOhD7s/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=bG_mkKOhD7s",
          "duration": "PT0S",
          "viewCount": "6790",
          "isLive": false,
          "searchableText": "this hack reduces your premiums | hdfc ergo optima secure vs hdfc ergo optima super secure review confused about selecting the best health insurance plan? don't worry, we're here to help! book a free call with ditto and let our experts guide you to the right choice — https://ditto.sh/86zmqh ditto's cut — how we select plans and insurers: https://joinditto.in/articles/general/dittos-cut/ watch ditto's review of hdfc ergo optima secure - https://youtu.be/r4ehmh3z9ua?feature=shared hdfc ergo's optima secure has been praised as one of the standout health insurance plans in the market. but there'   ditto insurance",
          "keywords": "",
          "hash": "b72901f4"
        },
        {
          "id": "teQ_fepgSfw",
          "title": "Care Supreme Health Insurance HONEST REVIEW | Major Changes in 2025 You Must Know | Ditto Insurance",
          "description": "Confused about selecting the best health insurance plan? Don’t worry, we’re here to help! Book a free call with Ditto and let our experts guide you to the right choice - https://ditto.sh/1gghgf Ditto’s Cut- How we select plans and insurers: https://joinditto.in/articles/general/dittos-cut/ Care Health Insurance has been making waves again. After we last reviewed the Care Supreme Health Insurance Plan, the company introduced new add-ons in 2025 that could completely change how this policy is perc",
          "publishedAt": "2025-09-10T05:16:44+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/teQ_fepgSfw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=teQ_fepgSfw",
          "duration": "PT0S",
          "viewCount": "3181",
          "isLive": false,
          "searchableText": "care supreme health insurance honest review | major changes in 2025 you must know | ditto insurance confused about selecting the best health insurance plan? don’t worry, we’re here to help! book a free call with ditto and let our experts guide you to the right choice - https://ditto.sh/1gghgf ditto’s cut- how we select plans and insurers: https://joinditto.in/articles/general/dittos-cut/ care health insurance has been making waves again. after we last reviewed the care supreme health insurance plan, the company introduced new add-ons in 2025 that could completely change how this policy is perc   ditto insurance",
          "keywords": "",
          "hash": "0ab9cab4"
        },
        {
          "id": "U1kNh-rRuXo",
          "title": "Should You Buy Niva Bupa ReAssure 2.0 Health Insurance in 2025? SUPER HONEST Review | Ditto",
          "description": "👉 Need help choosing the right health insurance plan? Talk to Ditto's experts for FREE — https://ditto.sh/ck61r1 Ditto’s Cut — How we select plans and insurers: https://joinditto.in/articles/general/dittos-cut/ Niva Bupa ReAssure 2.0 is redefining health insurance—challenging the usual trade-off between affordability and premium features. In this updated review, we’ll take you through everything you need to know about ReAssure 2.0: insurer track record, eligibility criteria, coverage details, w",
          "publishedAt": "2025-09-09T10:30:18+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/U1kNh-rRuXo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=U1kNh-rRuXo",
          "duration": "PT0S",
          "viewCount": "2159",
          "isLive": false,
          "searchableText": "should you buy niva bupa reassure 2.0 health insurance in 2025? super honest review | ditto 👉 need help choosing the right health insurance plan? talk to ditto's experts for free — https://ditto.sh/ck61r1 ditto’s cut — how we select plans and insurers: https://joinditto.in/articles/general/dittos-cut/ niva bupa reassure 2.0 is redefining health insurance—challenging the usual trade-off between affordability and premium features. in this updated review, we’ll take you through everything you need to know about reassure 2.0: insurer track record, eligibility criteria, coverage details, w   ditto insurance",
          "keywords": "",
          "hash": "164b760e"
        },
        {
          "id": "Anzcokgvamg",
          "title": "HDFC Life Click2Protect Supreme *DETAILED REVIEW* 2025 | Features, Premiums & Full Breakdown | Ditto",
          "description": "Confused about which term insurance plan to choose in 2025? Book a FREE call with Ditto’s expert advisors today — https://ditto.sh/z9v9vg HDFC Life Insurance is one of India’s most trusted names, and their flagship term plan — HDFC Life Click 2 Protect Supreme — is being marketed as one of the most comprehensive offerings in the industry. But is it really worth the higher premiums compared to competitors like ICICI Prudential, Bajaj Allianz, Max Life, and Tata AIA? In this video, we break down H",
          "publishedAt": "2025-08-28T05:20:54+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/Anzcokgvamg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Anzcokgvamg",
          "duration": "PT0S",
          "viewCount": "4397",
          "isLive": false,
          "searchableText": "hdfc life click2protect supreme *detailed review* 2025 | features, premiums & full breakdown | ditto confused about which term insurance plan to choose in 2025? book a free call with ditto’s expert advisors today — https://ditto.sh/z9v9vg hdfc life insurance is one of india’s most trusted names, and their flagship term plan — hdfc life click 2 protect supreme — is being marketed as one of the most comprehensive offerings in the industry. but is it really worth the higher premiums compared to competitors like icici prudential, bajaj allianz, max life, and tata aia? in this video, we break down h   ditto insurance",
          "keywords": "",
          "hash": "f3fbc433"
        }
      ]
    },
    "UCOu85KXcYcEClNAeiKrDA6Q": {
      "name": "Indian Silicon Valley by Jivraj Singh Sachar",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-09-17T02:39:17.751Z",
      "fetchStatus": "success",
      "fetchDuration": 561,
      "videos": [
        {
          "id": "PBeChcYOEgM",
          "title": "From India to Silicon Valley: This $200M ARR Startup is Revolutionizing Healthcare",
          "description": "What does it take to build world-class software from India—then take it to Silicon Valley, penetrate the black box of US healthcare, and scale to $200M ARR? In this episode, we sit down with Abhinav Shashank, Co-founder & CEO of Innovaccer, the company building the Internet of Healthcare. From IIT Kharagpur to the Bay Area, Abhinav’s journey is a masterclass in contrarian conviction: shutting down 90% of his revenue to focus on healthcare, living inside Iowa hospitals to learn customer problems ",
          "publishedAt": "2025-09-12T13:30:33+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/PBeChcYOEgM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=PBeChcYOEgM",
          "duration": "PT0S",
          "viewCount": "449",
          "isLive": false,
          "searchableText": "from india to silicon valley: this $200m arr startup is revolutionizing healthcare what does it take to build world-class software from india—then take it to silicon valley, penetrate the black box of us healthcare, and scale to $200m arr? in this episode, we sit down with abhinav shashank, co-founder & ceo of innovaccer, the company building the internet of healthcare. from iit kharagpur to the bay area, abhinav’s journey is a masterclass in contrarian conviction: shutting down 90% of his revenue to focus on healthcare, living inside iowa hospitals to learn customer problems    indian silicon valley by jivraj singh sachar",
          "keywords": "",
          "hash": "09464257"
        },
        {
          "id": "koz1SuJP-Rg",
          "title": "From Failed Startup to ₹700 Crore Indian Fashion Brand | Libas, Sidhant Keshwani",
          "description": "What does it take to build a ₹700 Cr Indian wear brand without VC money? In this episode of the Indian Silicon Valley Podcast, Jivraj sits down with Sidhant Keshwani, CEO of Libas — the digital-first ethnic wear company redefining fast fashion in India. Starting in 2013, when D2C wasn’t even a term, Siddhant bootstrapped Libas for eight years, scaled profitably in one of India’s toughest markets, and only recently raised growth capital. We unpack how Libas cracked the apparel supply chain, why s",
          "publishedAt": "2025-09-05T14:27:48+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/koz1SuJP-Rg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=koz1SuJP-Rg",
          "duration": "PT0S",
          "viewCount": "2877",
          "isLive": false,
          "searchableText": "from failed startup to ₹700 crore indian fashion brand | libas, sidhant keshwani what does it take to build a ₹700 cr indian wear brand without vc money? in this episode of the indian silicon valley podcast, jivraj sits down with sidhant keshwani, ceo of libas — the digital-first ethnic wear company redefining fast fashion in india. starting in 2013, when d2c wasn’t even a term, siddhant bootstrapped libas for eight years, scaled profitably in one of india’s toughest markets, and only recently raised growth capital. we unpack how libas cracked the apparel supply chain, why s   indian silicon valley by jivraj singh sachar",
          "keywords": "",
          "hash": "0f6102aa"
        },
        {
          "id": "Uv3_WOc8Pw0",
          "title": "How This Startup Is Solving India’s #1 Household Problem",
          "description": "What if getting reliable house help was as easy as ordering food or booking a cab? In this episode, we sit down with Aayush, Founder & CEO of Snabbit, who is building India’s first on-demand house help platform. From solving the age-old absenteeism problem to creating dignity and identity for an entire workforce, Snabbit is tackling a daily frustration in Indian homes and turning it into a massive consumer internet opportunity. We dive into the early days of pamphlets and society WhatsApp groups",
          "publishedAt": "2025-08-30T13:30:34+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/Uv3_WOc8Pw0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Uv3_WOc8Pw0",
          "duration": "PT0S",
          "viewCount": "1586",
          "isLive": false,
          "searchableText": "how this startup is solving india’s #1 household problem what if getting reliable house help was as easy as ordering food or booking a cab? in this episode, we sit down with aayush, founder & ceo of snabbit, who is building india’s first on-demand house help platform. from solving the age-old absenteeism problem to creating dignity and identity for an entire workforce, snabbit is tackling a daily frustration in indian homes and turning it into a massive consumer internet opportunity. we dive into the early days of pamphlets and society whatsapp groups   indian silicon valley by jivraj singh sachar",
          "keywords": "",
          "hash": "030f63be"
        }
      ]
    },
    "UCyUQxtFk3guy3WHaZ-2NNOg": {
      "name": "Anurag Bansal",
      "category": "upskilling",
      "color": "orange",
      "lastFetched": "2025-09-17T02:39:17.902Z",
      "fetchStatus": "success",
      "fetchDuration": 150,
      "videos": [
        {
          "id": "hu4Aokx69jc",
          "title": "Coke's ₹10 Crore Disaster | Cricket's Biggest Sponsorship Fail",
          "description": "In 1996, Coca-Cola paid ₹10 crore to sponsor the Cricket World Cup, buying exclusive rights, stadium monopoly, and the “official” status. It should have been their big win. But by the end of the tournament, everyone was talking about Pepsi instead. Here’s the wild part: Pepsi did not spend a single rupee on sponsorship. Not one. What Pepsi pulled off was so clever and devastating that the ICC had to rewrite its entire rulebook to make sure it never happened again. Some called it genius, some cal",
          "publishedAt": "2025-09-09T13:30:30+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/hu4Aokx69jc/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=hu4Aokx69jc",
          "duration": "PT0S",
          "viewCount": "12004",
          "isLive": false,
          "searchableText": "coke's ₹10 crore disaster | cricket's biggest sponsorship fail in 1996, coca-cola paid ₹10 crore to sponsor the cricket world cup, buying exclusive rights, stadium monopoly, and the “official” status. it should have been their big win. but by the end of the tournament, everyone was talking about pepsi instead. here’s the wild part: pepsi did not spend a single rupee on sponsorship. not one. what pepsi pulled off was so clever and devastating that the icc had to rewrite its entire rulebook to make sure it never happened again. some called it genius, some cal   anurag bansal",
          "keywords": "",
          "hash": "3c236cd4"
        },
        {
          "id": "z3sf_K-Paxw",
          "title": "Why Meta Invested in the World’s Biggest Eyewear Company",
          "description": "Everyone’s been asking: what comes after smartphones? Some said smartwatches. Some said VR headsets. But now, tech giants believe the real answer might be smart glasses. In this video, I break down why Google Glass failed, why Meta’s smart glasses are suddenly catching on, and the genius move Meta made by investing in Luxottica, the eyewear empire that controls Ray-Ban, Oakley, Prada, Versace, Chanel, and thousands of stores worldwide. This isn’t just about tech. It’s about fashion, identity, an",
          "publishedAt": "2025-09-01T11:31:02+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/z3sf_K-Paxw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=z3sf_K-Paxw",
          "duration": "PT0S",
          "viewCount": "7099",
          "isLive": false,
          "searchableText": "why meta invested in the world’s biggest eyewear company everyone’s been asking: what comes after smartphones? some said smartwatches. some said vr headsets. but now, tech giants believe the real answer might be smart glasses. in this video, i break down why google glass failed, why meta’s smart glasses are suddenly catching on, and the genius move meta made by investing in luxottica, the eyewear empire that controls ray-ban, oakley, prada, versace, chanel, and thousands of stores worldwide. this isn’t just about tech. it’s about fashion, identity, an   anurag bansal",
          "keywords": "",
          "hash": "8d78e830"
        }
      ]
    },
    "UCcPI9kEPhyUDLBHGOhKqxOw": {
      "name": "Breakdown",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-09-17T02:39:17.906Z",
      "fetchStatus": "success",
      "fetchDuration": 154,
      "videos": [
        {
          "id": "UbflKWjXRPI",
          "title": "Inside India’s ₹67,000 Cr Cola War 2025",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Coke vs Pepsi vs Campa - we go inside India’s ₹67,000 crore cola war and answer: who’s winning now, and who wins next? From the ₹10 price shock to IPL deals, from kirana distribution to “house of drinks” strategy this is the full story. What you’ll learn 1. Why Coke still holds 60% and Pepsi 27% share 2. How Campa hit ₹1,000 cr sales and spread to 10 lakh outlets with 3,200 distributors 3. The pricing play: ₹10/₹20/₹50 SKU",
          "publishedAt": "2025-09-07T07:39:06+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/UbflKWjXRPI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=UbflKWjXRPI",
          "duration": "PT0S",
          "viewCount": "21434",
          "isLive": false,
          "searchableText": "inside india’s ₹67,000 cr cola war 2025 breakdown is a part of zero1 network - https://zero1byzerodha.com/network coke vs pepsi vs campa - we go inside india’s ₹67,000 crore cola war and answer: who’s winning now, and who wins next? from the ₹10 price shock to ipl deals, from kirana distribution to “house of drinks” strategy this is the full story. what you’ll learn 1. why coke still holds 60% and pepsi 27% share 2. how campa hit ₹1,000 cr sales and spread to 10 lakh outlets with 3,200 distributors 3. the pricing play: ₹10/₹20/₹50 sku   breakdown",
          "keywords": "",
          "hash": "1a96e62a"
        },
        {
          "id": "w-FWIWlYnu8",
          "title": "Asian Paints Under Fire: Birla Opus’ Blitz & The ₹70,000 Cr Shake-Up",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network In this Breakdown, we trace the full history of Indian paints (from lime wash to supercomputers = Modern Paints), decode how Asian Paints built its moat across R&D, marketing, supply chain, and tech, and then break down Birla Opus’ blitzkrieg: dealer incentives, distribution hacks, and the tinting-machine turf war. We also touch on the JSW Paints–Dulux (Akzo) play, Berger’s outperformance, and why the industry just shrank ",
          "publishedAt": "2025-08-25T07:59:45+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/w-FWIWlYnu8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=w-FWIWlYnu8",
          "duration": "PT0S",
          "viewCount": "6497",
          "isLive": false,
          "searchableText": "asian paints under fire: birla opus’ blitz & the ₹70,000 cr shake-up breakdown is a part of zero1 network - https://zero1byzerodha.com/network in this breakdown, we trace the full history of indian paints (from lime wash to supercomputers = modern paints), decode how asian paints built its moat across r&d, marketing, supply chain, and tech, and then break down birla opus’ blitzkrieg: dealer incentives, distribution hacks, and the tinting-machine turf war. we also touch on the jsw paints–dulux (akzo) play, berger’s outperformance, and why the industry just shrank    breakdown",
          "keywords": "",
          "hash": "38ba28f0"
        },
        {
          "id": "XcJKEilzcFo",
          "title": "Is OTT killing India's ₹12,000 crore Cinema Industry?",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Report PDF Link - https://www.ormaxmedia.com/insights/stories/the-ormax-box-office-2024-report.html 0:00 - lntro 1:42 - Zerodha shoutout 1:55 - History of Indian cinema 6:15 - The present of Indian cinema 9:32 - PVR’s financial report 12:38 - OTT’s impact on cinema industry 13:42 - The future of Indian cinema 17:42 - Conclusion",
          "publishedAt": "2025-08-14T12:30:40+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/XcJKEilzcFo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=XcJKEilzcFo",
          "duration": "PT0S",
          "viewCount": "8553",
          "isLive": false,
          "searchableText": "is ott killing india's ₹12,000 crore cinema industry? breakdown is a part of zero1 network - https://zero1byzerodha.com/network report pdf link - https://www.ormaxmedia.com/insights/stories/the-ormax-box-office-2024-report.html 0:00 - lntro 1:42 - zerodha shoutout 1:55 - history of indian cinema 6:15 - the present of indian cinema 9:32 - pvr’s financial report 12:38 - ott’s impact on cinema industry 13:42 - the future of indian cinema 17:42 - conclusion   breakdown",
          "keywords": "",
          "hash": "670f8fd2"
        },
        {
          "id": "_PC2KVfn2zA",
          "title": "What’s Next for India’s ₹40,000 Crore Quick Commerce Industry",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Source Link - Source tweet: 1. https://x.com/vaibhavbetter/status/1839308292616606068 2. TD’s blog – https://www.linkedin.com/pulse/why-we-invested-myra-potent-synthesis-technology-operations-davda/?lipi=urn%3Ali%3Apage%3Ad_flagship3_detail_base%3BwoMYzx5OQcC%2Br67W1oNUGQ%3D%3D 3. Link to discussion: https://www.linkedin.com/posts/rahul-jaideep-mathur_startups-india-activity-7290593137113128960-_uYX 4. Source: https://econ",
          "publishedAt": "2025-08-04T09:22:36+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/_PC2KVfn2zA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=_PC2KVfn2zA",
          "duration": "PT0S",
          "viewCount": "13650",
          "isLive": false,
          "searchableText": "what’s next for india’s ₹40,000 crore quick commerce industry breakdown is a part of zero1 network - https://zero1byzerodha.com/network source link - source tweet: 1. https://x.com/vaibhavbetter/status/1839308292616606068 2. td’s blog – https://www.linkedin.com/pulse/why-we-invested-myra-potent-synthesis-technology-operations-davda/?lipi=urn%3ali%3apage%3ad_flagship3_detail_base%3bwomyzx5oqcc%2br67w1onugq%3d%3d 3. link to discussion: https://www.linkedin.com/posts/rahul-jaideep-mathur_startups-india-activity-7290593137113128960-_uyx 4. source: https://econ   breakdown",
          "keywords": "",
          "hash": "b1d366ee"
        },
        {
          "id": "hv3GKosCnn4",
          "title": "How VCs make billions - explained by a VC",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Report PDF Link - https://docsend.com/view/dhsmcxgdtjweytjr In this video, we dive deep into the world of venture capital, uncovering the high-stakes bets that turned ordinary investments into billions! From David Sheridan's game-changing investment in Google to Accel Partners' stunning $1 million bet on Flipkart, venture capital has a fascinating history of creating tech giants. What is venture capital, and how did it evo",
          "publishedAt": "2025-07-27T07:30:19+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/hv3GKosCnn4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=hv3GKosCnn4",
          "duration": "PT0S",
          "viewCount": "19437",
          "isLive": false,
          "searchableText": "how vcs make billions - explained by a vc breakdown is a part of zero1 network - https://zero1byzerodha.com/network report pdf link - https://docsend.com/view/dhsmcxgdtjweytjr in this video, we dive deep into the world of venture capital, uncovering the high-stakes bets that turned ordinary investments into billions! from david sheridan's game-changing investment in google to accel partners' stunning $1 million bet on flipkart, venture capital has a fascinating history of creating tech giants. what is venture capital, and how did it evo   breakdown",
          "keywords": "",
          "hash": "1053b6b1"
        },
        {
          "id": "m6AH8KrQlHk",
          "title": "How India’s Top Creators Are Really Making Money",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report PDF Link - https://web-assets.bcg.com/c8/35/2a008ddf4e049d99a901b17233f0/gift-report.pdf India has over 25 lakh digital content creators. But guess what? Fewer than 3 lakh of them are actually making money. In this deep dive, we uncover the harsh truth behind India’s struggling creator economy — why monetization is broken, why the industry is stuck in a loop, and how creators can break free by thinking li",
          "publishedAt": "2025-07-19T08:53:31+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/m6AH8KrQlHk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=m6AH8KrQlHk",
          "duration": "PT0S",
          "viewCount": "31497",
          "isLive": false,
          "searchableText": "how india’s top creators are really making money breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report pdf link - https://web-assets.bcg.com/c8/35/2a008ddf4e049d99a901b17233f0/gift-report.pdf india has over 25 lakh digital content creators. but guess what? fewer than 3 lakh of them are actually making money. in this deep dive, we uncover the harsh truth behind india’s struggling creator economy — why monetization is broken, why the industry is stuck in a loop, and how creators can break free by thinking li   breakdown",
          "keywords": "",
          "hash": "00438a0d"
        },
        {
          "id": "98N46iJnPMM",
          "title": "The Story Of Lab Grown Diamonds",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report Link - The Future of the Natural Diamond Industry - https://web-assets.bcg.com/87/88/44ce24b646969ef49aa5a9c4b8b6/bcg-the-future-of-the-natural-diamond-industry-may.pdf In this week's Breakdown, we explore the fascinating history of diamonds — from their origins in ancient India to the marketing masterstroke by De Beers that made \"A diamond is forever\" a global truth. We also unpack the rise of lab-grown ",
          "publishedAt": "2025-07-07T12:30:12+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/98N46iJnPMM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=98N46iJnPMM",
          "duration": "PT0S",
          "viewCount": "8246",
          "isLive": false,
          "searchableText": "the story of lab grown diamonds breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report link - the future of the natural diamond industry - https://web-assets.bcg.com/87/88/44ce24b646969ef49aa5a9c4b8b6/bcg-the-future-of-the-natural-diamond-industry-may.pdf in this week's breakdown, we explore the fascinating history of diamonds — from their origins in ancient india to the marketing masterstroke by de beers that made \"a diamond is forever\" a global truth. we also unpack the rise of lab-grown    breakdown",
          "keywords": "",
          "hash": "8b044b85"
        },
        {
          "id": "EtI5rxlIW4c",
          "title": "Is Quick Commerce Killing Your Local Kirana Store? | Breakdown",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report Link - QC vs Kirana - https://www.pwc.in/assets/pdfs/retail-reinvention-paradigm-v1.pdf You've probably noticed it—fewer people walking into local kirana shops, more ordering from apps. But is quick commerce really to blame? In this Breakdown, we go beyond the headlines. We dive into fresh data from PWC and Kirana Club, and uncover what’s actually happening on the ground. 0:00 Introduction 1:25 Zerodha Sh",
          "publishedAt": "2025-06-29T07:30:10+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/EtI5rxlIW4c/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=EtI5rxlIW4c",
          "duration": "PT0S",
          "viewCount": "21469",
          "isLive": false,
          "searchableText": "is quick commerce killing your local kirana store? | breakdown breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report link - qc vs kirana - https://www.pwc.in/assets/pdfs/retail-reinvention-paradigm-v1.pdf you've probably noticed it—fewer people walking into local kirana shops, more ordering from apps. but is quick commerce really to blame? in this breakdown, we go beyond the headlines. we dive into fresh data from pwc and kirana club, and uncover what’s actually happening on the ground. 0:00 introduction 1:25 zerodha sh   breakdown",
          "keywords": "",
          "hash": "4f8b79fe"
        },
        {
          "id": "MPfarENJWVA",
          "title": "How India Spends: Consumer Habits and Trends | Breakdown",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report Link - How India Spends - https://marketing.perfios.com/how-india-spends-report/ What does the average Indian consumer spend their money on? How does income level influence choices in groceries, medical, entertainment, and even online gaming? This comprehensive report uncovers the latest trends in Indian consumer behaviour, providing invaluable insights for financial institutions, businesses, and policyma",
          "publishedAt": "2025-06-21T08:43:52+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/MPfarENJWVA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=MPfarENJWVA",
          "duration": "PT0S",
          "viewCount": "23693",
          "isLive": false,
          "searchableText": "how india spends: consumer habits and trends | breakdown breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report link - how india spends - https://marketing.perfios.com/how-india-spends-report/ what does the average indian consumer spend their money on? how does income level influence choices in groceries, medical, entertainment, and even online gaming? this comprehensive report uncovers the latest trends in indian consumer behaviour, providing invaluable insights for financial institutions, businesses, and policyma   breakdown",
          "keywords": "",
          "hash": "371f694b"
        },
        {
          "id": "bU42CJtqay8",
          "title": "How Coldplay changed INDIA FOREVER | Breakdown",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report URL: https://www.ey.com/en_in/insights/media-entertainment/india-s-rising-concert-economy-a-new-era-of-live-entertainment India’s concert economy just hit a massive turning point, and Coldplay’s historic Ahmedabad concert is at the heart of it. Drawing in over 222,000 attendees, generating an astonishing ₹641 crore in economic impact, and redefining Ahmedabad as India’s newest cultural hotspot—this was no",
          "publishedAt": "2025-06-14T07:58:55+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/bU42CJtqay8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=bU42CJtqay8",
          "duration": "PT0S",
          "viewCount": "22918",
          "isLive": false,
          "searchableText": "how coldplay changed india forever | breakdown breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report url: https://www.ey.com/en_in/insights/media-entertainment/india-s-rising-concert-economy-a-new-era-of-live-entertainment india’s concert economy just hit a massive turning point, and coldplay’s historic ahmedabad concert is at the heart of it. drawing in over 222,000 attendees, generating an astonishing ₹641 crore in economic impact, and redefining ahmedabad as india’s newest cultural hotspot—this was no   breakdown",
          "keywords": "",
          "hash": "dde289e3"
        },
        {
          "id": "u5-UMgNZs6k",
          "title": "How to Build Serious Wealth in India: The Untold Secrets to Success in 2025",
          "description": "https://docsend.com/view/5cacg5jgvd6cktz3 Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Want to make money in India? Discover the game-changing opportunities and strategies that successful entrepreneurs used to build empires. From India's digital revolution to the next big unlocks shaping the future, this video unveils the secrets to tapping into the fastest-growing economy in the world. Learn how to ride the wave of India's emerging tech, capital, and entr",
          "publishedAt": "2025-06-07T07:30:25+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/u5-UMgNZs6k/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=u5-UMgNZs6k",
          "duration": "PT0S",
          "viewCount": "93593",
          "isLive": false,
          "searchableText": "how to build serious wealth in india: the untold secrets to success in 2025 https://docsend.com/view/5cacg5jgvd6cktz3 breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network want to make money in india? discover the game-changing opportunities and strategies that successful entrepreneurs used to build empires. from india's digital revolution to the next big unlocks shaping the future, this video unveils the secrets to tapping into the fastest-growing economy in the world. learn how to ride the wave of india's emerging tech, capital, and entr   breakdown",
          "keywords": "",
          "hash": "00cb981a"
        },
        {
          "id": "dmn8XdxkPIE",
          "title": "10 Mind-Blowing Insights from Zerodha's 2024 Capital Markets Report",
          "description": "https://zerodha.com/z-connect/business-updates/introducing-the-2024-capital-markets-yearbook Explore the transformation of India's capital markets in this comprehensive 2024 report by Zerodha x IndianDataHub. From booming equity markets and record-breaking IPOs to regulatory shake-ups and the rise of finfluencers, discover what shaped investments in India this year—and what to expect next! Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network 0:00 Introduction - In",
          "publishedAt": "2025-05-30T15:48:51+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/dmn8XdxkPIE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=dmn8XdxkPIE",
          "duration": "PT0S",
          "viewCount": "39486",
          "isLive": false,
          "searchableText": "10 mind-blowing insights from zerodha's 2024 capital markets report https://zerodha.com/z-connect/business-updates/introducing-the-2024-capital-markets-yearbook explore the transformation of india's capital markets in this comprehensive 2024 report by zerodha x indiandatahub. from booming equity markets and record-breaking ipos to regulatory shake-ups and the rise of finfluencers, discover what shaped investments in india this year—and what to expect next! breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network 0:00 introduction - in   breakdown",
          "keywords": "",
          "hash": "08b23b9f"
        }
      ]
    },
    "UCM7yoOhnMcfrEZ-5i9m-WFA": {
      "name": "Sonia Shenoy",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-09-17T02:39:17.843Z",
      "fetchStatus": "success",
      "fetchDuration": 90,
      "videos": [
        {
          "id": "omvUflegajw",
          "title": "How to Think Like a Successful Investor | The Money Mindset ft. Maneesh Dangi",
          "description": "In this episode of The Money Mindset, we are joined by Maneesh Dangi, a deep thinker and student of the stock markets for the last 25 years. He is the CEO and Founder of Mosaic Asset Management and previously served as the Chief Investment Officer of Aditya Birla Sun Life MF for 15 years. With over two decades of experience in investing and research, including more than 15 years in the asset management industry, Dangi has an extensive track record in managing portfolios. He is also the author of",
          "publishedAt": "2025-09-11T14:00:37+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/omvUflegajw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=omvUflegajw",
          "duration": "PT0S",
          "viewCount": "133847",
          "isLive": false,
          "searchableText": "how to think like a successful investor | the money mindset ft. maneesh dangi in this episode of the money mindset, we are joined by maneesh dangi, a deep thinker and student of the stock markets for the last 25 years. he is the ceo and founder of mosaic asset management and previously served as the chief investment officer of aditya birla sun life mf for 15 years. with over two decades of experience in investing and research, including more than 15 years in the asset management industry, dangi has an extensive track record in managing portfolios. he is also the author of   sonia shenoy",
          "keywords": "",
          "hash": "2a667be4"
        },
        {
          "id": "incHU-LCk7Y",
          "title": "Neelkanth Mishra on India’s Economic Pulse: Markets, Strategy & Stability | The Money Mindset",
          "description": "In this episode of The Money Mindset, we have Neelkanth Mishra, a well known personality in the world of economics He is the chief economist at Axis bank and member of the prime ministers economic advisory council Neelkanth has over 25 years of experience in tracking macro economics Prior to Axis bank, Neelkanth was the managing director of Credit Suisse for 20 years where he was head of research and head of Indian equity strategy he is a graduate from IIT Kanpur and on this episode , we broke d",
          "publishedAt": "2025-09-05T12:31:03+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/incHU-LCk7Y/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=incHU-LCk7Y",
          "duration": "PT0S",
          "viewCount": "85188",
          "isLive": false,
          "searchableText": "neelkanth mishra on india’s economic pulse: markets, strategy & stability | the money mindset in this episode of the money mindset, we have neelkanth mishra, a well known personality in the world of economics he is the chief economist at axis bank and member of the prime ministers economic advisory council neelkanth has over 25 years of experience in tracking macro economics prior to axis bank, neelkanth was the managing director of credit suisse for 20 years where he was head of research and head of indian equity strategy he is a graduate from iit kanpur and on this episode , we broke d   sonia shenoy",
          "keywords": "",
          "hash": "4b86719c"
        },
        {
          "id": "gR6z3bqySFw",
          "title": "Inside India’s Startup Playbook with Archana Jahagirdar | Money Mindset With Sonia Shenoy",
          "description": "In this episode of Money Mindset, we sit down with Archana Jahagirdar, the founder of Rukam Capital. Rukam Capital is an early stage Venture capital firm that invests in consumer tech start ups in India The company has invested in names like Sleepy owl, Swami , Pilgrim, Yoho etc. Recently , they announced Rukam Sitara which is a 100cr tech focussed fund, to support the tech eco system in India! On this episode we spoke about the start up eco system ,the landscape currently and what the playbook ",
          "publishedAt": "2025-08-26T15:38:32+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/gR6z3bqySFw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=gR6z3bqySFw",
          "duration": "PT0S",
          "viewCount": "11314",
          "isLive": false,
          "searchableText": "inside india’s startup playbook with archana jahagirdar | money mindset with sonia shenoy in this episode of money mindset, we sit down with archana jahagirdar, the founder of rukam capital. rukam capital is an early stage venture capital firm that invests in consumer tech start ups in india the company has invested in names like sleepy owl, swami , pilgrim, yoho etc. recently , they announced rukam sitara which is a 100cr tech focussed fund, to support the tech eco system in india! on this episode we spoke about the start up eco system ,the landscape currently and what the playbook    sonia shenoy",
          "keywords": "",
          "hash": "5611b1bb"
        },
        {
          "id": "s1t9_jeuV1Q",
          "title": "Pankaj Tibrewal on Wealth Creation & Market Insights | Money Mindset with Sonia Shenoy",
          "description": "In this episode of Money Mindset, we sit down with Pankaj Tibrewal of Ikigai Asset Managers Pankaj Tibrewal is the founder and CIO of Ikigai asset managers He is one of India's best known midcap fund managers and someone with over 2 decades of investing experience Before founding IKIGAI, Pankaj was the senior executive vice president and fund manager at Kotak Mahindra AMC where he was managing almost 7 billion $. Pankaj is known in the industry as someone with an astute stock picking ability. 00",
          "publishedAt": "2025-08-20T09:30:25+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/s1t9_jeuV1Q/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=s1t9_jeuV1Q",
          "duration": "PT0S",
          "viewCount": "120343",
          "isLive": false,
          "searchableText": "pankaj tibrewal on wealth creation & market insights | money mindset with sonia shenoy in this episode of money mindset, we sit down with pankaj tibrewal of ikigai asset managers pankaj tibrewal is the founder and cio of ikigai asset managers he is one of india's best known midcap fund managers and someone with over 2 decades of investing experience before founding ikigai, pankaj was the senior executive vice president and fund manager at kotak mahindra amc where he was managing almost 7 billion $. pankaj is known in the industry as someone with an astute stock picking ability. 00   sonia shenoy",
          "keywords": "",
          "hash": "91d1c809"
        }
      ]
    },
    "UCxX-O7rPl35IajrJnAdzIyw": {
      "name": "The Other Side with Dilip",
      "category": "health",
      "color": "green",
      "lastFetched": "2025-09-17T02:39:18.460Z",
      "fetchStatus": "success",
      "fetchDuration": 139,
      "videos": []
    },
    "UCMfazW6hC3eaWTW2q0ibhyQ": {
      "name": "Pranay Kapoor",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-09-17T02:39:18.478Z",
      "fetchStatus": "success",
      "fetchDuration": 156,
      "videos": [
        {
          "id": "3jMU7Xz-raA",
          "title": "HSBC Premier vs Infinia | HSBC Travel 1 vs Axis Atlas ",
          "description": "Join us at the Credit Card Workshop, limited slots - sign up now! https://academy.pranaykapoor.com/l/9a847ce4ca Today we discuss HSBC. They recently announced their rewards marketplace a few weeks ago. That has resulted in accelerated returns specially on Flights and Hotels. With HSBC Premier, Travel One and Visa Platinum, what are we doing and what should you do? How should you think about these cards now? We do a freewheeling conversation on what are we doing with HSBC cards. 0:00 Highlights 1",
          "publishedAt": "2025-09-12T14:55:21+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/3jMU7Xz-raA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=3jMU7Xz-raA",
          "duration": "PT0S",
          "viewCount": "26237",
          "isLive": false,
          "searchableText": "hsbc premier vs infinia | hsbc travel 1 vs axis atlas  join us at the credit card workshop, limited slots - sign up now! https://academy.pranaykapoor.com/l/9a847ce4ca today we discuss hsbc. they recently announced their rewards marketplace a few weeks ago. that has resulted in accelerated returns specially on flights and hotels. with hsbc premier, travel one and visa platinum, what are we doing and what should you do? how should you think about these cards now? we do a freewheeling conversation on what are we doing with hsbc cards. 0:00 highlights 1   pranay kapoor",
          "keywords": "",
          "hash": "bb5519e3"
        },
        {
          "id": "b7LSTzFXjAE",
          "title": "Investing in the US markets from India | Tax Season Special ",
          "description": "Go set up time with The Financialist now! https://tinyurl.com/yem8veza Your $5 bonus is waiting! 🎁 Sign up to Vested and make your first deposit to claim your reward. Invest in Apple, Microsoft, Nvidia and 10,000+ US Stocks and ETFs. Join me now: https://refer.vestedfinance.com/PRKA68487 Thinking of investing in US stocks and international markets from India? This video is your complete guide to global investing for Indians. In today's video we cover - ✅ Comparison among brokers (Vested, INDmon",
          "publishedAt": "2025-08-29T13:10:08+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/b7LSTzFXjAE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=b7LSTzFXjAE",
          "duration": "PT0S",
          "viewCount": "15934",
          "isLive": false,
          "searchableText": "investing in the us markets from india | tax season special  go set up time with the financialist now! https://tinyurl.com/yem8veza your $5 bonus is waiting! 🎁 sign up to vested and make your first deposit to claim your reward. invest in apple, microsoft, nvidia and 10,000+ us stocks and etfs. join me now: https://refer.vestedfinance.com/prka68487 thinking of investing in us stocks and international markets from india? this video is your complete guide to global investing for indians. in today's video we cover - ✅ comparison among brokers (vested, indmon   pranay kapoor",
          "keywords": "",
          "hash": "77678c28"
        }
      ]
    },
    "UCs0Awb1WCz0dNsq8zhfYl1A": {
      "name": "Vishal Bhargava",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-09-17T02:39:18.405Z",
      "fetchStatus": "success",
      "fetchDuration": 83,
      "videos": [
        {
          "id": "AeyampGNOm8",
          "title": "Bacardi: The Tata's of Cuba",
          "description": "The Bacardi Building in Havana isn’t just Cuba’s most iconic skyscraper—it’s the story of a family, a revolution, and a billion-dollar brand that refused to die. From a 16-year-old immigrant working in a distillery to creating the world’s most famous rum, Bacardi’s journey is filled with innovation, politics, betrayal, and even CIA plots. This video uncovers: How Bacardi transformed Cuban rum into a global sensation 🍹 Why Fidel Castro seized the company overnight 🇨🇺 The secret move that saved",
          "publishedAt": "2025-09-07T10:23:58+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/AeyampGNOm8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=AeyampGNOm8",
          "duration": "PT0S",
          "viewCount": "936",
          "isLive": false,
          "searchableText": "bacardi: the tata's of cuba the bacardi building in havana isn’t just cuba’s most iconic skyscraper—it’s the story of a family, a revolution, and a billion-dollar brand that refused to die. from a 16-year-old immigrant working in a distillery to creating the world’s most famous rum, bacardi’s journey is filled with innovation, politics, betrayal, and even cia plots. this video uncovers: how bacardi transformed cuban rum into a global sensation 🍹 why fidel castro seized the company overnight 🇨🇺 the secret move that saved   vishal bhargava",
          "keywords": "",
          "hash": "087dcaec"
        },
        {
          "id": "bweYgPUkdvg",
          "title": "India’s Hidden Real Estate Scam : Subvention Scheme",
          "description": "In this video, we uncover the hidden truth behind one of the most deceptive real estate scams in India—the subvention scheme. This \"no EMI till possession\" plan was marketed as a lifeline for homebuyers but turned out to be a trap. Builders and banks exploited the system, inflating property prices and leaving buyers with inflated loans they never anticipated. Despite being banned, this scam’s impact continues to haunt the real estate market. We break down how it worked, the financial consequence",
          "publishedAt": "2025-09-01T14:41:15+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/bweYgPUkdvg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=bweYgPUkdvg",
          "duration": "PT0S",
          "viewCount": "65777",
          "isLive": false,
          "searchableText": "india’s hidden real estate scam : subvention scheme in this video, we uncover the hidden truth behind one of the most deceptive real estate scams in india—the subvention scheme. this \"no emi till possession\" plan was marketed as a lifeline for homebuyers but turned out to be a trap. builders and banks exploited the system, inflating property prices and leaving buyers with inflated loans they never anticipated. despite being banned, this scam’s impact continues to haunt the real estate market. we break down how it worked, the financial consequence   vishal bhargava",
          "keywords": "",
          "hash": "545e168b"
        },
        {
          "id": "jqd5zDP78dY",
          "title": "Mumbai’s Biggest Home Today was Built by the Founder of Pakistan",
          "description": "Did you know the biggest private home in Mumbai today isn’t the one built by Ambani… but by Muhammad Ali Jinnah, the founder of Pakistan? This forgotten mansion in Malabar Hill has seen it all — from Jinnah’s marriage and political rise to meetings with Gandhi, to becoming one of the most controversial properties in India–Pakistan history. 🇮🇳 Today, the bungalow is owned by the Government of India. 🇵🇰 But Pakistan has claimed it back for decades. The question is: Should India hold on to it, ",
          "publishedAt": "2025-08-22T13:33:49+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/jqd5zDP78dY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=jqd5zDP78dY",
          "duration": "PT0S",
          "viewCount": "4372",
          "isLive": false,
          "searchableText": "mumbai’s biggest home today was built by the founder of pakistan did you know the biggest private home in mumbai today isn’t the one built by ambani… but by muhammad ali jinnah, the founder of pakistan? this forgotten mansion in malabar hill has seen it all — from jinnah’s marriage and political rise to meetings with gandhi, to becoming one of the most controversial properties in india–pakistan history. 🇮🇳 today, the bungalow is owned by the government of india. 🇵🇰 but pakistan has claimed it back for decades. the question is: should india hold on to it,    vishal bhargava",
          "keywords": "",
          "hash": "ff4cbba0"
        }
      ]
    },
    "UC1MHVwwWd9l46ZeRM7qm_AA": {
      "name": "Tirthak Saha",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-09-17T02:39:18.450Z",
      "fetchStatus": "success",
      "fetchDuration": 128,
      "videos": [
        {
          "id": "a7FL8RDh5Mo",
          "title": "Why 21 Women Were Fed Radioactive Food in Secret",
          "description": "In the late 1960s, in the English city of Coventry, a shocking and little-known medical experiment targeted Indian immigrant women with radioactive rotis, disguised as a free health program for anemia. What sounds like a conspiracy theory was, in fact, a government-approved study run by the UK’s Medical Research Council, where 21 Women were unknowingly fed Radioactive Food in the name of science. This documentary unpacks the horrifying story of the Coventry Experiment, exposing how colonial mind",
          "publishedAt": "2025-09-13T07:35:32+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/a7FL8RDh5Mo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=a7FL8RDh5Mo",
          "duration": "PT0S",
          "viewCount": "4428",
          "isLive": false,
          "searchableText": "why 21 women were fed radioactive food in secret in the late 1960s, in the english city of coventry, a shocking and little-known medical experiment targeted indian immigrant women with radioactive rotis, disguised as a free health program for anemia. what sounds like a conspiracy theory was, in fact, a government-approved study run by the uk’s medical research council, where 21 women were unknowingly fed radioactive food in the name of science. this documentary unpacks the horrifying story of the coventry experiment, exposing how colonial mind   tirthak saha",
          "keywords": "",
          "hash": "25bd2ac4"
        },
        {
          "id": "7rtzUgmk_PM",
          "title": "The First Celebrity Chef Was Indian (And You’ve Never Heard Of Him)",
          "description": "Long before Gordon Ramsay or Julia Child, the world’s very first celebrity chef was an Indian man you’ve probably never heard of—Ranji Smile. Born in British India in the late 1800s, Ranji cooked his way from colonial kitchens to New York’s high society, dazzling America with exotic flavors, royal costumes, and scandalous charm. But behind the fame was a story of lies, ambition, immigration struggles, and cultural clash. In this video, we uncover the unbelievable rise and fall of the chef who pu",
          "publishedAt": "2025-08-03T10:16:15+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/7rtzUgmk_PM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=7rtzUgmk_PM",
          "duration": "PT0S",
          "viewCount": "15265",
          "isLive": false,
          "searchableText": "the first celebrity chef was indian (and you’ve never heard of him) long before gordon ramsay or julia child, the world’s very first celebrity chef was an indian man you’ve probably never heard of—ranji smile. born in british india in the late 1800s, ranji cooked his way from colonial kitchens to new york’s high society, dazzling america with exotic flavors, royal costumes, and scandalous charm. but behind the fame was a story of lies, ambition, immigration struggles, and cultural clash. in this video, we uncover the unbelievable rise and fall of the chef who pu   tirthak saha",
          "keywords": "",
          "hash": "9ed62d2a"
        },
        {
          "id": "D9n_299dd14",
          "title": "How an American Cult Influenced an Indian Tech Company",
          "description": "The story of a mysterious hidden connection between two companies that, on the surface, have nothing to do with each other. One was born in the 1800s as an American Cult and the other as an iconic Indian Electronics company born in the late 1900s. This is Episode 1 of \"Under The Radar\" - a series that aims to uncover little-known stories from India that reveal unexpected global connections, showcasing how Indian and South Asian history, culture, and innovation have shaped our world in ways most ",
          "publishedAt": "2025-07-20T12:54:09+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/D9n_299dd14/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=D9n_299dd14",
          "duration": "PT0S",
          "viewCount": "62689",
          "isLive": false,
          "searchableText": "how an american cult influenced an indian tech company the story of a mysterious hidden connection between two companies that, on the surface, have nothing to do with each other. one was born in the 1800s as an american cult and the other as an iconic indian electronics company born in the late 1900s. this is episode 1 of \"under the radar\" - a series that aims to uncover little-known stories from india that reveal unexpected global connections, showcasing how indian and south asian history, culture, and innovation have shaped our world in ways most    tirthak saha",
          "keywords": "",
          "hash": "99da86a6"
        },
        {
          "id": "CkwBpVH3bXQ",
          "title": "Uncovering India's Hidden Stories",
          "description": "This is an introduction to \"Under The Radar\" - a series that aims to uncover little-known stories from India that reveal unexpected global connections, showcasing how South Asian history, culture, and innovation have shaped our world in ways most people never realized. India’s impact on the world is far bigger, stranger, and more fascinating than the few recycled stories we usually hear. From the world’s first celebrity chef being an Indian in the early 1900s America, to an American cult inspiri",
          "publishedAt": "2025-07-16T12:50:13+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/CkwBpVH3bXQ/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=CkwBpVH3bXQ",
          "duration": "PT0S",
          "viewCount": "21629",
          "isLive": false,
          "searchableText": "uncovering india's hidden stories this is an introduction to \"under the radar\" - a series that aims to uncover little-known stories from india that reveal unexpected global connections, showcasing how south asian history, culture, and innovation have shaped our world in ways most people never realized. india’s impact on the world is far bigger, stranger, and more fascinating than the few recycled stories we usually hear. from the world’s first celebrity chef being an indian in the early 1900s america, to an american cult inspiri   tirthak saha",
          "keywords": "",
          "hash": "4bd5cde6"
        },
        {
          "id": "EHQGNjO3tvg",
          "title": "The True Story Of How Sherlock Holmes Saved An Indian Man's Life",
          "description": "In 1903, a quaint village in England named Great Wyrley became the epicenter of an International thriller. When a series of shocking animal killings rocked the community, George Edalji - the son of an Indian immigrant - found himself wrongfully accused with little evidence. Determined to clear his name, George turned to the mastermind behind the \"world's best detective\" - Sir Arthur Conan Doyle. What unfolded next is a gripping true crime saga, bursting with the intrigue and suspense that would ",
          "publishedAt": "2023-05-27T11:04:25+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/EHQGNjO3tvg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=EHQGNjO3tvg",
          "duration": "PT0S",
          "viewCount": "13930",
          "isLive": false,
          "searchableText": "the true story of how sherlock holmes saved an indian man's life in 1903, a quaint village in england named great wyrley became the epicenter of an international thriller. when a series of shocking animal killings rocked the community, george edalji - the son of an indian immigrant - found himself wrongfully accused with little evidence. determined to clear his name, george turned to the mastermind behind the \"world's best detective\" - sir arthur conan doyle. what unfolded next is a gripping true crime saga, bursting with the intrigue and suspense that would    tirthak saha",
          "keywords": "",
          "hash": "8664f468"
        }
      ]
    },
    "UCFdZETZpeX3G7Pe3zan2fHA": {
      "name": "Vyre by Angad Kahai Singh",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-09-17T02:39:18.445Z",
      "fetchStatus": "success",
      "fetchDuration": 123,
      "videos": [
        {
          "id": "2AqUSUNUgKo",
          "title": "Dear Indians, iPhone is Fooling YOU!",
          "description": "In this video, I delve into the growing trend of iPhone obsession in India, particularly among middle and lower-income groups. Despite financial limitations, many people are purchasing iPhones as a status symbol, without realizing that Apple's secret strategy is to lure them into its broader product ecosystem. I also explore the mindset behind why so many Indians are drawn to iPhones. Stick around until the end to learn why the iPhone may actually be a liability and how Apple’s marketing tactics",
          "publishedAt": "2025-09-13T11:00:01+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/2AqUSUNUgKo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=2AqUSUNUgKo",
          "duration": "PT0S",
          "viewCount": "28897",
          "isLive": false,
          "searchableText": "dear indians, iphone is fooling you! in this video, i delve into the growing trend of iphone obsession in india, particularly among middle and lower-income groups. despite financial limitations, many people are purchasing iphones as a status symbol, without realizing that apple's secret strategy is to lure them into its broader product ecosystem. i also explore the mindset behind why so many indians are drawn to iphones. stick around until the end to learn why the iphone may actually be a liability and how apple’s marketing tactics   vyre by angad kahai singh",
          "keywords": "",
          "hash": "074b630f"
        },
        {
          "id": "TaAx1RDz-G8",
          "title": "The Dark Reality of Indian Students Abroad!",
          "description": "In this video, I talk about the harsh reality many Indian students face after moving abroad for higher education. Recent reports reveal that a growing number of Indian students in countries like the USA, UK, and Canada are struggling with serious financial and social challenges. While highlighting flaws in the Indian education system, I also shed light on the unfavorable immigration policies and limited job opportunities abroad that add to their difficulties. Key factors like return on investmen",
          "publishedAt": "2025-09-05T15:35:59+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/TaAx1RDz-G8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=TaAx1RDz-G8",
          "duration": "PT0S",
          "viewCount": "20006",
          "isLive": false,
          "searchableText": "the dark reality of indian students abroad! in this video, i talk about the harsh reality many indian students face after moving abroad for higher education. recent reports reveal that a growing number of indian students in countries like the usa, uk, and canada are struggling with serious financial and social challenges. while highlighting flaws in the indian education system, i also shed light on the unfavorable immigration policies and limited job opportunities abroad that add to their difficulties. key factors like return on investmen   vyre by angad kahai singh",
          "keywords": "",
          "hash": "7db1fe5f"
        },
        {
          "id": "T31CGjYh9Xs",
          "title": "Why Do People Online Hate Indians?",
          "description": "In this video, I dive into the global online image of Indians , a topic that has sparked criticism, trolling, and widespread mockery on the internet. I explore how certain behaviors, attitudes, and lifestyle choices of Indians, when compared to those in developed countries, may contribute to this negative perception. We’ll take a closer look at the kind of content Indian creators and influencers share, and how this shapes India’s digital reputation. I’ve broken down the key factors behind the on",
          "publishedAt": "2025-08-31T15:21:25+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/T31CGjYh9Xs/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=T31CGjYh9Xs",
          "duration": "PT0S",
          "viewCount": "33069",
          "isLive": false,
          "searchableText": "why do people online hate indians? in this video, i dive into the global online image of indians , a topic that has sparked criticism, trolling, and widespread mockery on the internet. i explore how certain behaviors, attitudes, and lifestyle choices of indians, when compared to those in developed countries, may contribute to this negative perception. we’ll take a closer look at the kind of content indian creators and influencers share, and how this shapes india’s digital reputation. i’ve broken down the key factors behind the on   vyre by angad kahai singh",
          "keywords": "",
          "hash": "3cc5a409"
        },
        {
          "id": "I0u_SdNWK98",
          "title": "How Indian Street food is Slowly killing you?",
          "description": "In this video, I discuss the issues surrounding Indian street food. While it's incredibly popular across the country due to its affordability and quick service, there are several major concerns, particularly related to hygiene, sanitation, the quality of ingredients, and how customers are treated. Make sure to watch till the end to understand why these problems persist despite the street food’s popularity, and what steps can be taken to improve overall safety and service. If you found this video",
          "publishedAt": "2025-08-27T14:49:10+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/I0u_SdNWK98/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=I0u_SdNWK98",
          "duration": "PT0S",
          "viewCount": "64144",
          "isLive": false,
          "searchableText": "how indian street food is slowly killing you? in this video, i discuss the issues surrounding indian street food. while it's incredibly popular across the country due to its affordability and quick service, there are several major concerns, particularly related to hygiene, sanitation, the quality of ingredients, and how customers are treated. make sure to watch till the end to understand why these problems persist despite the street food’s popularity, and what steps can be taken to improve overall safety and service. if you found this video   vyre by angad kahai singh",
          "keywords": "",
          "hash": "376da546"
        },
        {
          "id": "qKWxdRme_EU",
          "title": "They KILLED Your Favourite Cartoons!",
          "description": "Remember when cartoons actually felt magical? Shows like Doraemon, Naruto, Pokémon, and Tom & Jerry weren’t just entertainment — they were a part of our childhood. But somewhere along the way, cartoons started feeling… cheaper, rushed, and made more for selling merch than telling stories. In this video, we dive into what changed in cartoons over the years — from animation styles and storytelling to how streaming platforms and big studios reshaped the entire industry. Why do today’s cartoons feel",
          "publishedAt": "2025-08-21T10:11:48+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/qKWxdRme_EU/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=qKWxdRme_EU",
          "duration": "PT0S",
          "viewCount": "7214",
          "isLive": false,
          "searchableText": "they killed your favourite cartoons! remember when cartoons actually felt magical? shows like doraemon, naruto, pokémon, and tom & jerry weren’t just entertainment — they were a part of our childhood. but somewhere along the way, cartoons started feeling… cheaper, rushed, and made more for selling merch than telling stories. in this video, we dive into what changed in cartoons over the years — from animation styles and storytelling to how streaming platforms and big studios reshaped the entire industry. why do today’s cartoons feel   vyre by angad kahai singh",
          "keywords": "",
          "hash": "f8c2dcba"
        },
        {
          "id": "_Jbdv3hFsRo",
          "title": "Is This the End for Zepto?",
          "description": "Zepto is one of India's fastest-growing quick-commerce start-ups but recently, things have taken a turn for the worse. Riders are unhappy, customers are unhappy, products are expired and the math isn't mathing! We take a closer look at the company’s current situation and try to understand what went wrong and if Zepto can make a comeback or lose its relevance in India. Follow us on Instagram: Vyre: https://www.instagram.com/vyre.media Angad Kahai Singh: https://www.instagram.com/vyre.media Discor",
          "publishedAt": "2025-08-19T14:27:14+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/_Jbdv3hFsRo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=_Jbdv3hFsRo",
          "duration": "PT0S",
          "viewCount": "8537",
          "isLive": false,
          "searchableText": "is this the end for zepto? zepto is one of india's fastest-growing quick-commerce start-ups but recently, things have taken a turn for the worse. riders are unhappy, customers are unhappy, products are expired and the math isn't mathing! we take a closer look at the company’s current situation and try to understand what went wrong and if zepto can make a comeback or lose its relevance in india. follow us on instagram: vyre: https://www.instagram.com/vyre.media angad kahai singh: https://www.instagram.com/vyre.media discor   vyre by angad kahai singh",
          "keywords": "",
          "hash": "70e0f916"
        },
        {
          "id": "Tv0hwLSMry0",
          "title": "How Indians Are Killing the Movie Theatre Industry!",
          "description": "Bollywood’s magic on the big screen is fading — but why? From overpriced tickets and poor content quality to the rise of OTT platforms, here’s what’s killing your love for movie theatres. We dive deep into why Indian audiences are skipping cinema halls and what it means for the future of Bollywood. 00:00 - Intro 3:47 - Chapter 1 8:28 - Chapter 2 12:59 - Chapter 3 Follow us on Instagram: Vyre: https://www.instagram.com/vyre.media Angad Kahai Singh: https://www.instagram.com/vyre.media Discord - h",
          "publishedAt": "2025-08-15T16:14:53+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/Tv0hwLSMry0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Tv0hwLSMry0",
          "duration": "PT0S",
          "viewCount": "32784",
          "isLive": false,
          "searchableText": "how indians are killing the movie theatre industry! bollywood’s magic on the big screen is fading — but why? from overpriced tickets and poor content quality to the rise of ott platforms, here’s what’s killing your love for movie theatres. we dive deep into why indian audiences are skipping cinema halls and what it means for the future of bollywood. 00:00 - intro 3:47 - chapter 1 8:28 - chapter 2 12:59 - chapter 3 follow us on instagram: vyre: https://www.instagram.com/vyre.media angad kahai singh: https://www.instagram.com/vyre.media discord - h   vyre by angad kahai singh",
          "keywords": "",
          "hash": "91f3baa7"
        },
        {
          "id": "6qDcTfCF-GI",
          "title": "These Apps Are Secretly Making You Broke! (You Use Them Daily)",
          "description": "These Apps Keep You POOR! (And You Don’t Even Realise It) We all use them. Zomato, Blinkit, Amazon, Swiggy, Myntra… But what if the apps designed to make life easier are actually making us broke? In this video, we break down the sneaky ways your favorite apps are draining your wallet — from impulse triggers to invisible fees, from dopamine-driven designs to subscription traps. You’ll finally understand why your salary disappears by the 20th of every month. Follow us on Instagram: Vyre: https://w",
          "publishedAt": "2025-08-05T14:34:06+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/6qDcTfCF-GI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=6qDcTfCF-GI",
          "duration": "PT0S",
          "viewCount": "5937",
          "isLive": false,
          "searchableText": "these apps are secretly making you broke! (you use them daily) these apps keep you poor! (and you don’t even realise it) we all use them. zomato, blinkit, amazon, swiggy, myntra… but what if the apps designed to make life easier are actually making us broke? in this video, we break down the sneaky ways your favorite apps are draining your wallet — from impulse triggers to invisible fees, from dopamine-driven designs to subscription traps. you’ll finally understand why your salary disappears by the 20th of every month. follow us on instagram: vyre: https://w   vyre by angad kahai singh",
          "keywords": "",
          "hash": "d70ef42d"
        }
      ]
    },
    "UCtFCIACJgZK5cGVqWYWhGgg": {
      "name": "Americonomics by Akash Bhat",
      "category": "upskilling",
      "color": "orange",
      "lastFetched": "2025-09-17T02:39:18.877Z",
      "fetchStatus": "success",
      "fetchDuration": 399,
      "videos": [
        {
          "id": "zHt37wPo-xY",
          "title": "The Biggest Mistake NRIs Make With Emergency Funds!",
          "description": "Most people think an emergency fund is just 6 months of expenses in a savings account. But if you’re living abroad, earning in one currency and supporting family in another, the real question is: should your safety net be in dollars or rupees? In this video, we break down the biggest mistake NRIs make with their emergency funds and how to fix it. From job loss and medical bills to a sudden move back home, you’ll learn the 60-40 split strategy that protects you in both countries. Don’t wait until",
          "publishedAt": "2025-09-11T17:43:55+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/zHt37wPo-xY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=zHt37wPo-xY",
          "duration": "PT0S",
          "viewCount": "206",
          "isLive": false,
          "searchableText": "the biggest mistake nris make with emergency funds! most people think an emergency fund is just 6 months of expenses in a savings account. but if you’re living abroad, earning in one currency and supporting family in another, the real question is: should your safety net be in dollars or rupees? in this video, we break down the biggest mistake nris make with their emergency funds and how to fix it. from job loss and medical bills to a sudden move back home, you’ll learn the 60-40 split strategy that protects you in both countries. don’t wait until   americonomics by akash bhat",
          "keywords": "",
          "hash": "1da46454"
        },
        {
          "id": "yFy2x7f3LTw",
          "title": "Don’t Move to America Before Watching This",
          "description": "Are you an NRI in the US unknowingly losing $15,000–$25,000 each year in taxes? You’re not alone. Most Indian Americans fall into avoidable traps—like paying double tax on rental income, mishandling NRE/NRO accounts, ignoring tax treaties, or investing in Indian mutual funds treated as PFICs by the IRS. In this video, I break down the 4 biggest tax mistakes NRIs make and the smart strategies to fix them: getting a Tax Residency Certificate, optimizing accounts, timing residency, and structuring ",
          "publishedAt": "2025-09-02T15:24:08+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/yFy2x7f3LTw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=yFy2x7f3LTw",
          "duration": "PT0S",
          "viewCount": "118",
          "isLive": false,
          "searchableText": "don’t move to america before watching this are you an nri in the us unknowingly losing $15,000–$25,000 each year in taxes? you’re not alone. most indian americans fall into avoidable traps—like paying double tax on rental income, mishandling nre/nro accounts, ignoring tax treaties, or investing in indian mutual funds treated as pfics by the irs. in this video, i break down the 4 biggest tax mistakes nris make and the smart strategies to fix them: getting a tax residency certificate, optimizing accounts, timing residency, and structuring    americonomics by akash bhat",
          "keywords": "",
          "hash": "65c73771"
        },
        {
          "id": "DeEqgUlhP78",
          "title": "Ultimate Financial Guide for NRIs to RETIRE RICH in India",
          "description": "What if every paycheck you earn in the US could multiply your wealth back in India? 🇮🇳💵 In this episode of Americonomics, we break down exactly how NRIs can invest smartly in India using NRE and NRO accounts. From real estate in Bangalore, Mumbai, and Delhi to the Indian stock market, mutual funds, and even startups, we show you the smartest ways to make your US salary work in India. India received $125B in remittances last year – yet most of it went into bills, not wealth creation. Don’t let",
          "publishedAt": "2025-08-22T16:49:28+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/DeEqgUlhP78/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=DeEqgUlhP78",
          "duration": "PT0S",
          "viewCount": "861",
          "isLive": false,
          "searchableText": "ultimate financial guide for nris to retire rich in india what if every paycheck you earn in the us could multiply your wealth back in india? 🇮🇳💵 in this episode of americonomics, we break down exactly how nris can invest smartly in india using nre and nro accounts. from real estate in bangalore, mumbai, and delhi to the indian stock market, mutual funds, and even startups, we show you the smartest ways to make your us salary work in india. india received $125b in remittances last year – yet most of it went into bills, not wealth creation. don’t let   americonomics by akash bhat",
          "keywords": "",
          "hash": "792ddaac"
        },
        {
          "id": "zHr1tgoclHk",
          "title": "Indian Engineers in America Are Doing THIS With Their Money",
          "description": "What exactly is a trust fund — and why are so many tech employees, startup founders, and immigrants on visas setting them up? In this episode of Americonomics, we demystify trust funds and show how you can use them to protect your startup equity, minimize taxes, and plan generational wealth — even if you're not a billionaire. Whether you're on an H-1B visa or just closed your Series A, this guide explains how to legally move assets like RSUs and private shares into trusts, avoid estate taxes, an",
          "publishedAt": "2025-07-31T15:49:51+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/zHr1tgoclHk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=zHr1tgoclHk",
          "duration": "PT0S",
          "viewCount": "402",
          "isLive": false,
          "searchableText": "indian engineers in america are doing this with their money what exactly is a trust fund — and why are so many tech employees, startup founders, and immigrants on visas setting them up? in this episode of americonomics, we demystify trust funds and show how you can use them to protect your startup equity, minimize taxes, and plan generational wealth — even if you're not a billionaire. whether you're on an h-1b visa or just closed your series a, this guide explains how to legally move assets like rsus and private shares into trusts, avoid estate taxes, an   americonomics by akash bhat",
          "keywords": "",
          "hash": "342835b7"
        },
        {
          "id": "fNVQnl08_EM",
          "title": "This Money Trap will Keep You Broke as an NRI!",
          "description": "Even founders of ₹800 crore ($100M) startups can struggle with basic needs – like paying rent or buying a home. Surprising? It’s the harsh reality of what’s known as the “secondary trap.” This trap kicks in when founders try to sell a small portion of their shares for personal cash – but find themselves blocked by investor-imposed restrictions: board approvals, transfer limitations, and ROFR (Right of First Refusal). Their equity may look impressive on paper, but in reality, it's often just lock",
          "publishedAt": "2025-07-19T15:27:08+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/fNVQnl08_EM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=fNVQnl08_EM",
          "duration": "PT0S",
          "viewCount": "984",
          "isLive": false,
          "searchableText": "this money trap will keep you broke as an nri! even founders of ₹800 crore ($100m) startups can struggle with basic needs – like paying rent or buying a home. surprising? it’s the harsh reality of what’s known as the “secondary trap.” this trap kicks in when founders try to sell a small portion of their shares for personal cash – but find themselves blocked by investor-imposed restrictions: board approvals, transfer limitations, and rofr (right of first refusal). their equity may look impressive on paper, but in reality, it's often just lock   americonomics by akash bhat",
          "keywords": "",
          "hash": "aaea510d"
        },
        {
          "id": "EBqMzBLGWdY",
          "title": "The #1 Wealth Trap No One Talks About… (NRI Startup Equity)",
          "description": "Startup equity can be tempting, but before you get too excited, it's important to understand the harsh realities that come with it. In this video, we dive deep into the complexities of startup equity, showing you how things like liquidation preferences, multiple funding rounds, and dilution can drastically change your payout. From the promise of a life-changing payout to the disappointing reality of walking away with little to nothing, we break down real-world scenarios that could happen to you.",
          "publishedAt": "2025-07-10T15:49:59+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/EBqMzBLGWdY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=EBqMzBLGWdY",
          "duration": "PT0S",
          "viewCount": "356",
          "isLive": false,
          "searchableText": "the #1 wealth trap no one talks about… (nri startup equity) startup equity can be tempting, but before you get too excited, it's important to understand the harsh realities that come with it. in this video, we dive deep into the complexities of startup equity, showing you how things like liquidation preferences, multiple funding rounds, and dilution can drastically change your payout. from the promise of a life-changing payout to the disappointing reality of walking away with little to nothing, we break down real-world scenarios that could happen to you.   americonomics by akash bhat",
          "keywords": "",
          "hash": "3f5d3cb7"
        },
        {
          "id": "ZRESj9A2wN0",
          "title": "6 Strategies to Make $1M as a Venture Capitalist (From a Former VC!)",
          "description": "I sent 137 cold emails to VCs and got zero responses. Most people will never get a job in venture capital. Not because they’re not smart enough. But because they’re following advice from people who were born inside the \"system\". I wasn’t. I went from being an outsider to writing checks to founders now building billion-dollar startups – and broke into one of the most exclusive clubs in the world. You can too. In this video, I’ll break down the real ways people get into VC today – and why the trad",
          "publishedAt": "2025-07-03T15:31:07+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/ZRESj9A2wN0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=ZRESj9A2wN0",
          "duration": "PT0S",
          "viewCount": "632",
          "isLive": false,
          "searchableText": "6 strategies to make $1m as a venture capitalist (from a former vc!) i sent 137 cold emails to vcs and got zero responses. most people will never get a job in venture capital. not because they’re not smart enough. but because they’re following advice from people who were born inside the \"system\". i wasn’t. i went from being an outsider to writing checks to founders now building billion-dollar startups – and broke into one of the most exclusive clubs in the world. you can too. in this video, i’ll break down the real ways people get into vc today – and why the trad   americonomics by akash bhat",
          "keywords": "",
          "hash": "58addd6f"
        },
        {
          "id": "wuNIk9Xr7sI",
          "title": "How NRIs Can Start A Business on F1/H1B Visa",
          "description": "Can you start a business on an F1 student visa or H1B visa in the US? The short answer is yes, but it comes with challenges. In this video, I share my journey of building a successful startup while navigating the H1B visa restrictions. I’ll walk you through the exact process to start your own company on an F1 or H1B visa, including the legal frameworks and work restrictions. Whether you’re an NRI, Indian entrepreneur, or someone considering NRI investments, this guide provides strategies to help",
          "publishedAt": "2025-06-26T15:28:43+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/wuNIk9Xr7sI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=wuNIk9Xr7sI",
          "duration": "PT0S",
          "viewCount": "1052",
          "isLive": false,
          "searchableText": "how nris can start a business on f1/h1b visa can you start a business on an f1 student visa or h1b visa in the us? the short answer is yes, but it comes with challenges. in this video, i share my journey of building a successful startup while navigating the h1b visa restrictions. i’ll walk you through the exact process to start your own company on an f1 or h1b visa, including the legal frameworks and work restrictions. whether you’re an nri, indian entrepreneur, or someone considering nri investments, this guide provides strategies to help   americonomics by akash bhat",
          "keywords": "",
          "hash": "1d73609e"
        }
      ]
    },
    "UCM1vynzlNMa4r5MxwiEO6ag": {
      "name": "NRI Diaries by Nupur Dave",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-09-17T02:39:18.882Z",
      "fetchStatus": "success",
      "fetchDuration": 404,
      "videos": [
        {
          "id": "LOhiT5rHF8k",
          "title": "Can a Hospital Bill Really Cost $250,000?",
          "description": "Planning a trip abroad? Before you pack your bags, there's ONE thing that could save you from financial disaster - visitor insurance. In this video, we break down everything you need to know about protecting yourself while traveling. This video is sponsored by visitors coverage— visit them via https://visitorscoverageinc.pxf.io/BnaP3y CHAPTERS: 00:00 The Midnight Medical Emergency 00:26 The High Cost of Medical Care for Travelers 00:47 The Importance of Travel Insurance 01:31 Understanding Premi",
          "publishedAt": "2025-09-10T13:47:49+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/LOhiT5rHF8k/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=LOhiT5rHF8k",
          "duration": "PT0S",
          "viewCount": "239",
          "isLive": false,
          "searchableText": "can a hospital bill really cost $250,000? planning a trip abroad? before you pack your bags, there's one thing that could save you from financial disaster - visitor insurance. in this video, we break down everything you need to know about protecting yourself while traveling. this video is sponsored by visitors coverage— visit them via https://visitorscoverageinc.pxf.io/bnap3y chapters: 00:00 the midnight medical emergency 00:26 the high cost of medical care for travelers 00:47 the importance of travel insurance 01:31 understanding premi   nri diaries by nupur dave",
          "keywords": "",
          "hash": "d2d11d4b"
        },
        {
          "id": "m5rBMqCUba4",
          "title": "Why I left Google and MOVED BACK to India",
          "description": "After 10 incredible years at Google's HQ, I made a life-altering decision: to leave it all behind and move to Bangalore, India. This video is not just about a change of address, but a deep dive into the 'why' behind this unexpected move. From chasing a new purpose to embracing a different pace of life, I'm sharing my unfiltered journey and the lessons I've learned along the way. Video is sponsored by ODOO-- check out their free tools here! https://www.odoo.com/r/e2K If you're curious about the f",
          "publishedAt": "2025-09-02T13:14:19+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/m5rBMqCUba4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=m5rBMqCUba4",
          "duration": "PT0S",
          "viewCount": "6602",
          "isLive": false,
          "searchableText": "why i left google and moved back to india after 10 incredible years at google's hq, i made a life-altering decision: to leave it all behind and move to bangalore, india. this video is not just about a change of address, but a deep dive into the 'why' behind this unexpected move. from chasing a new purpose to embracing a different pace of life, i'm sharing my unfiltered journey and the lessons i've learned along the way. video is sponsored by odoo-- check out their free tools here! https://www.odoo.com/r/e2k if you're curious about the f   nri diaries by nupur dave",
          "keywords": "",
          "hash": "fa19573c"
        }
      ]
    },
    "UC19ruvzi32BWrWFpek4p3hA": {
      "name": "Been There, Done That",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-09-17T02:39:17.924Z",
      "fetchStatus": "success",
      "fetchDuration": 171,
      "videos": [
        {
          "id": "W4QYnEFLW3A",
          "title": "How a 76-Year-Young Ex-Army Colonel Built India’s Most Joyful Senior Living",
          "description": "At 76, Colonel Achal insists he’s only 14 years young. An Indian Army veteran who traded his boots for blueprints, he’s now pioneering a whole new way of aging in India. In this episode of Been There, Done That, Rajneil sits down with the Colonel to unpack his incredible journey — from joining the Army at 16, to serving through some of India’s most challenging years, to building senior living communities that are nothing like the “old age homes” we once imagined. 💡 What you’ll hear in this epis",
          "publishedAt": "2025-09-10T13:30:27+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/W4QYnEFLW3A/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=W4QYnEFLW3A",
          "duration": "PT0S",
          "viewCount": "132",
          "isLive": false,
          "searchableText": "how a 76-year-young ex-army colonel built india’s most joyful senior living at 76, colonel achal insists he’s only 14 years young. an indian army veteran who traded his boots for blueprints, he’s now pioneering a whole new way of aging in india. in this episode of been there, done that, rajneil sits down with the colonel to unpack his incredible journey — from joining the army at 16, to serving through some of india’s most challenging years, to building senior living communities that are nothing like the “old age homes” we once imagined. 💡 what you’ll hear in this epis   been there, done that",
          "keywords": "",
          "hash": "a8658121"
        },
        {
          "id": "JAYJwoRLfMY",
          "title": "The Delhi Metro Voice Rini Simon Khanna on Trust, Family, and Finding Happiness at 60+",
          "description": "She’s the voice that guided millions of metro commuters across India. But beyond the announcements, Rini Simon Khanna has lived a life full of lessons on trust, family, independence, and happiness. In this episode of Been There Done That, host Rajni Kamath continues his conversation with Rini — this time diving deeper into her personal journey. From witnessing the erosion of trust in news, to raising her son with freedom, to caring for her fiercely independent father at 87, Rini opens up about w",
          "publishedAt": "2025-08-30T13:00:39+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/JAYJwoRLfMY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=JAYJwoRLfMY",
          "duration": "PT0S",
          "viewCount": "275",
          "isLive": false,
          "searchableText": "the delhi metro voice rini simon khanna on trust, family, and finding happiness at 60+ she’s the voice that guided millions of metro commuters across india. but beyond the announcements, rini simon khanna has lived a life full of lessons on trust, family, independence, and happiness. in this episode of been there done that, host rajni kamath continues his conversation with rini — this time diving deeper into her personal journey. from witnessing the erosion of trust in news, to raising her son with freedom, to caring for her fiercely independent father at 87, rini opens up about w   been there, done that",
          "keywords": "",
          "hash": "d839e433"
        }
      ]
    },
    "UCv0ZVHNQmQF1M681j6kK-Hw": {
      "name": "gen.E",
      "category": "sustainability",
      "color": "teal",
      "lastFetched": "2025-09-17T02:39:17.913Z",
      "fetchStatus": "success",
      "fetchDuration": 159,
      "videos": []
    },
    "UCbMzIZqxM7pf8GuyaJDP0Vg": {
      "name": "The Plate India",
      "category": "sustainability",
      "color": "teal",
      "lastFetched": "2025-09-17T02:39:18.321Z",
      "fetchStatus": "success",
      "fetchDuration": 397,
      "videos": [
        {
          "id": "JC8o5Ztx2pE",
          "title": "Andhra Pradesh wants to become a 100% Natural Farming state | Good idea or crazy?",
          "description": "Andhra Pradesh is turning itself into the world's largest agriculture laboratory. The state government wants all of its 60 lakh farmers and 60 lakh hectares of farmland to turn to natural farming by 2035--zero synthetic chemicals or fertilizers. Is it feasible, or even a scientifically sensibly idea? While it seems noble, can a system of farming that relies just on cow dung, urine, jaggery and similar ingredients as chemical replacements, end up lowering our food production and endanger food sec",
          "publishedAt": "2025-08-20T14:00:29+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/JC8o5Ztx2pE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=JC8o5Ztx2pE",
          "duration": "PT0S",
          "viewCount": "106719",
          "isLive": false,
          "searchableText": "andhra pradesh wants to become a 100% natural farming state | good idea or crazy? andhra pradesh is turning itself into the world's largest agriculture laboratory. the state government wants all of its 60 lakh farmers and 60 lakh hectares of farmland to turn to natural farming by 2035--zero synthetic chemicals or fertilizers. is it feasible, or even a scientifically sensibly idea? while it seems noble, can a system of farming that relies just on cow dung, urine, jaggery and similar ingredients as chemical replacements, end up lowering our food production and endanger food sec   the plate india",
          "keywords": "",
          "hash": "97b490b2"
        },
        {
          "id": "2S7iSj4O59I",
          "title": "The Chai Story | How tea became India's national drink",
          "description": "Chai is the drink that fuels India today. But just over a century ago, hardly anyone in India knew about tea, forget drinking it. So how did India go from ignorance and indifference to becoming one of the largest producers and consumers of tea in the world? Hint: It was the result of one of the greatest marketing campaigns the world has ever seen! We help you understand India from farm to plate. Visit https://ThePlate.in for more The Plate on Instagram: https://Instagram.com/theplateindia The Pl",
          "publishedAt": "2025-08-13T01:30:04+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/2S7iSj4O59I/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=2S7iSj4O59I",
          "duration": "PT0S",
          "viewCount": "6460",
          "isLive": false,
          "searchableText": "the chai story | how tea became india's national drink chai is the drink that fuels india today. but just over a century ago, hardly anyone in india knew about tea, forget drinking it. so how did india go from ignorance and indifference to becoming one of the largest producers and consumers of tea in the world? hint: it was the result of one of the greatest marketing campaigns the world has ever seen! we help you understand india from farm to plate. visit https://theplate.in for more the plate on instagram: https://instagram.com/theplateindia the pl   the plate india",
          "keywords": "",
          "hash": "7dd65eea"
        },
        {
          "id": "iMqGYgboKr8",
          "title": "How a young Punjab woman farmer revived forgotten wheat | And created a pan-India business",
          "description": "Anushka Neyol is a young seventh generation farmer from India's wheat basket of Punjab. Anushka decided to marry her education in business management and economics with her passion for farming, launching a farm business that grows and sells nearly 20 different varieties of heirloom wheats that we've forgotten. Listen to her life story of accidentally turning a wheat nerd and the journey as a self-taught farmpreneur. Contents of video --- 0:00 Intro 1:40 Finding a farm idea 3:30 Black wheat 4:38 ",
          "publishedAt": "2025-07-08T02:30:37+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/iMqGYgboKr8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=iMqGYgboKr8",
          "duration": "PT0S",
          "viewCount": "1148",
          "isLive": false,
          "searchableText": "how a young punjab woman farmer revived forgotten wheat | and created a pan-india business anushka neyol is a young seventh generation farmer from india's wheat basket of punjab. anushka decided to marry her education in business management and economics with her passion for farming, launching a farm business that grows and sells nearly 20 different varieties of heirloom wheats that we've forgotten. listen to her life story of accidentally turning a wheat nerd and the journey as a self-taught farmpreneur. contents of video --- 0:00 intro 1:40 finding a farm idea 3:30 black wheat 4:38    the plate india",
          "keywords": "",
          "hash": "306105c3"
        },
        {
          "id": "10jiqwZmELY",
          "title": "India’s High-Value Export Behind Luxury Perfumes | From Madurai to Paris",
          "description": "In the world of luxury perfumes, jasmine and rose are the king and queen—no floral fragrance is complete without them. And some 100,000 farmers in a tiny area around Madurai produce the world’s best jasmine that powers scents by Dior, Guerlain or Tom Ford. It takes more than 1,000 kilos of these tiny milky-white flowers to make just one kilo of jasmine oil—an oil that sells for nearly ₹4 lakh. The jasmine sambac or Madurai jasmine is considered a symbol of love, beauty and purity. In this video ",
          "publishedAt": "2025-05-29T13:30:03+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/10jiqwZmELY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=10jiqwZmELY",
          "duration": "PT0S",
          "viewCount": "145992",
          "isLive": false,
          "searchableText": "india’s high-value export behind luxury perfumes | from madurai to paris in the world of luxury perfumes, jasmine and rose are the king and queen—no floral fragrance is complete without them. and some 100,000 farmers in a tiny area around madurai produce the world’s best jasmine that powers scents by dior, guerlain or tom ford. it takes more than 1,000 kilos of these tiny milky-white flowers to make just one kilo of jasmine oil—an oil that sells for nearly ₹4 lakh. the jasmine sambac or madurai jasmine is considered a symbol of love, beauty and purity. in this video    the plate india",
          "keywords": "",
          "hash": "71507b6c"
        }
      ]
    }
  },
  "metadata": {
    "totalVideos": 94,
    "totalChannels": 22,
    "successfulChannels": 22,
    "lastSuccessfulFetch": "2025-09-17T02:39:18.883Z",
    "fetchDuration": 2390
  }
}