{
  "lastUpdated": "2025-11-07T02:53:26.778Z",
  "channels": {
    "UCXmAKxh_qFL5703W9VPgpnA": {
      "name": "Food Pharmer",
      "category": "health",
      "color": "green",
      "lastFetched": "2025-11-07T02:53:25.757Z",
      "fetchStatus": "success",
      "fetchDuration": 403,
      "videos": [
        {
          "id": "7MMQ1pDTBoY",
          "title": "I Tested India's Top Water Brands. Results are SHOCKING!",
          "description": "Get Quillbot Today: https://shorturl.at/kCUv2 Ever wondered if all bottled waters taste the same? I tested some of India’s most popular bottled water brands. From Bisleri all the way to Evian to see how they compare in TDS (Total Dissolved Solids) and taste. What we found might surprise you: •⁠ ⁠Which brand has the cleanest-tasting water? •⁠ ⁠Which one has the highest or lowest TDS? •⁠ ⁠And does expensive always mean better? Let's Make India Healthy Again! @Zero1byZerodha financially supports cr",
          "publishedAt": "2025-10-31T14:02:33+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/7MMQ1pDTBoY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=7MMQ1pDTBoY",
          "duration": "PT0S",
          "viewCount": "581326",
          "isLive": false,
          "searchableText": "i tested india's top water brands. results are shocking! get quillbot today: https://shorturl.at/kcuv2 ever wondered if all bottled waters taste the same? i tested some of india’s most popular bottled water brands. from bisleri all the way to evian to see how they compare in tds (total dissolved solids) and taste. what we found might surprise you: •⁠ ⁠which brand has the cleanest-tasting water? •⁠ ⁠which one has the highest or lowest tds? •⁠ ⁠and does expensive always mean better? let's make india healthy again! @zero1byzerodha financially supports cr   food pharmer",
          "keywords": "",
          "hash": "c16db0e8"
        },
        {
          "id": "ckRLy-TtZ2k",
          "title": "Best Ever Weight Loss Guide and Diet Plan for Indians | India's Top Fitness Expert Ep. 18",
          "description": "In this episode of Rethink India, we sit down with @Fittrjc, founder of @FITTRwithSquats, one of India’s largest preventive healthcare companies, who explains us to focus on exercise and nutrition to elongate our health span. We break it down into three simple yet powerful sections: Basics — Exercise, Nutrition, Hydration & Sleep. Boosters — Health Checkups, Supplements & Health Devices. Band-Aid — Medicines and their role in long-term health. JC explains how most people start their journey chas",
          "publishedAt": "2025-10-29T13:20:52+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/ckRLy-TtZ2k/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=ckRLy-TtZ2k",
          "duration": "PT0S",
          "viewCount": "80344",
          "isLive": false,
          "searchableText": "best ever weight loss guide and diet plan for indians | india's top fitness expert ep. 18 in this episode of rethink india, we sit down with @fittrjc, founder of @fittrwithsquats, one of india’s largest preventive healthcare companies, who explains us to focus on exercise and nutrition to elongate our health span. we break it down into three simple yet powerful sections: basics — exercise, nutrition, hydration & sleep. boosters — health checkups, supplements & health devices. band-aid — medicines and their role in long-term health. jc explains how most people start their journey chas   food pharmer",
          "keywords": "",
          "hash": "a328e328"
        },
        {
          "id": "n_bCJyeYI4g",
          "title": "September Revenue REVEALED | Office Tour | Major Price Reduction | September Monthly Board Meeting",
          "description": "Order Link https://onlywhatsneeded.in/product/whey-protein-2?utm_source=social&utm_medium=yt&utm_campaign=yt-long New Channel https://www.youtube.com/@OnlyWhatsNeededOfficial Welcome to the September Board Meeting of Only What’s Needed! This month was special we recorded 50% growth, moved into our first office, and launched the OWNer’s Circle referral program for social impact. Highlights: 0:00 – Intro 0:35– GST Update 1:09– Referral Program Launch 1:53– New Office Tour 2:59– September Revenue G",
          "publishedAt": "2025-10-12T10:18:26+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/n_bCJyeYI4g/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=n_bCJyeYI4g",
          "duration": "PT0S",
          "viewCount": "131971",
          "isLive": false,
          "searchableText": "september revenue revealed | office tour | major price reduction | september monthly board meeting order link https://onlywhatsneeded.in/product/whey-protein-2?utm_source=social&utm_medium=yt&utm_campaign=yt-long new channel https://www.youtube.com/@onlywhatsneededofficial welcome to the september board meeting of only what’s needed! this month was special we recorded 50% growth, moved into our first office, and launched the owner’s circle referral program for social impact. highlights: 0:00 – intro 0:35– gst update 1:09– referral program launch 1:53– new office tour 2:59– september revenue g   food pharmer",
          "keywords": "",
          "hash": "cbb8b37b"
        },
        {
          "id": "zJu117xcs9Y",
          "title": "I Lab Tested All Paneer Brands. Results Are SHOCKING!",
          "description": "Lab Reports PDF Link: https://drive.google.com/drive/folders/1sL6QIWqLqcGS7wMpgPz63_N-DoU0ZKY0?usp=drive_link One of my most important videos yet! I tested India’s biggest brands, local dairies, and street stalls, to check the authenticity of paneer. Results were shocking! This video is episode 1 of my new series Pharmer Investigates, an on ground series where we expose scams using hidden cameras, expert help, and hard lab data. I spent my savings to run these tests because truth should never be",
          "publishedAt": "2025-10-07T11:09:25+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/zJu117xcs9Y/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=zJu117xcs9Y",
          "duration": "PT0S",
          "viewCount": "2389955",
          "isLive": false,
          "searchableText": "i lab tested all paneer brands. results are shocking! lab reports pdf link: https://drive.google.com/drive/folders/1sl6qiwqlqcgs7wmpgpz63_n-dou0zky0?usp=drive_link one of my most important videos yet! i tested india’s biggest brands, local dairies, and street stalls, to check the authenticity of paneer. results were shocking! this video is episode 1 of my new series pharmer investigates, an on ground series where we expose scams using hidden cameras, expert help, and hard lab data. i spent my savings to run these tests because truth should never be   food pharmer",
          "keywords": "",
          "hash": "7fd3bbeb"
        },
        {
          "id": "lPP7E6u-h2M",
          "title": "India’s Leading Knee Doctor on Arthritis, Exercises, Shoes, Knee Replacement, & ACL | Dr. Daral Ep17",
          "description": "In this episode of Rethink India, we sit down with Dr. Mayank Daral, one of India’s leading knee and sports injury surgeons, to break down everything you need to know about joint health. From the rising burden of osteoarthritis to why women are more prone to joint pain, @drmayankdaral explains the science in a way everyone can understand. We also dive deep into practical, everyday questions: - How do you choose the perfect shoes to protect your knees? - What exactly is an ACL injury and why is i",
          "publishedAt": "2025-09-27T09:57:57+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/lPP7E6u-h2M/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=lPP7E6u-h2M",
          "duration": "PT0S",
          "viewCount": "176923",
          "isLive": false,
          "searchableText": "india’s leading knee doctor on arthritis, exercises, shoes, knee replacement, & acl | dr. daral ep17 in this episode of rethink india, we sit down with dr. mayank daral, one of india’s leading knee and sports injury surgeons, to break down everything you need to know about joint health. from the rising burden of osteoarthritis to why women are more prone to joint pain, @drmayankdaral explains the science in a way everyone can understand. we also dive deep into practical, everyday questions: - how do you choose the perfect shoes to protect your knees? - what exactly is an acl injury and why is i   food pharmer",
          "keywords": "",
          "hash": "ee71ae62"
        }
      ]
    },
    "UCZknyXD-6tETm9aN8GQCi8g": {
      "name": "The Cutting Edge School",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-11-07T02:53:25.735Z",
      "fetchStatus": "success",
      "fetchDuration": 331,
      "videos": []
    },
    "UCggPd3Vf9ooG2r4I_ZNWBzA": {
      "name": "Wint Wealth",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-11-07T02:53:25.768Z",
      "fetchStatus": "success",
      "fetchDuration": 362,
      "videos": [
        {
          "id": "o2Mk0bm6ch4",
          "title": "From 0 to ₹5 Crore in 9 Years, His FIRE Journey",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 At 48, Amaresh Shinganagutti retired with a ₹5 crore corpus, after facing two layoffs and just nine years of disciplined planning. What began as a wake-up call during a layoff turned into a journey of financial freedom and peace of mind. Today, his portfolio has grown so strong that “market conditions don’t matter anymore.” In this conversation, he shares how he rebuilt after losing his job, stayed disciplined thro",
          "publishedAt": "2025-11-01T12:31:12+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/o2Mk0bm6ch4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=o2Mk0bm6ch4",
          "duration": "PT0S",
          "viewCount": "132902",
          "isLive": false,
          "searchableText": "from 0 to ₹5 crore in 9 years, his fire journey fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 at 48, amaresh shinganagutti retired with a ₹5 crore corpus, after facing two layoffs and just nine years of disciplined planning. what began as a wake-up call during a layoff turned into a journey of financial freedom and peace of mind. today, his portfolio has grown so strong that “market conditions don’t matter anymore.” in this conversation, he shares how he rebuilt after losing his job, stayed disciplined thro   wint wealth",
          "keywords": "",
          "hash": "a7f70ceb"
        },
        {
          "id": "yaT_ll9R1hM",
          "title": "How We Balanced Work, Family & a Farm, Without Retiring!",
          "description": "Fill this form to be featured on Wint Wealth: https://forms.gle/iuUgM7fyGTfUUiVE9 What does financial freedom really mean? Quitting your job or building a life you don’t want to escape from? Meet Anirudha and Sucheta, a Pune-based couple living the rare dual life, managing high-pressure corporate careers while running their dream farmstay, ANANT Farm, in Velhe, Maharashtra, just a few hours away from the Pune city. In this episode, they share how they: - Built a peaceful life around nature witho",
          "publishedAt": "2025-10-21T12:31:16+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/yaT_ll9R1hM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=yaT_ll9R1hM",
          "duration": "PT0S",
          "viewCount": "123135",
          "isLive": false,
          "searchableText": "how we balanced work, family & a farm, without retiring! fill this form to be featured on wint wealth: https://forms.gle/iuugm7fygtfuuive9 what does financial freedom really mean? quitting your job or building a life you don’t want to escape from? meet anirudha and sucheta, a pune-based couple living the rare dual life, managing high-pressure corporate careers while running their dream farmstay, anant farm, in velhe, maharashtra, just a few hours away from the pune city. in this episode, they share how they: - built a peaceful life around nature witho   wint wealth",
          "keywords": "",
          "hash": "a046f4fa"
        }
      ]
    },
    "UCnpekFV93kB1O0rVqEKSumg": {
      "name": "Backstage with Millionaires",
      "category": "upskilling",
      "color": "orange",
      "lastFetched": "2025-11-07T02:53:25.696Z",
      "fetchStatus": "success",
      "fetchDuration": 288,
      "videos": [
        {
          "id": "PeCfHh2SWcI",
          "title": "How Groww became India's number 1 Stockbroker?",
          "description": "👉 Register for 2-Day LIVE Training on AI for FREE: https://bit.ly/47RsC7L 👉 100% Discount for all who register 👉 Become the top 1% professional by learning AI today 0:00 Intro 1:55 The Market Gap 3:37 Sponsor - Be10x 5:15 Groww's First Product 8:01 Things Groww got right 11:14 IPO and Future Plans Groww’s Journey: From Startup to India’s No.1 Broker In just 8 years, Groww has become India’s largest stockbroking platform, responsible for bringing over 40% of new investors to the markets in FY2",
          "publishedAt": "2025-11-04T12:17:29+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/PeCfHh2SWcI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=PeCfHh2SWcI",
          "duration": "PT0S",
          "viewCount": "13966",
          "isLive": false,
          "searchableText": "how groww became india's number 1 stockbroker? 👉 register for 2-day live training on ai for free: https://bit.ly/47rsc7l 👉 100% discount for all who register 👉 become the top 1% professional by learning ai today 0:00 intro 1:55 the market gap 3:37 sponsor - be10x 5:15 groww's first product 8:01 things groww got right 11:14 ipo and future plans groww’s journey: from startup to india’s no.1 broker in just 8 years, groww has become india’s largest stockbroking platform, responsible for bringing over 40% of new investors to the markets in fy2   backstage with millionaires",
          "keywords": "",
          "hash": "20c5afdc"
        },
        {
          "id": "Rfw68cadFxU",
          "title": "Does Lenskart Deserve a ₹70,000 Crore Valuation at IPO? - Indian Startups News 285",
          "description": "0:00 Intro 0:44 Lenskart IPO - The Next Paytm? 4:20 Bira91 Loses Control of The Beer Café 6:56 Quick Update: Boat IPO 7:21 Quick Update: Curefoods & Milky Mist IPOs 7:30 Quick Update: Ola Electric’s 4680 Bharat Cell 8:08 Quick Update: Zetwerk’s $100M Lawsuit 8:41 Weekly Funding News This week on Backstage with Millionaires, we’re breaking down Lenskart’s long-awaited IPO — and why its ₹70,000 crore valuation and P/E ratio of 235 have everyone comparing it to Paytm’s disastrous public debut. Is t",
          "publishedAt": "2025-11-01T05:30:25+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/Rfw68cadFxU/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Rfw68cadFxU",
          "duration": "PT0S",
          "viewCount": "33667",
          "isLive": false,
          "searchableText": "does lenskart deserve a ₹70,000 crore valuation at ipo? - indian startups news 285 0:00 intro 0:44 lenskart ipo - the next paytm? 4:20 bira91 loses control of the beer café 6:56 quick update: boat ipo 7:21 quick update: curefoods & milky mist ipos 7:30 quick update: ola electric’s 4680 bharat cell 8:08 quick update: zetwerk’s $100m lawsuit 8:41 weekly funding news this week on backstage with millionaires, we’re breaking down lenskart’s long-awaited ipo — and why its ₹70,000 crore valuation and p/e ratio of 235 have everyone comparing it to paytm’s disastrous public debut. is t   backstage with millionaires",
          "keywords": "",
          "hash": "bbddd5eb"
        },
        {
          "id": "3KiRkRiTsjM",
          "title": "Why Meesho’s IPO is special? - Indian Startups News 284",
          "description": "0:00 Intro 0:41 Meesho's IPO 5:22 Zepto Raises $450 Million 7:23 Quick Update: Zoho Pay 7:53 Quick Update: Tata 1mg 8:23 Quick Update: WazirX 8:50 Quick Update: Shadowfax 9:13 Weekly Funding News This week on Backstage with Millionaires, we’re talking about Meesho’s upcoming IPO and why it could be one of the most important public listings in India’s startup ecosystem. When Amazon and Flipkart focused on the top 10%, Meesho built for the other 90% — small towns, local shops, and WhatsApp sellers",
          "publishedAt": "2025-10-25T05:30:05+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/3KiRkRiTsjM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=3KiRkRiTsjM",
          "duration": "PT0S",
          "viewCount": "34972",
          "isLive": false,
          "searchableText": "why meesho’s ipo is special? - indian startups news 284 0:00 intro 0:41 meesho's ipo 5:22 zepto raises $450 million 7:23 quick update: zoho pay 7:53 quick update: tata 1mg 8:23 quick update: wazirx 8:50 quick update: shadowfax 9:13 weekly funding news this week on backstage with millionaires, we’re talking about meesho’s upcoming ipo and why it could be one of the most important public listings in india’s startup ecosystem. when amazon and flipkart focused on the top 10%, meesho built for the other 90% — small towns, local shops, and whatsapp sellers   backstage with millionaires",
          "keywords": "",
          "hash": "de1e7e61"
        },
        {
          "id": "OztXMnNzAY0",
          "title": "How Stage Is Building India's Netflix?",
          "description": "Check out Quillbot at - https://shorturl.at/9GqOH 0:00 Intro 1:27 Finding the Gap 5:47 Sponser - Quillbot 6:45 Stage’s Positioning 11:24 Scale & Future Growth 13:01 Final Thoughts India has 60+ crore OTT users, but only a small fraction pay for content — and one big reason is language. While most major platforms cater to Hindi and English speakers, millions of Indians speak dialects like Haryanvi, Bhojpuri, and Rajasthani, with almost no high-quality content in their native tongue. That’s where ",
          "publishedAt": "2025-10-21T12:25:53+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/OztXMnNzAY0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=OztXMnNzAY0",
          "duration": "PT0S",
          "viewCount": "30987",
          "isLive": false,
          "searchableText": "how stage is building india's netflix? check out quillbot at - https://shorturl.at/9gqoh 0:00 intro 1:27 finding the gap 5:47 sponser - quillbot 6:45 stage’s positioning 11:24 scale & future growth 13:01 final thoughts india has 60+ crore ott users, but only a small fraction pay for content — and one big reason is language. while most major platforms cater to hindi and english speakers, millions of indians speak dialects like haryanvi, bhojpuri, and rajasthani, with almost no high-quality content in their native tongue. that’s where    backstage with millionaires",
          "keywords": "",
          "hash": "033d111d"
        },
        {
          "id": "l6ow0HpGjzI",
          "title": "Is Rapido Getting Distracted? - Indian Startups News 283",
          "description": "0:00 Intro 0:41 Is Rapido Getting Distracted? 4:33 Mappls vs Google Maps 6:05 Quick Updates: Muse Wearables x NPCI 6:31 Quick Updates: IndiaAI Facial Recognition Challenge 6:44 Quick Updates: Skyroot Aerospace x Exolaunch 7:02 Weekly Funding News Updates This week on Backstage with Millionaires, we’re talking about Rapido’s bold (and risky) move to become a super app. After building a successful business around bike taxis, Rapido is now expanding into travel bookings—partnering with Redbus, Goib",
          "publishedAt": "2025-10-18T05:30:33+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/l6ow0HpGjzI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=l6ow0HpGjzI",
          "duration": "PT0S",
          "viewCount": "35710",
          "isLive": false,
          "searchableText": "is rapido getting distracted? - indian startups news 283 0:00 intro 0:41 is rapido getting distracted? 4:33 mappls vs google maps 6:05 quick updates: muse wearables x npci 6:31 quick updates: indiaai facial recognition challenge 6:44 quick updates: skyroot aerospace x exolaunch 7:02 weekly funding news updates this week on backstage with millionaires, we’re talking about rapido’s bold (and risky) move to become a super app. after building a successful business around bike taxis, rapido is now expanding into travel bookings—partnering with redbus, goib   backstage with millionaires",
          "keywords": "",
          "hash": "b4c6f011"
        },
        {
          "id": "D6dnJwCU2KE",
          "title": "How Country Delight is Beating Amul and Mother Dairy?",
          "description": "0:00 Intro 1:18 Identifying the Problem 3:56 Business Model 7:25 Growth and Scaling 12:12 Financials & Profitability 13:11 Lessons from Country Delight How Country Delight Built a ₹7,000 Crore Business in Just 10 Years Country Delight entered India’s massive dairy market — dominated by legacy giants like Amul and Mother Dairy — and redefined it with a premium, tech-driven approach. Founded by two IIM graduates, the company turned milk and daily essentials into a modern D2C experience built on tr",
          "publishedAt": "2025-10-14T13:11:00+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/D6dnJwCU2KE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=D6dnJwCU2KE",
          "duration": "PT0S",
          "viewCount": "42752",
          "isLive": false,
          "searchableText": "how country delight is beating amul and mother dairy? 0:00 intro 1:18 identifying the problem 3:56 business model 7:25 growth and scaling 12:12 financials & profitability 13:11 lessons from country delight how country delight built a ₹7,000 crore business in just 10 years country delight entered india’s massive dairy market — dominated by legacy giants like amul and mother dairy — and redefined it with a premium, tech-driven approach. founded by two iim graduates, the company turned milk and daily essentials into a modern d2c experience built on tr   backstage with millionaires",
          "keywords": "",
          "hash": "db672576"
        },
        {
          "id": "D32Kgm8Tqps",
          "title": "Ather Energy's Record-Breaking Year Explained - Indian Startups News 282",
          "description": "0:00 Intro 0:36 Ather Energy’s Comeback 5:06 Global Fintech Fest 2025 8:35 Quick Updates: Anthropic 9:02 Quick Updates: Google 9:19 Quick Updates: Niro Shutdown 9:43 Weekly Funding News Updates This week on Backstage with Millionaires, we’re covering one of the biggest turnaround stories in India’s EV space, Ather Energy’s incredible comeback. After years of trailing behind Ola Electric, Ather has now taken the lead in both sales and market cap, powered by the success of its family scooter, the ",
          "publishedAt": "2025-10-11T05:30:05+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/D32Kgm8Tqps/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=D32Kgm8Tqps",
          "duration": "PT0S",
          "viewCount": "69404",
          "isLive": false,
          "searchableText": "ather energy's record-breaking year explained - indian startups news 282 0:00 intro 0:36 ather energy’s comeback 5:06 global fintech fest 2025 8:35 quick updates: anthropic 9:02 quick updates: google 9:19 quick updates: niro shutdown 9:43 weekly funding news updates this week on backstage with millionaires, we’re covering one of the biggest turnaround stories in india’s ev space, ather energy’s incredible comeback. after years of trailing behind ola electric, ather has now taken the lead in both sales and market cap, powered by the success of its family scooter, the    backstage with millionaires",
          "keywords": "",
          "hash": "35786027"
        },
        {
          "id": "N6D5w9BlVaM",
          "title": "Can Arattai Dethrone WhatsApp in India? -  Indian Startup News 281",
          "description": "0:00 – Intro 0:42 – Arattai's sudden rise 5:27 – Zerodha’s revenue drop 6:56 – Quick Updates 8:05 – Startup Funding News 10:25 – Closing Thoughts This week on Indian startup news, we’re diving into some of the biggest developments shaping India’s startup and tech ecosystem. Can Zoho’s Arattai really challenge WhatsApp in India? 🚨 The Made-in-India messaging app has seen a sudden surge in signups, backed by government support and rising frustration with spam on WhatsApp. But can it really break ",
          "publishedAt": "2025-10-04T05:00:32+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/N6D5w9BlVaM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=N6D5w9BlVaM",
          "duration": "PT0S",
          "viewCount": "75668",
          "isLive": false,
          "searchableText": "can arattai dethrone whatsapp in india? -  indian startup news 281 0:00 – intro 0:42 – arattai's sudden rise 5:27 – zerodha’s revenue drop 6:56 – quick updates 8:05 – startup funding news 10:25 – closing thoughts this week on indian startup news, we’re diving into some of the biggest developments shaping india’s startup and tech ecosystem. can zoho’s arattai really challenge whatsapp in india? 🚨 the made-in-india messaging app has seen a sudden surge in signups, backed by government support and rising frustration with spam on whatsapp. but can it really break    backstage with millionaires",
          "keywords": "",
          "hash": "c401b6e1"
        },
        {
          "id": "fXvbDKbJMdc",
          "title": "How Pharmeasy Lost 90% value in three years?",
          "description": "0:00 Intro 1:15 Origin Story 4:43 Scaling up 7:20 Cracks Emerging 10:40 Lessons 12:12 Future Uncertainty PharmEasy's Rise and Fall PharmEasy started with a vision to simplify India’s fragmented medicine market, growing quickly and acquiring Thyrocare in a historic deal. By 2021, it was India’s first health-tech unicorn with a $5.6 billion valuation. However, its aggressive expansion, high debt from acquisitions, and failed IPO led to massive financial strain. As PharmEasy faced mounting losses, ",
          "publishedAt": "2025-10-01T17:17:50+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/fXvbDKbJMdc/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=fXvbDKbJMdc",
          "duration": "PT0S",
          "viewCount": "60924",
          "isLive": false,
          "searchableText": "how pharmeasy lost 90% value in three years? 0:00 intro 1:15 origin story 4:43 scaling up 7:20 cracks emerging 10:40 lessons 12:12 future uncertainty pharmeasy's rise and fall pharmeasy started with a vision to simplify india’s fragmented medicine market, growing quickly and acquiring thyrocare in a historic deal. by 2021, it was india’s first health-tech unicorn with a $5.6 billion valuation. however, its aggressive expansion, high debt from acquisitions, and failed ipo led to massive financial strain. as pharmeasy faced mounting losses,    backstage with millionaires",
          "keywords": "",
          "hash": "db516fe9"
        },
        {
          "id": "YTouUhdAsKo",
          "title": "Can Amazon Win India's Quick Commerce War? - Indian Startup News 280",
          "description": "0:00 Intro 0:50 Quick Commerce war in India 4:15 India's first ever 3D rocket by Agnikul Cosmos 5:55 Quick News Update 7:20 Funding News Update This week on Backstage with Millionaires, we dive into the fierce battle in India’s quick commerce space as Flipkart and Amazon make a bold move by integrating their quick-commerce services into the festive season sales. Can these e-commerce giants challenge Blinkit, Instamart, and Zepto? We also cover some groundbreaking innovations like Agnikul Cosmos ",
          "publishedAt": "2025-09-27T05:30:18+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/YTouUhdAsKo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=YTouUhdAsKo",
          "duration": "PT0S",
          "viewCount": "35848",
          "isLive": false,
          "searchableText": "can amazon win india's quick commerce war? - indian startup news 280 0:00 intro 0:50 quick commerce war in india 4:15 india's first ever 3d rocket by agnikul cosmos 5:55 quick news update 7:20 funding news update this week on backstage with millionaires, we dive into the fierce battle in india’s quick commerce space as flipkart and amazon make a bold move by integrating their quick-commerce services into the festive season sales. can these e-commerce giants challenge blinkit, instamart, and zepto? we also cover some groundbreaking innovations like agnikul cosmos    backstage with millionaires",
          "keywords": "",
          "hash": "c384f50f"
        },
        {
          "id": "q02fIJxAewM",
          "title": "How Tata Failed BigBasket❓",
          "description": "0:00 Intro 1:17 BigBasket's Early Days 3:21 Tata's Entry 4:54 Changing Market 7:06 Tata's Strategic Missteps 11:17 The Fallout of BigBasket 12:22 Outro Tata’s acquisition of BigBasket in 2021 seemed like a winning move, but things didn’t go as planned. Despite its early dominance, BigBasket struggled to adapt to the rise of quick commerce, causing its market share to plummet. Tata's BigBasket Acquisition (2021) Tata acquired BigBasket aiming to integrate it into their super app, but the broader ",
          "publishedAt": "2025-09-23T11:50:01+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/q02fIJxAewM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=q02fIJxAewM",
          "duration": "PT0S",
          "viewCount": "113618",
          "isLive": false,
          "searchableText": "how tata failed bigbasket❓ 0:00 intro 1:17 bigbasket's early days 3:21 tata's entry 4:54 changing market 7:06 tata's strategic missteps 11:17 the fallout of bigbasket 12:22 outro tata’s acquisition of bigbasket in 2021 seemed like a winning move, but things didn’t go as planned. despite its early dominance, bigbasket struggled to adapt to the rise of quick commerce, causing its market share to plummet. tata's bigbasket acquisition (2021) tata acquired bigbasket aiming to integrate it into their super app, but the broader    backstage with millionaires",
          "keywords": "",
          "hash": "6abdd073"
        }
      ]
    },
    "UCf_XYgupvdx7rA44Ap3uI5w": {
      "name": "Full Disclosure",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-11-07T02:53:25.941Z",
      "fetchStatus": "success",
      "fetchDuration": 173,
      "videos": [
        {
          "id": "hA98C-6rATk",
          "title": "Will Middle Managers Exist Next Year?",
          "description": "📌 Check out Quillbot: https://shorturl.at/6k0G4 The corporate ladder is collapsing. From Amazon and Google to TCS and Microsoft, companies are systematically eliminating middle management in a seismic shift called \"The Great Flattening.\" Gartner predicts that by 2026, one in five companies will use AI to eliminate over half of their managers. This isn't a phase; it's an overhaul fueled by AI, efficiency, and the need to cut expensive, redundant layers. In this Full Disclosure, Loveena Kamath br",
          "publishedAt": "2025-10-15T15:09:51+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/hA98C-6rATk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=hA98C-6rATk",
          "duration": "PT0S",
          "viewCount": "89831",
          "isLive": false,
          "searchableText": "will middle managers exist next year? 📌 check out quillbot: https://shorturl.at/6k0g4 the corporate ladder is collapsing. from amazon and google to tcs and microsoft, companies are systematically eliminating middle management in a seismic shift called \"the great flattening.\" gartner predicts that by 2026, one in five companies will use ai to eliminate over half of their managers. this isn't a phase; it's an overhaul fueled by ai, efficiency, and the need to cut expensive, redundant layers. in this full disclosure, loveena kamath br   full disclosure",
          "keywords": "",
          "hash": "0fb4abe0"
        }
      ]
    },
    "UCIVl4K2afJgLJv0b2ToTs_g": {
      "name": "GrowthX",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-11-07T02:53:25.902Z",
      "fetchStatus": "success",
      "fetchDuration": 133,
      "videos": [
        {
          "id": "E6DO_U2QWz4",
          "title": "12 Skills for an Unfair Advantage in 2026",
          "description": "Eligibility check for GrowthX ✅ https://growthx.cc/AI_Skills AI Skills 2026 Resource 📒 https://growthx.cc/Skill_Resource GrowthX is a community of 4,500+ members who lead product, marketing, and growth at companies like SarvamAI, ElevenLabs, Lovable, Google, Microsoft & more. CXOs, VPs, ICs — all united by one obsession: compounding their career in the AI-first world. GrowthX members get access to : 💎 4,500+ member AI-first private community 💎 In-person monthly AI events across India 💎 AI cr",
          "publishedAt": "2025-11-03T13:59:17+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/E6DO_U2QWz4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=E6DO_U2QWz4",
          "duration": "PT0S",
          "viewCount": "26930",
          "isLive": false,
          "searchableText": "12 skills for an unfair advantage in 2026 eligibility check for growthx ✅ https://growthx.cc/ai_skills ai skills 2026 resource 📒 https://growthx.cc/skill_resource growthx is a community of 4,500+ members who lead product, marketing, and growth at companies like sarvamai, elevenlabs, lovable, google, microsoft & more. cxos, vps, ics — all united by one obsession: compounding their career in the ai-first world. growthx members get access to : 💎 4,500+ member ai-first private community 💎 in-person monthly ai events across india 💎 ai cr   growthx",
          "keywords": "",
          "hash": "19991441"
        }
      ]
    },
    "UC3-IDKNIABI98_J2aqa2YjQ": {
      "name": "Think School Hindi by Zero1",
      "category": "upskilling",
      "color": "orange",
      "lastFetched": "2025-11-07T02:53:25.953Z",
      "fetchStatus": "success",
      "fetchDuration": 183,
      "videos": [
        {
          "id": "uLVoft4JePw",
          "title": "How Bihar Went From RICHEST to POOREST State in India: Economic Case Study",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉By Think School: https://thethinkschool.com/sp/communication-masterclass/ 👉VIDEO INTRODUCTION: Doston, Bihar ek zamane mein Bharat ke richest states mein se ek tha! Aur jis tarah aaj Saudi Arabia oil power hai, ussi tarah Bihar ek aisi mono",
          "publishedAt": "2025-11-04T12:00:56+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/uLVoft4JePw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=uLVoft4JePw",
          "duration": "PT0S",
          "viewCount": "103391",
          "isLive": false,
          "searchableText": "how bihar went from richest to poorest state in india: economic case study 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉by think school: https://thethinkschool.com/sp/communication-masterclass/ 👉video introduction: doston, bihar ek zamane mein bharat ke richest states mein se ek tha! aur jis tarah aaj saudi arabia oil power hai, ussi tarah bihar ek aisi mono   think school hindi by zero1",
          "keywords": "",
          "hash": "ebd59dc7"
        },
        {
          "id": "JZg1AVR0FIg",
          "title": "How did a poor boy become the Metal King of India?  | ft. Anil Agarwal IBP",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on - Zerodha Varsity: https://openinapp.link/tsje3 👉Spotify Link: https://open.spotify.com/episode/0BrnykceD71rGW33W3DPrI?si=Uc9gWieMRXKJzzMluliCyg 👉By Think School: https://thethinkschool.com/ 👉VIDEO INTRODUCTION: From a scrap trader to a ₹2 lakh crore empire, how did a boy from Bihar bu",
          "publishedAt": "2025-10-28T15:04:00+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/JZg1AVR0FIg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=JZg1AVR0FIg",
          "duration": "PT0S",
          "viewCount": "28306",
          "isLive": false,
          "searchableText": "how did a poor boy become the metal king of india?  | ft. anil agarwal ibp 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on - zerodha varsity: https://openinapp.link/tsje3 👉spotify link: https://open.spotify.com/episode/0brnykced71rgw33w3dpri?si=uc9gwiemrxkjzzmlulicyg 👉by think school: https://thethinkschool.com/ 👉video introduction: from a scrap trader to a ₹2 lakh crore empire, how did a boy from bihar bu   think school hindi by zero1",
          "keywords": "",
          "hash": "b0b49a43"
        },
        {
          "id": "2zH-MoOzDIU",
          "title": "Zoho vs Microsoft | How did a Villager build a 50,000 cr Tech company? : Zoho Business case study",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉By Think School: https://thethinkschool.com/sp/communication-masterclass/ 👉VIDEO INTRODUCTION: Doston, aaj har jagah sunne ko milta hai—startups fail ho rahe hain!! Investors se paisa aa toh raha hai, lekin ye naye startups paisa kama nahi ",
          "publishedAt": "2025-10-23T11:10:37+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/2zH-MoOzDIU/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=2zH-MoOzDIU",
          "duration": "PT0S",
          "viewCount": "186138",
          "isLive": false,
          "searchableText": "zoho vs microsoft | how did a villager build a 50,000 cr tech company? : zoho business case study 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉by think school: https://thethinkschool.com/sp/communication-masterclass/ 👉video introduction: doston, aaj har jagah sunne ko milta hai—startups fail ho rahe hain!! investors se paisa aa toh raha hai, lekin ye naye startups paisa kama nahi    think school hindi by zero1",
          "keywords": "",
          "hash": "5bde651c"
        },
        {
          "id": "qAD0KJgdCjM",
          "title": "Power Game : Secrets of Gold prices? Should you buy? : Full Case study Explained",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉By Think School: https://thethinkschool.com/sp/communication-masterclass/ 👉VIDEO INTRODUCTION: Doston, gaur se dekhiye is graph ko — ye hai China ka gold purchase graph. Aur pichle 3–4 saalon me, ye graph ne aisa raftar pakdi hai ki pure du",
          "publishedAt": "2025-10-19T16:00:37+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/qAD0KJgdCjM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=qAD0KJgdCjM",
          "duration": "PT0S",
          "viewCount": "932251",
          "isLive": false,
          "searchableText": "power game : secrets of gold prices? should you buy? : full case study explained 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉by think school: https://thethinkschool.com/sp/communication-masterclass/ 👉video introduction: doston, gaur se dekhiye is graph ko — ye hai china ka gold purchase graph. aur pichle 3–4 saalon me, ye graph ne aisa raftar pakdi hai ki pure du   think school hindi by zero1",
          "keywords": "",
          "hash": "3ae4cbd9"
        },
        {
          "id": "dRsof-m5Pqw",
          "title": "Why do Celebrity Brands Fail? : Celebrity brands Hype vs Reality",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉By Think School: https://thethinkschool.com/ 👉VIDEO INTRODUCTION: Doston, 2024 me Ranveer Singh ne launch kiya SuperYou, aur sirf 11 mahino me SuperYou ne kamaya 100 crore rupaye! Ussi tarah 2008 me Shah Rukh Khan ne KKR me invest kiya tha ",
          "publishedAt": "2025-10-08T12:01:12+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/dRsof-m5Pqw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=dRsof-m5Pqw",
          "duration": "PT0S",
          "viewCount": "86533",
          "isLive": false,
          "searchableText": "why do celebrity brands fail? : celebrity brands hype vs reality 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉by think school: https://thethinkschool.com/ 👉video introduction: doston, 2024 me ranveer singh ne launch kiya superyou, aur sirf 11 mahino me superyou ne kamaya 100 crore rupaye! ussi tarah 2008 me shah rukh khan ne kkr me invest kiya tha    think school hindi by zero1",
          "keywords": "",
          "hash": "f11623f6"
        },
        {
          "id": "6n_V2J_CI9w",
          "title": "Can Modi's Andaman-Nicobar Masterplan Stop China? : Geopolitical case study",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉By Think School: https://thethinkschool.com/sp/communication-masterclass/ 👉VIDEO INTRODUCTION: Doston, Kuch saal pehle Ajit Doval ne ek aisi kahi thi… Aur yeh baat aaj India ki foreign policy ka foundation ban chuka hai. Kyuki Shanti bheek ",
          "publishedAt": "2025-09-27T09:30:04+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/6n_V2J_CI9w/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=6n_V2J_CI9w",
          "duration": "PT0S",
          "viewCount": "194732",
          "isLive": false,
          "searchableText": "can modi's andaman-nicobar masterplan stop china? : geopolitical case study 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉by think school: https://thethinkschool.com/sp/communication-masterclass/ 👉video introduction: doston, kuch saal pehle ajit doval ne ek aisi kahi thi… aur yeh baat aaj india ki foreign policy ka foundation ban chuka hai. kyuki shanti bheek    think school hindi by zero1",
          "keywords": "",
          "hash": "c83e7656"
        },
        {
          "id": "MzWBC_uY6hE",
          "title": "The END of the AMERICAN DREAM: What It Means for Indians? | EXPLAINED",
          "description": "👉India’s first ‘learn by doing’ experience for growing your wealth. Imagine being able to build your own personal finance plan while attending a class, live. Apply to this upcoming FREE class this week here on Zerodha Varsity: https://openinapp.link/tsje3 👉By Think School: https://thethinkschool.com/sp/communication-masterclass/ 👉VIDEO INTRODUCTION: Doston, 1965 ke baad se America ne aisi policies banayi ki poori duniya ne American Dream ki taakat ko dekha. 1970s, 80s aur 90s mein America ne ",
          "publishedAt": "2025-09-23T14:30:07+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/MzWBC_uY6hE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=MzWBC_uY6hE",
          "duration": "PT0S",
          "viewCount": "265438",
          "isLive": false,
          "searchableText": "the end of the american dream: what it means for indians? | explained 👉india’s first ‘learn by doing’ experience for growing your wealth. imagine being able to build your own personal finance plan while attending a class, live. apply to this upcoming free class this week here on zerodha varsity: https://openinapp.link/tsje3 👉by think school: https://thethinkschool.com/sp/communication-masterclass/ 👉video introduction: doston, 1965 ke baad se america ne aisi policies banayi ki poori duniya ne american dream ki taakat ko dekha. 1970s, 80s aur 90s mein america ne    think school hindi by zero1",
          "keywords": "",
          "hash": "9c342ed5"
        }
      ]
    },
    "UCyKj-yaTpbnWZY90ajxB8WQ": {
      "name": "Ditto Insurance",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-11-07T02:53:25.950Z",
      "fetchStatus": "success",
      "fetchDuration": 179,
      "videos": [
        {
          "id": "UnL9qEMQKpw",
          "title": "HDFC ERGO Energy Health Insurance Review 2025 | Day 1 Diabetes Coverage | Features & Cost | Ditto",
          "description": "→ FREE health insurance advice from IRDAI-experts without any spam or forceful selling - https://ditto.sh/9ivqix If you have diabetes or hypertension, finding the right health insurance for chronic conditions can feel impossible. Most plans reject you outright, impose 2-3 year waiting periods, or charge sky-high premiums. That's exactly why HDFC Ergo Energy exists — a specialized diabetes health insurance and BP health insurance plan offering day-one coverage for your existing condition with no ",
          "publishedAt": "2025-11-05T07:24:06+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/UnL9qEMQKpw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=UnL9qEMQKpw",
          "duration": "PT0S",
          "viewCount": "1349",
          "isLive": false,
          "searchableText": "hdfc ergo energy health insurance review 2025 | day 1 diabetes coverage | features & cost | ditto → free health insurance advice from irdai-experts without any spam or forceful selling - https://ditto.sh/9ivqix if you have diabetes or hypertension, finding the right health insurance for chronic conditions can feel impossible. most plans reject you outright, impose 2-3 year waiting periods, or charge sky-high premiums. that's exactly why hdfc ergo energy exists — a specialized diabetes health insurance and bp health insurance plan offering day-one coverage for your existing condition with no    ditto insurance",
          "keywords": "",
          "hash": "cb28c160"
        },
        {
          "id": "0yoU1kN0E_g",
          "title": "Watch this video if you want to avoid CLAIM REJECTION! How to Choose BEST Health Insurance | Ditto",
          "description": "Want FREE help choosing the right health insurance plan ? Book a free call today - https://ditto.sh/5tb9i8 In this video, we outline clear, actionable steps on how to select the best health insurance plan tailored to your needs. What you’ll learn: → How to check basic coverage features — avoid co-payments, disease-wise sub-limits, and room rent restrictions that add hidden costs → Why evaluating the types of treatments covered is essential: daycare surgeries, AYUSH therapies, domiciliary care, a",
          "publishedAt": "2025-11-04T13:48:31+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/0yoU1kN0E_g/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=0yoU1kN0E_g",
          "duration": "PT0S",
          "viewCount": "1008",
          "isLive": false,
          "searchableText": "watch this video if you want to avoid claim rejection! how to choose best health insurance | ditto want free help choosing the right health insurance plan ? book a free call today - https://ditto.sh/5tb9i8 in this video, we outline clear, actionable steps on how to select the best health insurance plan tailored to your needs. what you’ll learn: → how to check basic coverage features — avoid co-payments, disease-wise sub-limits, and room rent restrictions that add hidden costs → why evaluating the types of treatments covered is essential: daycare surgeries, ayush therapies, domiciliary care, a   ditto insurance",
          "keywords": "",
          "hash": "c6eda9eb"
        },
        {
          "id": "UlqFbjVFPUc",
          "title": "Is Star Health OPD Plan Worth it? Star Health Insurance OPD Plan DETAILED Review | Ditto Insurance",
          "description": "👉 Get FREE Insurance consultation from certified experts for your health and term life insurance needs, with ZERO spam - https://ditto.sh/ymppmi What You’ll Learn in This Video: → What makes the Star Health OPD Insurance Plan unique compared to regular health insurance plans → Details of the three variants — Silver, Gold, and Platinum — and how their pre-existing condition waiting periods differ → A clear breakdown of OPD coverage: outpatient consultations, diagnostics, medicine expenses, physi",
          "publishedAt": "2025-11-03T04:46:51+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/UlqFbjVFPUc/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=UlqFbjVFPUc",
          "duration": "PT0S",
          "viewCount": "841",
          "isLive": false,
          "searchableText": "is star health opd plan worth it? star health insurance opd plan detailed review | ditto insurance 👉 get free insurance consultation from certified experts for your health and term life insurance needs, with zero spam - https://ditto.sh/ymppmi what you’ll learn in this video: → what makes the star health opd insurance plan unique compared to regular health insurance plans → details of the three variants — silver, gold, and platinum — and how their pre-existing condition waiting periods differ → a clear breakdown of opd coverage: outpatient consultations, diagnostics, medicine expenses, physi   ditto insurance",
          "keywords": "",
          "hash": "4f87bf0a"
        },
        {
          "id": "oixOhMiClVY",
          "title": "Axis Max Life Term Insurance Plan *DETAILED* Review | Axis Max Life Smart Term Plan Plus | Ditto",
          "description": "Want FREE & Expert Insurance Advice? Book a FREE call with Ditto for Health and Term Insurance advice - https://ditto.sh/qabw9d #axismaxlife #maxlifeinsurance #terminsurance In this video: → We break down what makes the Axis Max Life Insurance term plan unique and how the Axis Max Life Smart Term Plan Plus stands out in the cluttered market → A quick guide to all six variants — explaining what works, what doesn’t, and who each variant is for → How Axis Max Life Insurance compares on key metrics ",
          "publishedAt": "2025-11-02T06:31:49+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/oixOhMiClVY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=oixOhMiClVY",
          "duration": "PT0S",
          "viewCount": "1443",
          "isLive": false,
          "searchableText": "axis max life term insurance plan *detailed* review | axis max life smart term plan plus | ditto want free & expert insurance advice? book a free call with ditto for health and term insurance advice - https://ditto.sh/qabw9d #axismaxlife #maxlifeinsurance #terminsurance in this video: → we break down what makes the axis max life insurance term plan unique and how the axis max life smart term plan plus stands out in the cluttered market → a quick guide to all six variants — explaining what works, what doesn’t, and who each variant is for → how axis max life insurance compares on key metrics    ditto insurance",
          "keywords": "",
          "hash": "8e839e0f"
        },
        {
          "id": "WCquwajSLYM",
          "title": "Why This Insurer Denied Claim THRICE | How Ditto Overturned Decision | Ditto Insurance",
          "description": "Need FREE assistance with health or term insurance from Ditto’s IRDAI experts? Book a FREE call today - https://ditto.sh/k9slem Claim Rejection can turn your worst medical emergency into a nightmare. But what if someone fought for you—not once, not twice, but three times? This is the story of a shoulder surgery claim that was denied twice. Pre-auth rejected. Investigation triggered. Timeline questioned. Pre-existing condition suspected. Most would have given up. But we didn’t. In this video, we ",
          "publishedAt": "2025-11-01T07:54:06+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/WCquwajSLYM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=WCquwajSLYM",
          "duration": "PT0S",
          "viewCount": "2534",
          "isLive": false,
          "searchableText": "why this insurer denied claim thrice | how ditto overturned decision | ditto insurance need free assistance with health or term insurance from ditto’s irdai experts? book a free call today - https://ditto.sh/k9slem claim rejection can turn your worst medical emergency into a nightmare. but what if someone fought for you—not once, not twice, but three times? this is the story of a shoulder surgery claim that was denied twice. pre-auth rejected. investigation triggered. timeline questioned. pre-existing condition suspected. most would have given up. but we didn’t. in this video, we    ditto insurance",
          "keywords": "",
          "hash": "a763fe00"
        },
        {
          "id": "i-dDWMlrpQw",
          "title": "Top Term Life Insurance with Health Benefits | FREE Health Checkups with Term Life Insurance | Ditto",
          "description": "→ Want help choosing the right term plan for your family? Book a FREE 1-1 consultation with Ditto’s IRDAI-certified advisors: https://ditto.sh/8561s2 For years, term insurance was seen as a simple “safety net” — a plan that only paid out if the worst happened. But that’s changing. A new wave of term insurance plans in India are adding built-in health management features that make your policy useful while you’re alive — not just after. From free annual health checkups to fitness programs, telecon",
          "publishedAt": "2025-10-29T10:30:37+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/i-dDWMlrpQw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=i-dDWMlrpQw",
          "duration": "PT0S",
          "viewCount": "3120",
          "isLive": false,
          "searchableText": "top term life insurance with health benefits | free health checkups with term life insurance | ditto → want help choosing the right term plan for your family? book a free 1-1 consultation with ditto’s irdai-certified advisors: https://ditto.sh/8561s2 for years, term insurance was seen as a simple “safety net” — a plan that only paid out if the worst happened. but that’s changing. a new wave of term insurance plans in india are adding built-in health management features that make your policy useful while you’re alive — not just after. from free annual health checkups to fitness programs, telecon   ditto insurance",
          "keywords": "",
          "hash": "c6154a18"
        },
        {
          "id": "MJ-qzL3JTGI",
          "title": "Top GOVT LIFE INSURANCE Schemes in India | Complete Guide to Life Insurance Schemes 2025 | Ditto",
          "description": "→ Book a FREE consultation with Ditto's expert advisors to understand if government life insurance schemes suit your needs: https://ditto.sh/bgks82 If your bank manager offered you ₹2 lakh insurance for ₹436 a year, or your post office recommended some life cover \"everyone is buying,\" you were looking at India's government life insurance schemes. These government-backed life insurance plans offer accessible protection at minimal cost, but are they enough? This comprehensive guide breaks down all",
          "publishedAt": "2025-10-27T04:31:23+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/MJ-qzL3JTGI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=MJ-qzL3JTGI",
          "duration": "PT0S",
          "viewCount": "1682",
          "isLive": false,
          "searchableText": "top govt life insurance schemes in india | complete guide to life insurance schemes 2025 | ditto → book a free consultation with ditto's expert advisors to understand if government life insurance schemes suit your needs: https://ditto.sh/bgks82 if your bank manager offered you ₹2 lakh insurance for ₹436 a year, or your post office recommended some life cover \"everyone is buying,\" you were looking at india's government life insurance schemes. these government-backed life insurance plans offer accessible protection at minimal cost, but are they enough? this comprehensive guide breaks down all   ditto insurance",
          "keywords": "",
          "hash": "9d42ac96"
        },
        {
          "id": "lKpVd_4v3pA",
          "title": "New PMJAY Scheme: ₹1.5 Lakh Cashless Treatment for Road Accidents | What You Need to Know | Ditto",
          "description": "→ Book a FREE consultation with Ditto's IRDAI-certified advisors for personalized health insurance guidance: https://ditto.sh/ox0q8d #pmjay #pmmodi With 67,933 road accidents on national highways in just the first 6 months of 2025 and over 29,000 deaths recorded, the government has launched the Cashless Treatment of Road Accident Victims Scheme, 2025 providing up to ₹1.5 lakh cashless treatment for any road accident victim. But does this new government scheme mean you no longer need personal hea",
          "publishedAt": "2025-10-26T06:39:05+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/lKpVd_4v3pA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=lKpVd_4v3pA",
          "duration": "PT0S",
          "viewCount": "1414",
          "isLive": false,
          "searchableText": "new pmjay scheme: ₹1.5 lakh cashless treatment for road accidents | what you need to know | ditto → book a free consultation with ditto's irdai-certified advisors for personalized health insurance guidance: https://ditto.sh/ox0q8d #pmjay #pmmodi with 67,933 road accidents on national highways in just the first 6 months of 2025 and over 29,000 deaths recorded, the government has launched the cashless treatment of road accident victims scheme, 2025 providing up to ₹1.5 lakh cashless treatment for any road accident victim. but does this new government scheme mean you no longer need personal hea   ditto insurance",
          "keywords": "",
          "hash": "3c1a892d"
        },
        {
          "id": "7thSm9RI1w8",
          "title": "HDFC Life Click2Protect Supreme *DETAILED REVIEW* 2025 | Features, Premiums & Full Breakdown | Ditto",
          "description": "Confused about selecting the best health insurance plan? Don't worry, we're here to help! Book a free call with Ditto and let our experts guide you to the right choice — https://ditto.sh/hm65rt When it comes to term insurance, HDFC Life Click2Protect Supreme has quickly become one of the most talked-about plans in India. From zero-cost exits and critical illness riders to income benefits and wellness add-ons, this plan seems to have it all. But does it truly deliver, or is it just another brochu",
          "publishedAt": "2025-10-23T10:30:07+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/7thSm9RI1w8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=7thSm9RI1w8",
          "duration": "PT0S",
          "viewCount": "3278",
          "isLive": false,
          "searchableText": "hdfc life click2protect supreme *detailed review* 2025 | features, premiums & full breakdown | ditto confused about selecting the best health insurance plan? don't worry, we're here to help! book a free call with ditto and let our experts guide you to the right choice — https://ditto.sh/hm65rt when it comes to term insurance, hdfc life click2protect supreme has quickly become one of the most talked-about plans in india. from zero-cost exits and critical illness riders to income benefits and wellness add-ons, this plan seems to have it all. but does it truly deliver, or is it just another brochu   ditto insurance",
          "keywords": "",
          "hash": "d5a37368"
        },
        {
          "id": "mLcUlYrH3aA",
          "title": "Niva Bupa Reassure 3.0 LATEST Review 2025 | Niva Bupa NEW Health Insurance | Ditto Insurance",
          "description": "Confused about selecting the best health insurance plan? Don't worry, we're here to help! Book a free call with Ditto and let our experts guide you to the right choice — https://ditto.sh/iah9lh #nivabupa #nivabupahealthinsurance #healthinsurance Welcome to our initial deep dive into the highly anticipated Niva Bupa ReAssure 3.0 plan. Over the last few weeks, we have analyzed every aspect of this new offering from Niva Bupa health insurance and compared it extensively with ReAssure 2.0 to provide",
          "publishedAt": "2025-10-22T12:51:08+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/mLcUlYrH3aA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=mLcUlYrH3aA",
          "duration": "PT0S",
          "viewCount": "6414",
          "isLive": false,
          "searchableText": "niva bupa reassure 3.0 latest review 2025 | niva bupa new health insurance | ditto insurance confused about selecting the best health insurance plan? don't worry, we're here to help! book a free call with ditto and let our experts guide you to the right choice — https://ditto.sh/iah9lh #nivabupa #nivabupahealthinsurance #healthinsurance welcome to our initial deep dive into the highly anticipated niva bupa reassure 3.0 plan. over the last few weeks, we have analyzed every aspect of this new offering from niva bupa health insurance and compared it extensively with reassure 2.0 to provide   ditto insurance",
          "keywords": "",
          "hash": "af61dc94"
        }
      ]
    },
    "UCOu85KXcYcEClNAeiKrDA6Q": {
      "name": "Indian Silicon Valley by Jivraj Singh Sachar",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-11-07T02:53:26.046Z",
      "fetchStatus": "success",
      "fetchDuration": 275,
      "videos": [
        {
          "id": "93CmOEviyik",
          "title": "How SuperYou & The Good Bug Are Winning India’s Health Consumer",
          "description": "In this episode of the Indian Silicon Valley Podcast, we host Nikunj Biyani, Founder of SuperYou, and Keshav Biyani, Founder of The Good Bug — two next-generation entrepreneurs building India’s most exciting health and wellness brands. From protein-led snacking to probiotic-based nutrition, SuperYou and The Good Bug represent two sides of India’s health revolution — taste and trust. Together, they’ve redefined how modern Indian consumers eat, feel, and buy wellness. In this conversation, Nikunj ",
          "publishedAt": "2025-11-01T14:09:52+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/93CmOEviyik/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=93CmOEviyik",
          "duration": "PT0S",
          "viewCount": "2551",
          "isLive": false,
          "searchableText": "how superyou & the good bug are winning india’s health consumer in this episode of the indian silicon valley podcast, we host nikunj biyani, founder of superyou, and keshav biyani, founder of the good bug — two next-generation entrepreneurs building india’s most exciting health and wellness brands. from protein-led snacking to probiotic-based nutrition, superyou and the good bug represent two sides of india’s health revolution — taste and trust. together, they’ve redefined how modern indian consumers eat, feel, and buy wellness. in this conversation, nikunj    indian silicon valley by jivraj singh sachar",
          "keywords": "",
          "hash": "4f55a88f"
        },
        {
          "id": "V0mXNAcvJOw",
          "title": "How She Built a ₹100 Cr Dry Fruits Empire",
          "description": "In this episode of the Indian Silicon Valley Podcast, we host Dinika Bhatia, Founder & CEO of Nutty Gritties — India’s leading premium nuts and dry fruits brand. Dinika shares her remarkable journey of transforming a six-generation family trade into a modern ₹100 crore empire. She dives deep into how she redefined the dry fruits market, built a brand before D2C existed, stayed profitable for 16 years, and scaled through retail, quick commerce, and community-driven wellness. From lessons in suppl",
          "publishedAt": "2025-10-25T12:58:08+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/V0mXNAcvJOw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=V0mXNAcvJOw",
          "duration": "PT0S",
          "viewCount": "5863",
          "isLive": false,
          "searchableText": "how she built a ₹100 cr dry fruits empire in this episode of the indian silicon valley podcast, we host dinika bhatia, founder & ceo of nutty gritties — india’s leading premium nuts and dry fruits brand. dinika shares her remarkable journey of transforming a six-generation family trade into a modern ₹100 crore empire. she dives deep into how she redefined the dry fruits market, built a brand before d2c existed, stayed profitable for 16 years, and scaled through retail, quick commerce, and community-driven wellness. from lessons in suppl   indian silicon valley by jivraj singh sachar",
          "keywords": "",
          "hash": "606c38d2"
        }
      ]
    },
    "UCyUQxtFk3guy3WHaZ-2NNOg": {
      "name": "Anurag Bansal",
      "category": "upskilling",
      "color": "orange",
      "lastFetched": "2025-11-07T02:53:26.174Z",
      "fetchStatus": "success",
      "fetchDuration": 128,
      "videos": [
        {
          "id": "oSKQOQ13rEw",
          "title": "Dolo's Genius Strategy to Beat Crocin and Calpol",
          "description": "For 40 years, two tablets ruled every Indian medicine cabinet - Crocin and Calpol. Both were owned by the same global giant, both contained the same medicine, and both seemed unbeatable. Until a small Bangalore-based company found a loophole. This is the story of how Dolo-650 outsmarted GSK’s empire, using a clever regulatory gap, smart doctor outreach, perfect timing during COVID, and eventually, memes. A story of strategy, timing, and how a medicine became a cultural phenomenon. Watch till the",
          "publishedAt": "2025-10-30T14:01:28+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/oSKQOQ13rEw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=oSKQOQ13rEw",
          "duration": "PT0S",
          "viewCount": "7869",
          "isLive": false,
          "searchableText": "dolo's genius strategy to beat crocin and calpol for 40 years, two tablets ruled every indian medicine cabinet - crocin and calpol. both were owned by the same global giant, both contained the same medicine, and both seemed unbeatable. until a small bangalore-based company found a loophole. this is the story of how dolo-650 outsmarted gsk’s empire, using a clever regulatory gap, smart doctor outreach, perfect timing during covid, and eventually, memes. a story of strategy, timing, and how a medicine became a cultural phenomenon. watch till the   anurag bansal",
          "keywords": "",
          "hash": "ff774a68"
        },
        {
          "id": "jiQt7lXLSX8",
          "title": "Inside India’s Paparazzi Economy",
          "description": "In this video, I decode the inner workings of the paparazzi economy, revealing how what appears to be random celebrity drama is actually a sophisticated marketing machine. From Disha Patani’s two-letter tattoo to the curious “skincare rituals” of celebrities, I explore how brands turn casual sightings into viral national conversations. I break down the strategic planning behind these so-called “spontaneous” celebrity moments, where PR teams schedule perfectly styled appearances—and explain how t",
          "publishedAt": "2025-10-23T14:22:37+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/jiQt7lXLSX8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=jiQt7lXLSX8",
          "duration": "PT0S",
          "viewCount": "29454",
          "isLive": false,
          "searchableText": "inside india’s paparazzi economy in this video, i decode the inner workings of the paparazzi economy, revealing how what appears to be random celebrity drama is actually a sophisticated marketing machine. from disha patani’s two-letter tattoo to the curious “skincare rituals” of celebrities, i explore how brands turn casual sightings into viral national conversations. i break down the strategic planning behind these so-called “spontaneous” celebrity moments, where pr teams schedule perfectly styled appearances—and explain how t   anurag bansal",
          "keywords": "",
          "hash": "65d1033d"
        }
      ]
    },
    "UCcPI9kEPhyUDLBHGOhKqxOw": {
      "name": "Breakdown",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-11-07T02:53:26.169Z",
      "fetchStatus": "success",
      "fetchDuration": 122,
      "videos": [
        {
          "id": "K5zfdwuZaOQ",
          "title": "How “Buy the Dip” is Disrupting Mutual Fund investors!",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network In this breakdown, we dive deep into the evolution and future of India's mutual fund industry. From its humble beginnings in 1964 with UTI to the rise of SIPs, digital platforms, and regulatory changes, we explore how the industry has grown over the years. We also discuss the recent market corrections, retail investor behaviors, and the potential for India's mutual fund sector to 10x its growth by 2047. Watch as we analyze",
          "publishedAt": "2025-11-03T14:16:21+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/K5zfdwuZaOQ/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=K5zfdwuZaOQ",
          "duration": "PT0S",
          "viewCount": "5022",
          "isLive": false,
          "searchableText": "how “buy the dip” is disrupting mutual fund investors! breakdown is a part of zero1 network - https://zero1byzerodha.com/network in this breakdown, we dive deep into the evolution and future of india's mutual fund industry. from its humble beginnings in 1964 with uti to the rise of sips, digital platforms, and regulatory changes, we explore how the industry has grown over the years. we also discuss the recent market corrections, retail investor behaviors, and the potential for india's mutual fund sector to 10x its growth by 2047. watch as we analyze   breakdown",
          "keywords": "",
          "hash": "da2b2295"
        },
        {
          "id": "KGEbpXCL4Qk",
          "title": "SHOCKING REPORT on Pharmaceuticals Industry",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Report PDF Link - https://docs.google.com/presentation/d/1AHT57JnQtCPsHYZas68h0fu2sJFlgnbo-A9T6g9cYyw/edit?slide=id.p#slide=id.p India’s ₹2.3 Lakh Crore Retail Pharmacy Industry is About to Explode 🚀 From 10-minute medicine deliveries to Tata 1mg’s 3,000-store expansion — the Indian pharma race is heating up fast. In this Breakdown, we decode how India’s retail pharmacy market is set to double in just 5 years — driven by ",
          "publishedAt": "2025-10-24T13:37:10+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/KGEbpXCL4Qk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=KGEbpXCL4Qk",
          "duration": "PT0S",
          "viewCount": "7111",
          "isLive": false,
          "searchableText": "shocking report on pharmaceuticals industry breakdown is a part of zero1 network - https://zero1byzerodha.com/network report pdf link - https://docs.google.com/presentation/d/1aht57jnqtcpshyzas68h0fu2sjflgnbo-a9t6g9cyyw/edit?slide=id.p#slide=id.p india’s ₹2.3 lakh crore retail pharmacy industry is about to explode 🚀 from 10-minute medicine deliveries to tata 1mg’s 3,000-store expansion — the indian pharma race is heating up fast. in this breakdown, we decode how india’s retail pharmacy market is set to double in just 5 years — driven by    breakdown",
          "keywords": "",
          "hash": "69fbc5ab"
        },
        {
          "id": "_s0ZqLlP5J0",
          "title": "How close are NEW AGE brands to DISRUPTING the 500CR barrier?",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Report PDF Link - https://cdn.prod.website-files.com/6502a82cff431778b5d82829/687369b53ee84fab951d7129_India%20Insurgents%20Report%202025_Portrait%20copy_v2.pdf \"Can new-age consumer brands surpass ₹500 crore in revenue? In this Breakdown, we explore the rise of insurgent brands that are challenging the legacy giants in India. We dive into the latest DSG Consumer Partners report, uncovering the key factors that allow these",
          "publishedAt": "2025-10-11T07:51:59+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/_s0ZqLlP5J0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=_s0ZqLlP5J0",
          "duration": "PT0S",
          "viewCount": "13931",
          "isLive": false,
          "searchableText": "how close are new age brands to disrupting the 500cr barrier? breakdown is a part of zero1 network - https://zero1byzerodha.com/network report pdf link - https://cdn.prod.website-files.com/6502a82cff431778b5d82829/687369b53ee84fab951d7129_india%20insurgents%20report%202025_portrait%20copy_v2.pdf \"can new-age consumer brands surpass ₹500 crore in revenue? in this breakdown, we explore the rise of insurgent brands that are challenging the legacy giants in india. we dive into the latest dsg consumer partners report, uncovering the key factors that allow these   breakdown",
          "keywords": "",
          "hash": "915e5132"
        },
        {
          "id": "A6j3ARTLkGM",
          "title": "Indigo’s SECRET playbook for DISRUPTING ₹120000 crore AVIATION INDUSTRY",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Report Link - https://docs.google.com/presentation/d/1cOdpbb8N6A6PV4LeU6LFf9vF2zanQI6z2xjOTB31ppw/edit?slide=id.p#slide=id.p Unlock the truth behind India’s airline duopoly. In this high-energy Breakdown, we exposes how Air India + IndiGo now control ~90% of India’s ₹1.2 lakh crore passenger aviation market—what it means for your ticket prices (+43% in 5 years), flight schedules, loyalty hacks, and why IndiGo briefly becam",
          "publishedAt": "2025-09-30T12:49:40+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/A6j3ARTLkGM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=A6j3ARTLkGM",
          "duration": "PT0S",
          "viewCount": "34940",
          "isLive": false,
          "searchableText": "indigo’s secret playbook for disrupting ₹120000 crore aviation industry breakdown is a part of zero1 network - https://zero1byzerodha.com/network report link - https://docs.google.com/presentation/d/1codpbb8n6a6pv4leu6lff9vf2zanqi6z2xjotb31ppw/edit?slide=id.p#slide=id.p unlock the truth behind india’s airline duopoly. in this high-energy breakdown, we exposes how air india + indigo now control ~90% of india’s ₹1.2 lakh crore passenger aviation market—what it means for your ticket prices (+43% in 5 years), flight schedules, loyalty hacks, and why indigo briefly becam   breakdown",
          "keywords": "",
          "hash": "00c92274"
        },
        {
          "id": "W-lknT7acYo",
          "title": "Untapped Goldmines for Indian Entrepreneurs",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Everyone wants to build the next unicorn… but the real opportunities lie in solving problems nobody else is looking at. In this video, we break down five high-potential sectors that could create India’s next 100 unicorns between 2025–2035. 📌 What you’ll learn: 1️⃣ Vernacular AI & Bharat-First SaaS (powered by UPI AutoPay) 2️⃣ Longevity & Personalized Healthcare 3️⃣ MSME Credit & Alternative FinTech 4️⃣ ClimateTech & Susta",
          "publishedAt": "2025-09-23T08:01:21+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/W-lknT7acYo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=W-lknT7acYo",
          "duration": "PT0S",
          "viewCount": "182522",
          "isLive": false,
          "searchableText": "untapped goldmines for indian entrepreneurs breakdown is a part of zero1 network - https://zero1byzerodha.com/network everyone wants to build the next unicorn… but the real opportunities lie in solving problems nobody else is looking at. in this video, we break down five high-potential sectors that could create india’s next 100 unicorns between 2025–2035. 📌 what you’ll learn: 1️⃣ vernacular ai & bharat-first saas (powered by upi autopay) 2️⃣ longevity & personalized healthcare 3️⃣ msme credit & alternative fintech 4️⃣ climatetech & susta   breakdown",
          "keywords": "",
          "hash": "711f3bb0"
        },
        {
          "id": "UbflKWjXRPI",
          "title": "Inside India’s ₹67,000 Cr Cola War 2025",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Coke vs Pepsi vs Campa - we go inside India’s ₹67,000 crore cola war and answer: who’s winning now, and who wins next? From the ₹10 price shock to IPL deals, from kirana distribution to “house of drinks” strategy this is the full story. What you’ll learn 1. Why Coke still holds 60% and Pepsi 27% share 2. How Campa hit ₹1,000 cr sales and spread to 10 lakh outlets with 3,200 distributors 3. The pricing play: ₹10/₹20/₹50 SKU",
          "publishedAt": "2025-09-07T07:39:06+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/UbflKWjXRPI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=UbflKWjXRPI",
          "duration": "PT0S",
          "viewCount": "38569",
          "isLive": false,
          "searchableText": "inside india’s ₹67,000 cr cola war 2025 breakdown is a part of zero1 network - https://zero1byzerodha.com/network coke vs pepsi vs campa - we go inside india’s ₹67,000 crore cola war and answer: who’s winning now, and who wins next? from the ₹10 price shock to ipl deals, from kirana distribution to “house of drinks” strategy this is the full story. what you’ll learn 1. why coke still holds 60% and pepsi 27% share 2. how campa hit ₹1,000 cr sales and spread to 10 lakh outlets with 3,200 distributors 3. the pricing play: ₹10/₹20/₹50 sku   breakdown",
          "keywords": "",
          "hash": "1a96e62a"
        },
        {
          "id": "w-FWIWlYnu8",
          "title": "Asian Paints Under Fire: Birla Opus’ Blitz & The ₹70,000 Cr Shake-Up",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network In this Breakdown, we trace the full history of Indian paints (from lime wash to supercomputers = Modern Paints), decode how Asian Paints built its moat across R&D, marketing, supply chain, and tech, and then break down Birla Opus’ blitzkrieg: dealer incentives, distribution hacks, and the tinting-machine turf war. We also touch on the JSW Paints–Dulux (Akzo) play, Berger’s outperformance, and why the industry just shrank ",
          "publishedAt": "2025-08-25T07:59:45+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/w-FWIWlYnu8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=w-FWIWlYnu8",
          "duration": "PT0S",
          "viewCount": "7867",
          "isLive": false,
          "searchableText": "asian paints under fire: birla opus’ blitz & the ₹70,000 cr shake-up breakdown is a part of zero1 network - https://zero1byzerodha.com/network in this breakdown, we trace the full history of indian paints (from lime wash to supercomputers = modern paints), decode how asian paints built its moat across r&d, marketing, supply chain, and tech, and then break down birla opus’ blitzkrieg: dealer incentives, distribution hacks, and the tinting-machine turf war. we also touch on the jsw paints–dulux (akzo) play, berger’s outperformance, and why the industry just shrank    breakdown",
          "keywords": "",
          "hash": "38ba28f0"
        },
        {
          "id": "XcJKEilzcFo",
          "title": "Is OTT killing India's ₹12,000 crore Cinema Industry?",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Report PDF Link - https://www.ormaxmedia.com/insights/stories/the-ormax-box-office-2024-report.html 0:00 - lntro 1:42 - Zerodha shoutout 1:55 - History of Indian cinema 6:15 - The present of Indian cinema 9:32 - PVR’s financial report 12:38 - OTT’s impact on cinema industry 13:42 - The future of Indian cinema 17:42 - Conclusion",
          "publishedAt": "2025-08-14T12:30:40+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/XcJKEilzcFo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=XcJKEilzcFo",
          "duration": "PT0S",
          "viewCount": "9410",
          "isLive": false,
          "searchableText": "is ott killing india's ₹12,000 crore cinema industry? breakdown is a part of zero1 network - https://zero1byzerodha.com/network report pdf link - https://www.ormaxmedia.com/insights/stories/the-ormax-box-office-2024-report.html 0:00 - lntro 1:42 - zerodha shoutout 1:55 - history of indian cinema 6:15 - the present of indian cinema 9:32 - pvr’s financial report 12:38 - ott’s impact on cinema industry 13:42 - the future of indian cinema 17:42 - conclusion   breakdown",
          "keywords": "",
          "hash": "670f8fd2"
        },
        {
          "id": "_PC2KVfn2zA",
          "title": "What’s Next for India’s ₹40,000 Crore Quick Commerce Industry",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Source Link - Source tweet: 1. https://x.com/vaibhavbetter/status/1839308292616606068 2. TD’s blog – https://www.linkedin.com/pulse/why-we-invested-myra-potent-synthesis-technology-operations-davda/?lipi=urn%3Ali%3Apage%3Ad_flagship3_detail_base%3BwoMYzx5OQcC%2Br67W1oNUGQ%3D%3D 3. Link to discussion: https://www.linkedin.com/posts/rahul-jaideep-mathur_startups-india-activity-7290593137113128960-_uYX 4. Source: https://econ",
          "publishedAt": "2025-08-04T09:22:36+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/_PC2KVfn2zA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=_PC2KVfn2zA",
          "duration": "PT0S",
          "viewCount": "16457",
          "isLive": false,
          "searchableText": "what’s next for india’s ₹40,000 crore quick commerce industry breakdown is a part of zero1 network - https://zero1byzerodha.com/network source link - source tweet: 1. https://x.com/vaibhavbetter/status/1839308292616606068 2. td’s blog – https://www.linkedin.com/pulse/why-we-invested-myra-potent-synthesis-technology-operations-davda/?lipi=urn%3ali%3apage%3ad_flagship3_detail_base%3bwomyzx5oqcc%2br67w1onugq%3d%3d 3. link to discussion: https://www.linkedin.com/posts/rahul-jaideep-mathur_startups-india-activity-7290593137113128960-_uyx 4. source: https://econ   breakdown",
          "keywords": "",
          "hash": "b1d366ee"
        },
        {
          "id": "hv3GKosCnn4",
          "title": "How VCs make billions - explained by a VC",
          "description": "Breakdown is a part of Zero1 Network - https://zero1byzerodha.com/network Report PDF Link - https://docsend.com/view/dhsmcxgdtjweytjr In this video, we dive deep into the world of venture capital, uncovering the high-stakes bets that turned ordinary investments into billions! From David Sheridan's game-changing investment in Google to Accel Partners' stunning $1 million bet on Flipkart, venture capital has a fascinating history of creating tech giants. What is venture capital, and how did it evo",
          "publishedAt": "2025-07-27T07:30:19+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/hv3GKosCnn4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=hv3GKosCnn4",
          "duration": "PT0S",
          "viewCount": "21020",
          "isLive": false,
          "searchableText": "how vcs make billions - explained by a vc breakdown is a part of zero1 network - https://zero1byzerodha.com/network report pdf link - https://docsend.com/view/dhsmcxgdtjweytjr in this video, we dive deep into the world of venture capital, uncovering the high-stakes bets that turned ordinary investments into billions! from david sheridan's game-changing investment in google to accel partners' stunning $1 million bet on flipkart, venture capital has a fascinating history of creating tech giants. what is venture capital, and how did it evo   breakdown",
          "keywords": "",
          "hash": "1053b6b1"
        },
        {
          "id": "m6AH8KrQlHk",
          "title": "How India’s Top Creators Are Really Making Money",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report PDF Link - https://web-assets.bcg.com/c8/35/2a008ddf4e049d99a901b17233f0/gift-report.pdf India has over 25 lakh digital content creators. But guess what? Fewer than 3 lakh of them are actually making money. In this deep dive, we uncover the harsh truth behind India’s struggling creator economy — why monetization is broken, why the industry is stuck in a loop, and how creators can break free by thinking li",
          "publishedAt": "2025-07-19T08:53:31+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/m6AH8KrQlHk/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=m6AH8KrQlHk",
          "duration": "PT0S",
          "viewCount": "33227",
          "isLive": false,
          "searchableText": "how india’s top creators are really making money breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report pdf link - https://web-assets.bcg.com/c8/35/2a008ddf4e049d99a901b17233f0/gift-report.pdf india has over 25 lakh digital content creators. but guess what? fewer than 3 lakh of them are actually making money. in this deep dive, we uncover the harsh truth behind india’s struggling creator economy — why monetization is broken, why the industry is stuck in a loop, and how creators can break free by thinking li   breakdown",
          "keywords": "",
          "hash": "00438a0d"
        },
        {
          "id": "98N46iJnPMM",
          "title": "The Story Of Lab Grown Diamonds",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report Link - The Future of the Natural Diamond Industry - https://web-assets.bcg.com/87/88/44ce24b646969ef49aa5a9c4b8b6/bcg-the-future-of-the-natural-diamond-industry-may.pdf In this week's Breakdown, we explore the fascinating history of diamonds — from their origins in ancient India to the marketing masterstroke by De Beers that made \"A diamond is forever\" a global truth. We also unpack the rise of lab-grown ",
          "publishedAt": "2025-07-07T12:30:12+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/98N46iJnPMM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=98N46iJnPMM",
          "duration": "PT0S",
          "viewCount": "8599",
          "isLive": false,
          "searchableText": "the story of lab grown diamonds breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report link - the future of the natural diamond industry - https://web-assets.bcg.com/87/88/44ce24b646969ef49aa5a9c4b8b6/bcg-the-future-of-the-natural-diamond-industry-may.pdf in this week's breakdown, we explore the fascinating history of diamonds — from their origins in ancient india to the marketing masterstroke by de beers that made \"a diamond is forever\" a global truth. we also unpack the rise of lab-grown    breakdown",
          "keywords": "",
          "hash": "8b044b85"
        },
        {
          "id": "EtI5rxlIW4c",
          "title": "Is Quick Commerce Killing Your Local Kirana Store? | Breakdown",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report Link - QC vs Kirana - https://www.pwc.in/assets/pdfs/retail-reinvention-paradigm-v1.pdf You've probably noticed it—fewer people walking into local kirana shops, more ordering from apps. But is quick commerce really to blame? In this Breakdown, we go beyond the headlines. We dive into fresh data from PWC and Kirana Club, and uncover what’s actually happening on the ground. 0:00 Introduction 1:25 Zerodha Sh",
          "publishedAt": "2025-06-29T07:30:10+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/EtI5rxlIW4c/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=EtI5rxlIW4c",
          "duration": "PT0S",
          "viewCount": "22767",
          "isLive": false,
          "searchableText": "is quick commerce killing your local kirana store? | breakdown breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report link - qc vs kirana - https://www.pwc.in/assets/pdfs/retail-reinvention-paradigm-v1.pdf you've probably noticed it—fewer people walking into local kirana shops, more ordering from apps. but is quick commerce really to blame? in this breakdown, we go beyond the headlines. we dive into fresh data from pwc and kirana club, and uncover what’s actually happening on the ground. 0:00 introduction 1:25 zerodha sh   breakdown",
          "keywords": "",
          "hash": "4f8b79fe"
        },
        {
          "id": "MPfarENJWVA",
          "title": "How India Spends: Consumer Habits and Trends | Breakdown",
          "description": "Breakdown is a part of Zero1 by Zerodha Network - https://zero1byzerodha.com/network Report Link - How India Spends - https://marketing.perfios.com/how-india-spends-report/ What does the average Indian consumer spend their money on? How does income level influence choices in groceries, medical, entertainment, and even online gaming? This comprehensive report uncovers the latest trends in Indian consumer behaviour, providing invaluable insights for financial institutions, businesses, and policyma",
          "publishedAt": "2025-06-21T08:43:52+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/MPfarENJWVA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=MPfarENJWVA",
          "duration": "PT0S",
          "viewCount": "24437",
          "isLive": false,
          "searchableText": "how india spends: consumer habits and trends | breakdown breakdown is a part of zero1 by zerodha network - https://zero1byzerodha.com/network report link - how india spends - https://marketing.perfios.com/how-india-spends-report/ what does the average indian consumer spend their money on? how does income level influence choices in groceries, medical, entertainment, and even online gaming? this comprehensive report uncovers the latest trends in indian consumer behaviour, providing invaluable insights for financial institutions, businesses, and policyma   breakdown",
          "keywords": "",
          "hash": "371f694b"
        }
      ]
    },
    "UCM7yoOhnMcfrEZ-5i9m-WFA": {
      "name": "Sonia Shenoy",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-11-07T02:53:26.206Z",
      "fetchStatus": "success",
      "fetchDuration": 158,
      "videos": [
        {
          "id": "qruPr2cARp4",
          "title": "Mahindra XEV 9E? Should you buy it?",
          "description": "The one car you see on the roads a lot lately is the electric origin SUVs by Mahindra . We decided to test drive the new Mahindra XEV 9e to see what the fuss is all about. If you’re planning to buy a new car, be sure to check out Mahindra’s Electric Origin SUVs - https://www.mahindraelectricsuv.com/ #EVnomicsWithMahindra #MahindraElectricOriginSUV #AD",
          "publishedAt": "2025-11-05T11:30:43+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/qruPr2cARp4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=qruPr2cARp4",
          "duration": "PT0S",
          "viewCount": "28578",
          "isLive": false,
          "searchableText": "mahindra xev 9e? should you buy it? the one car you see on the roads a lot lately is the electric origin suvs by mahindra . we decided to test drive the new mahindra xev 9e to see what the fuss is all about. if you’re planning to buy a new car, be sure to check out mahindra’s electric origin suvs - https://www.mahindraelectricsuv.com/ #evnomicswithmahindra #mahindraelectricoriginsuv #ad   sonia shenoy",
          "keywords": "",
          "hash": "14e60739"
        },
        {
          "id": "_iEOFnMEB7M",
          "title": "Inside Groww’s IPO: Lalit Keshre on Profits, Valuation & Market Share | Sonia Shenoy Podcast",
          "description": "On todays episode , we speak to Lalit Keshre the founder of Groww , one of Indias largest stock brokers Groww's IPO opened today i.e November 4, 2025 the IPO price band is at ₹95-100 per share Groww plans to raise ₹1,060 crore through a fresh issue of shares, while existing investors will sell 55.72 crore shares through an offer for sale Through this IPO , Groww is targeting a valuation of about ₹61736 crore Groww has a 26.3% market share of active NSE clients as of June 2025, with 12.6 million ",
          "publishedAt": "2025-11-04T08:48:38+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/_iEOFnMEB7M/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=_iEOFnMEB7M",
          "duration": "PT0S",
          "viewCount": "21878",
          "isLive": false,
          "searchableText": "inside groww’s ipo: lalit keshre on profits, valuation & market share | sonia shenoy podcast on todays episode , we speak to lalit keshre the founder of groww , one of indias largest stock brokers groww's ipo opened today i.e november 4, 2025 the ipo price band is at ₹95-100 per share groww plans to raise ₹1,060 crore through a fresh issue of shares, while existing investors will sell 55.72 crore shares through an offer for sale through this ipo , groww is targeting a valuation of about ₹61736 crore groww has a 26.3% market share of active nse clients as of june 2025, with 12.6 million    sonia shenoy",
          "keywords": "",
          "hash": "77e143dd"
        },
        {
          "id": "v3HrPPaM0o0",
          "title": "India’s Digital Commerce Revolution: Mastercard’s Gautam Aggarwal on Fintech Payments & Economy",
          "description": "India is reshaping the global digital commerce landscape—accounting for 50% of all real-time transactions worldwide. With its digital economy projected to hit $1 trillion by 2030, the country is rapidly emerging as a global fintech powerhouse. Gautam Aggarwal from Mastercard shares his perspective, emphasizing that India’s digital payments revolution is only just beginning. The scale, speed, and inclusivity of this transformation will set new benchmarks for the world.",
          "publishedAt": "2025-11-03T09:30:36+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/v3HrPPaM0o0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=v3HrPPaM0o0",
          "duration": "PT0S",
          "viewCount": "7133",
          "isLive": false,
          "searchableText": "india’s digital commerce revolution: mastercard’s gautam aggarwal on fintech payments & economy india is reshaping the global digital commerce landscape—accounting for 50% of all real-time transactions worldwide. with its digital economy projected to hit $1 trillion by 2030, the country is rapidly emerging as a global fintech powerhouse. gautam aggarwal from mastercard shares his perspective, emphasizing that india’s digital payments revolution is only just beginning. the scale, speed, and inclusivity of this transformation will set new benchmarks for the world.   sonia shenoy",
          "keywords": "",
          "hash": "cb7e71c8"
        },
        {
          "id": "H2nAbr9aFk0",
          "title": "Raamdeo Agrawal on Building Wealth, QGLP Strategy & $1M Investing | Sonia Shenoy Podcast",
          "description": "On todays episode we have none other than Raamdeo Agarwal , the Chairman of Motilal Oswal ltd. Raamdeo has over 25 years of experience in the capital markets, he's watched several bull and bear markets. Raamdeos journey is nothing short of remarkable. He hails from a small village in Chattisgarh where he grew up and today he runs one of India's largest financial services company. Raamdeo has always believed in the warren buffet and Charlie Munger investing philosophy of buy right and sit tight. ",
          "publishedAt": "2025-10-30T08:30:48+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/H2nAbr9aFk0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=H2nAbr9aFk0",
          "duration": "PT0S",
          "viewCount": "210131",
          "isLive": false,
          "searchableText": "raamdeo agrawal on building wealth, qglp strategy & $1m investing | sonia shenoy podcast on todays episode we have none other than raamdeo agarwal , the chairman of motilal oswal ltd. raamdeo has over 25 years of experience in the capital markets, he's watched several bull and bear markets. raamdeos journey is nothing short of remarkable. he hails from a small village in chattisgarh where he grew up and today he runs one of india's largest financial services company. raamdeo has always believed in the warren buffet and charlie munger investing philosophy of buy right and sit tight.    sonia shenoy",
          "keywords": "",
          "hash": "a4dd17bf"
        },
        {
          "id": "b8Vks9jCdI4",
          "title": "What Are SIFs? Inside Quant Mutual Funds QSIF Launch | Sonia Shenoy Podcast FT. Sandeep Tandon",
          "description": "In this episode of Money Mindset, we sit down with Sandeep Tandon of Quant MF to deep dive into the new product in mutual funds, SIFs A SIF is a specialized investment fund which is a newly introduced asset class in India by SEBI which allows flexible asset allocation through this fund, you can get exposure to long short equity, derivatives, structured debt and even unlisted securities its kind of like a bridge between mutual funds and a PMS without the minimum ticket size of 50 lakhs that a PMS",
          "publishedAt": "2025-10-24T09:46:42+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/b8Vks9jCdI4/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=b8Vks9jCdI4",
          "duration": "PT0S",
          "viewCount": "24250",
          "isLive": false,
          "searchableText": "what are sifs? inside quant mutual funds qsif launch | sonia shenoy podcast ft. sandeep tandon in this episode of money mindset, we sit down with sandeep tandon of quant mf to deep dive into the new product in mutual funds, sifs a sif is a specialized investment fund which is a newly introduced asset class in india by sebi which allows flexible asset allocation through this fund, you can get exposure to long short equity, derivatives, structured debt and even unlisted securities its kind of like a bridge between mutual funds and a pms without the minimum ticket size of 50 lakhs that a pms   sonia shenoy",
          "keywords": "",
          "hash": "bcfee82f"
        },
        {
          "id": "aLnKda2hqkU",
          "title": "Macro Trends, Market Forecasts & Investment Strategies for Samvat 2082 | Diwali Roundtable",
          "description": "Happy Diwali to everyone watching ! This episode is a Diwali Special Roundtable where I invited 4 market veterans to have a fun time and chat about the way forward in the market. Sunil Singhania , Vikas Khemani, Pankaj Tibrewal and Gurmeet Chadha join me on this fun evening where we ate , laughed, played games and talked about how the next year will shape up for the markets. Hope you enjoy watchingn and thank you for all your love and support for The Money Mindset podcast over the last one year ",
          "publishedAt": "2025-10-17T11:30:01+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/aLnKda2hqkU/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=aLnKda2hqkU",
          "duration": "PT0S",
          "viewCount": "158959",
          "isLive": false,
          "searchableText": "macro trends, market forecasts & investment strategies for samvat 2082 | diwali roundtable happy diwali to everyone watching ! this episode is a diwali special roundtable where i invited 4 market veterans to have a fun time and chat about the way forward in the market. sunil singhania , vikas khemani, pankaj tibrewal and gurmeet chadha join me on this fun evening where we ate , laughed, played games and talked about how the next year will shape up for the markets. hope you enjoy watchingn and thank you for all your love and support for the money mindset podcast over the last one year    sonia shenoy",
          "keywords": "",
          "hash": "d1155805"
        }
      ]
    },
    "UCxX-O7rPl35IajrJnAdzIyw": {
      "name": "The Other Side with Dilip",
      "category": "health",
      "color": "green",
      "lastFetched": "2025-11-07T02:53:26.495Z",
      "fetchStatus": "success",
      "fetchDuration": 112,
      "videos": []
    },
    "UCMfazW6hC3eaWTW2q0ibhyQ": {
      "name": "Pranay Kapoor",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-11-07T02:53:26.515Z",
      "fetchStatus": "success",
      "fetchDuration": 132,
      "videos": [
        {
          "id": "1__kSNV5m7w",
          "title": "Are Pre Owned Watches Worth It? How to Price them? Counterfeit check and more",
          "description": "We are joined by Arjun, a watch industry veteran and one of the earliest employees of Ethos India! He shares insider tips and tricks around the pre-owned watch market. If you fancy a luxury watch - make sure you watch this video before you pull the trigger on it. 0:00 Highlights 1:28 Intro 2:45 How to value a used watch? 6:32 Which brands make sense in the used market? 14:26 Identifying Fake watches 19:02 The trick to check a fake watch 19:19 What to inspect while buying 22:18 Rolex in the used ",
          "publishedAt": "2025-10-31T13:28:08+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/1__kSNV5m7w/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=1__kSNV5m7w",
          "duration": "PT0S",
          "viewCount": "19650",
          "isLive": false,
          "searchableText": "are pre owned watches worth it? how to price them? counterfeit check and more we are joined by arjun, a watch industry veteran and one of the earliest employees of ethos india! he shares insider tips and tricks around the pre-owned watch market. if you fancy a luxury watch - make sure you watch this video before you pull the trigger on it. 0:00 highlights 1:28 intro 2:45 how to value a used watch? 6:32 which brands make sense in the used market? 14:26 identifying fake watches 19:02 the trick to check a fake watch 19:19 what to inspect while buying 22:18 rolex in the used    pranay kapoor",
          "keywords": "",
          "hash": "8cbd0f83"
        },
        {
          "id": "QrqX7iTL2Fw",
          "title": "Avoiding Flooded or Accidental cars | Step by Step Checklist | Hindi",
          "description": "Invest in corporate bonds using Wint Wealth and get fixed 9-12% https://www.wintwealth.com/?affId=Pranay If you want to buy my Swift, please feel free to express interest in the form below - https://forms.gle/KEmoD9kdUxY6L6DP6 In today's video we have Abdul - who inspects cars for a living. He has seen them all - from a Swift to a Jeep to a Mercedes! He shows us simple tips and tricks to check in a car before pulling the trigger. We cover the below - - Checking the body - The engine - The roof -",
          "publishedAt": "2025-10-16T13:35:28+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/QrqX7iTL2Fw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=QrqX7iTL2Fw",
          "duration": "PT0S",
          "viewCount": "4374",
          "isLive": false,
          "searchableText": "avoiding flooded or accidental cars | step by step checklist | hindi invest in corporate bonds using wint wealth and get fixed 9-12% https://www.wintwealth.com/?affid=pranay if you want to buy my swift, please feel free to express interest in the form below - https://forms.gle/kemod9kduxy6l6dp6 in today's video we have abdul - who inspects cars for a living. he has seen them all - from a swift to a jeep to a mercedes! he shows us simple tips and tricks to check in a car before pulling the trigger. we cover the below - - checking the body - the engine - the roof -   pranay kapoor",
          "keywords": "",
          "hash": "4213ba9a"
        },
        {
          "id": "Y_S06K4noWg",
          "title": "Can Salaried Employees use HUF to save Tax? ",
          "description": "Tax season just concluded and I’m sure you’re wondering what can you do to save taxes. Well the answer is that you need to start now and not a month before the tax deadline. And one really easy, efficient way that really compounds in the long term is HUF - Hindu Undivided Family. In today’s video, we discuss a few things: - How does HUF help you save taxes - How am I personally using HUF - Income sources for HUF - Investments of HUF funds - Loan to an HUF 0:00 Intro 0:37 What is an HUF 1:41 How ",
          "publishedAt": "2025-10-09T16:26:11+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/Y_S06K4noWg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Y_S06K4noWg",
          "duration": "PT0S",
          "viewCount": "56099",
          "isLive": false,
          "searchableText": "can salaried employees use huf to save tax?  tax season just concluded and i’m sure you’re wondering what can you do to save taxes. well the answer is that you need to start now and not a month before the tax deadline. and one really easy, efficient way that really compounds in the long term is huf - hindu undivided family. in today’s video, we discuss a few things: - how does huf help you save taxes - how am i personally using huf - income sources for huf - investments of huf funds - loan to an huf 0:00 intro 0:37 what is an huf 1:41 how    pranay kapoor",
          "keywords": "",
          "hash": "6c8b3553"
        }
      ]
    },
    "UCs0Awb1WCz0dNsq8zhfYl1A": {
      "name": "Vishal Bhargava",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-11-07T02:53:26.498Z",
      "fetchStatus": "success",
      "fetchDuration": 114,
      "videos": [
        {
          "id": "DTJOCQZkYV0",
          "title": "The Business Hub Bigger Than BKC & Lower Parel",
          "description": "Most people think of BKC or Lower Parel when they hear “Mumbai’s commercial hub” — but a major growth story is unfolding in Airoli. This video breaks down how an unfashionable location evolved into one of the most significant business hubs of the Mumbai Metropolitan Region. We look at what’s driving this shift: IT campuses, commercial development, connectivity, talent movement, and why more companies are choosing Airoli as their base. Whether you’re exploring career options, following Mumbai’s d",
          "publishedAt": "2025-11-06T10:38:24+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/DTJOCQZkYV0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=DTJOCQZkYV0",
          "duration": "PT0S",
          "viewCount": "13046",
          "isLive": false,
          "searchableText": "the business hub bigger than bkc & lower parel most people think of bkc or lower parel when they hear “mumbai’s commercial hub” — but a major growth story is unfolding in airoli. this video breaks down how an unfashionable location evolved into one of the most significant business hubs of the mumbai metropolitan region. we look at what’s driving this shift: it campuses, commercial development, connectivity, talent movement, and why more companies are choosing airoli as their base. whether you’re exploring career options, following mumbai’s d   vishal bhargava",
          "keywords": "",
          "hash": "e6b4d89a"
        },
        {
          "id": "Le_oRhfKRis",
          "title": "Renting vs Buying a Home: The Lie You’ve Been Told ",
          "description": "The rent vs buy debate has been framed wrong all along. It's not rent OR buy - it's rent BEFORE buy. Here's the strategy: Instead of committing crores to a property you've only seen a few times, rent in that location first. Live there for 6 months to a year. Experience the commute, test the amenities, understand the community, and learn every strength and weakness of the area. Then, when you're absolutely certain and your finances are ready, buy a property in that same building or neighborhood. ",
          "publishedAt": "2025-10-28T07:38:01+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/Le_oRhfKRis/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Le_oRhfKRis",
          "duration": "PT0S",
          "viewCount": "23128",
          "isLive": false,
          "searchableText": "renting vs buying a home: the lie you’ve been told  the rent vs buy debate has been framed wrong all along. it's not rent or buy - it's rent before buy. here's the strategy: instead of committing crores to a property you've only seen a few times, rent in that location first. live there for 6 months to a year. experience the commute, test the amenities, understand the community, and learn every strength and weakness of the area. then, when you're absolutely certain and your finances are ready, buy a property in that same building or neighborhood.    vishal bhargava",
          "keywords": "",
          "hash": "e5b25870"
        },
        {
          "id": "5EnVbo8qddw",
          "title": "DARK TRUTH of Mumbai Real Estate",
          "description": "India’s most educated builder spills the beans! Harshul Savla of Suvidha Lifespaces, an academic with 7 degrees turned developer, as he pulls back the curtain on Mumbai's complex real estate world. Why do builders often adopt multiple personas? Savla shares surprising investment insights, suggesting chawls and slums might be top bets, and explains the economics driving massive redevelopment offers. He tackles controversial topics like the perceived role of corruption, the persistence of black mo",
          "publishedAt": "2025-10-22T10:44:38+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/5EnVbo8qddw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=5EnVbo8qddw",
          "duration": "PT0S",
          "viewCount": "29448",
          "isLive": false,
          "searchableText": "dark truth of mumbai real estate india’s most educated builder spills the beans! harshul savla of suvidha lifespaces, an academic with 7 degrees turned developer, as he pulls back the curtain on mumbai's complex real estate world. why do builders often adopt multiple personas? savla shares surprising investment insights, suggesting chawls and slums might be top bets, and explains the economics driving massive redevelopment offers. he tackles controversial topics like the perceived role of corruption, the persistence of black mo   vishal bhargava",
          "keywords": "",
          "hash": "d1cac7b5"
        }
      ]
    },
    "UC1MHVwwWd9l46ZeRM7qm_AA": {
      "name": "Tirthak Saha",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-11-07T02:53:26.555Z",
      "fetchStatus": "success",
      "fetchDuration": 171,
      "videos": [
        {
          "id": "RqAKnUYh4jA",
          "title": "Indian Genius who saved the world with just Sugar & Salt",
          "description": "- In 1971, a deadly cholera outbreak swept through the refugee camps during the Bangladesh War. With no medicine, no equipment, and thousands dying every day, one Indian doctor made a desperate gamble — mixing just Sugar & Salt & Water in a bucket. That experiment would go on to save millions of people. This is the untold story of Dr. Dilip Mahalanabis, the Indian Doctor who championed ORS (Oral Rehydration Solution) — a simple, life-saving formula recognized as the greatest medical breakthrough",
          "publishedAt": "2025-10-28T12:02:03+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/RqAKnUYh4jA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=RqAKnUYh4jA",
          "duration": "PT0S",
          "viewCount": "7480",
          "isLive": false,
          "searchableText": "indian genius who saved the world with just sugar & salt - in 1971, a deadly cholera outbreak swept through the refugee camps during the bangladesh war. with no medicine, no equipment, and thousands dying every day, one indian doctor made a desperate gamble — mixing just sugar & salt & water in a bucket. that experiment would go on to save millions of people. this is the untold story of dr. dilip mahalanabis, the indian doctor who championed ors (oral rehydration solution) — a simple, life-saving formula recognized as the greatest medical breakthrough   tirthak saha",
          "keywords": "",
          "hash": "baa3b3c3"
        },
        {
          "id": "Z2EJwnhzbPw",
          "title": "The Legendary Indian Scientist who was punished for being a Genius",
          "description": "In 1949, a 22-year-old Indian student at Harvard University discovered a comet that appears only once every 60,000 years — but instead of being celebrated by his country, he was punished for it. This is the unbelievable true story of the legendary Indian Scientist M.K. Vainu Bappu, who defied his own government to become the Father of Modern Indian Astronomy. From discovering a comet to building India’s greatest observatories and revolutionizing space science, this Genius’s journey is one of reb",
          "publishedAt": "2025-10-19T12:08:28+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/Z2EJwnhzbPw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Z2EJwnhzbPw",
          "duration": "PT0S",
          "viewCount": "66899",
          "isLive": false,
          "searchableText": "the legendary indian scientist who was punished for being a genius in 1949, a 22-year-old indian student at harvard university discovered a comet that appears only once every 60,000 years — but instead of being celebrated by his country, he was punished for it. this is the unbelievable true story of the legendary indian scientist m.k. vainu bappu, who defied his own government to become the father of modern indian astronomy. from discovering a comet to building india’s greatest observatories and revolutionizing space science, this genius’s journey is one of reb   tirthak saha",
          "keywords": "",
          "hash": "d6c8a652"
        },
        {
          "id": "j6LsUyVz2hs",
          "title": "The CIA Lost a Nuclear Spying Device in India | Operation HAT Exposed",
          "description": "Deep in the Himalayas, India’s second-highest peak hides a terrifying secret. In the 1960s, the CIA and India’s Intelligence Bureau teamed up on a top-secret Cold War mission: to plant a nuclear-powered spy device on Nanda Devi to monitor China’s nuclear tests. But the mission went horribly wrong. The device — packed with 5 kilograms of plutonium — was LOST on the mountain… and has never been found. From declassified CIA documents to chilling local accounts, this documentary uncovers how one of ",
          "publishedAt": "2025-10-02T09:30:37+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/j6LsUyVz2hs/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=j6LsUyVz2hs",
          "duration": "PT0S",
          "viewCount": "184555",
          "isLive": false,
          "searchableText": "the cia lost a nuclear spying device in india | operation hat exposed deep in the himalayas, india’s second-highest peak hides a terrifying secret. in the 1960s, the cia and india’s intelligence bureau teamed up on a top-secret cold war mission: to plant a nuclear-powered spy device on nanda devi to monitor china’s nuclear tests. but the mission went horribly wrong. the device — packed with 5 kilograms of plutonium — was lost on the mountain… and has never been found. from declassified cia documents to chilling local accounts, this documentary uncovers how one of    tirthak saha",
          "keywords": "",
          "hash": "c6204f86"
        },
        {
          "id": "a7FL8RDh5Mo",
          "title": "Why 21 Women Were Secretly Fed Radioactive Food As An Experiment",
          "description": "In the late 1960s, in the English city of Coventry, a shocking and little-known medical experiment targeted Indian immigrant women and secretly fed them radioactive rotis, disguised as a free health program for anemia. What sounds like a conspiracy theory was, in fact, a government-approved study run by the UK’s Medical Research Council, where 21 Women were unknowingly fed Radioactive Food in the name of science. This documentary unpacks the horrifying story of the Coventry Experiment, exposing ",
          "publishedAt": "2025-09-13T07:35:32+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/a7FL8RDh5Mo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=a7FL8RDh5Mo",
          "duration": "PT0S",
          "viewCount": "64410",
          "isLive": false,
          "searchableText": "why 21 women were secretly fed radioactive food as an experiment in the late 1960s, in the english city of coventry, a shocking and little-known medical experiment targeted indian immigrant women and secretly fed them radioactive rotis, disguised as a free health program for anemia. what sounds like a conspiracy theory was, in fact, a government-approved study run by the uk’s medical research council, where 21 women were unknowingly fed radioactive food in the name of science. this documentary unpacks the horrifying story of the coventry experiment, exposing    tirthak saha",
          "keywords": "",
          "hash": "25bd2ac4"
        },
        {
          "id": "7rtzUgmk_PM",
          "title": "The Chef Who Made Indian Food Famous in America",
          "description": "Long before Gordon Ramsay or Julia Child, the world’s very first celebrity chef was an Indian Chef you’ve probably never heard of—Ranji Smile. Born in British India in the late 1800s, Ranji cooked his way from colonial kitchens to New York’s high society where he single-handedly made Indian Food Famous in America. He dazzled them exotic flavors, royal costumes, and scandalous charm. But behind the fame was a story of lies, ambition, immigration struggles, and cultural clash. In this video, we un",
          "publishedAt": "2025-08-03T10:16:15+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/7rtzUgmk_PM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=7rtzUgmk_PM",
          "duration": "PT0S",
          "viewCount": "61638",
          "isLive": false,
          "searchableText": "the chef who made indian food famous in america long before gordon ramsay or julia child, the world’s very first celebrity chef was an indian chef you’ve probably never heard of—ranji smile. born in british india in the late 1800s, ranji cooked his way from colonial kitchens to new york’s high society where he single-handedly made indian food famous in america. he dazzled them exotic flavors, royal costumes, and scandalous charm. but behind the fame was a story of lies, ambition, immigration struggles, and cultural clash. in this video, we un   tirthak saha",
          "keywords": "",
          "hash": "9ed62d2a"
        },
        {
          "id": "D9n_299dd14",
          "title": "How an American Cult Influenced an Indian Tech Company",
          "description": "The story of a mysterious hidden connection between two companies that, on the surface, have nothing to do with each other. One was born in the 1800s as an American Cult and the other as an iconic Indian Electronics company born in the late 1900s. This is Episode 1 of \"Under The Radar\" - a series that aims to uncover little-known stories from India that reveal unexpected global connections, showcasing how Indian and South Asian history, culture, and innovation have shaped our world in ways most ",
          "publishedAt": "2025-07-20T12:54:09+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/D9n_299dd14/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=D9n_299dd14",
          "duration": "PT0S",
          "viewCount": "70430",
          "isLive": false,
          "searchableText": "how an american cult influenced an indian tech company the story of a mysterious hidden connection between two companies that, on the surface, have nothing to do with each other. one was born in the 1800s as an american cult and the other as an iconic indian electronics company born in the late 1900s. this is episode 1 of \"under the radar\" - a series that aims to uncover little-known stories from india that reveal unexpected global connections, showcasing how indian and south asian history, culture, and innovation have shaped our world in ways most    tirthak saha",
          "keywords": "",
          "hash": "99da86a6"
        },
        {
          "id": "CkwBpVH3bXQ",
          "title": "Uncovering India's Hidden Stories",
          "description": "This is an introduction to \"Under The Radar\" - a series that aims to uncover little-known stories from India that reveal unexpected global connections, showcasing how South Asian history, culture, and innovation have shaped our world in ways most people never realized. India’s impact on the world is far bigger, stranger, and more fascinating than the few recycled stories we usually hear. From the world’s first celebrity chef being an Indian in the early 1900s America, to an American cult inspiri",
          "publishedAt": "2025-07-16T12:50:13+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/CkwBpVH3bXQ/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=CkwBpVH3bXQ",
          "duration": "PT0S",
          "viewCount": "25837",
          "isLive": false,
          "searchableText": "uncovering india's hidden stories this is an introduction to \"under the radar\" - a series that aims to uncover little-known stories from india that reveal unexpected global connections, showcasing how south asian history, culture, and innovation have shaped our world in ways most people never realized. india’s impact on the world is far bigger, stranger, and more fascinating than the few recycled stories we usually hear. from the world’s first celebrity chef being an indian in the early 1900s america, to an american cult inspiri   tirthak saha",
          "keywords": "",
          "hash": "4bd5cde6"
        },
        {
          "id": "EHQGNjO3tvg",
          "title": "The True Story Of How Sherlock Holmes Saved An Indian Man's Life",
          "description": "In 1903, a shocking true crime case in a quiet English village put the son of an Indian immigrant at the center of an international scandal — and only Sir Arthur Conan Doyle, creator of Sherlock Holmes, could help clear his name. This is the unbelievable true story of George Edalji, a man wrongfully accused in Great Wyrley, and how Doyle used real-life detective work to fight for justice. Blending Indian history and the suspense of a Sherlock Holmes mystery, this forgotten case reveals how India",
          "publishedAt": "2023-05-27T11:04:25+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/EHQGNjO3tvg/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=EHQGNjO3tvg",
          "duration": "PT0S",
          "viewCount": "19151",
          "isLive": false,
          "searchableText": "the true story of how sherlock holmes saved an indian man's life in 1903, a shocking true crime case in a quiet english village put the son of an indian immigrant at the center of an international scandal — and only sir arthur conan doyle, creator of sherlock holmes, could help clear his name. this is the unbelievable true story of george edalji, a man wrongfully accused in great wyrley, and how doyle used real-life detective work to fight for justice. blending indian history and the suspense of a sherlock holmes mystery, this forgotten case reveals how india   tirthak saha",
          "keywords": "",
          "hash": "8664f468"
        }
      ]
    },
    "UCFdZETZpeX3G7Pe3zan2fHA": {
      "name": "Vyre by Angad Kahai Singh",
      "category": "business",
      "color": "blue",
      "lastFetched": "2025-11-07T02:53:26.559Z",
      "fetchStatus": "success",
      "fetchDuration": 175,
      "videos": [
        {
          "id": "56nGR2GnysI",
          "title": "Bihar Is POOR For A Reason! (And It’s Not What You Think)",
          "description": "Once celebrated for its rich cultural heritage, history, and intellectual contributions, Bihar has now become one of the most underdeveloped states in India. In this video, we uncover the hard truths behind the state's decline: decades of political corruption, poor leadership, high unemployment rates, and a failing educational system. With crumbling infrastructure and large-scale migration, Bihar has gone from being a thriving region to a symbol of neglect and struggle. However, this is more tha",
          "publishedAt": "2025-11-06T06:28:25+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/56nGR2GnysI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=56nGR2GnysI",
          "duration": "PT0S",
          "viewCount": "833",
          "isLive": false,
          "searchableText": "bihar is poor for a reason! (and it’s not what you think) once celebrated for its rich cultural heritage, history, and intellectual contributions, bihar has now become one of the most underdeveloped states in india. in this video, we uncover the hard truths behind the state's decline: decades of political corruption, poor leadership, high unemployment rates, and a failing educational system. with crumbling infrastructure and large-scale migration, bihar has gone from being a thriving region to a symbol of neglect and struggle. however, this is more tha   vyre by angad kahai singh",
          "keywords": "",
          "hash": "157e0474"
        },
        {
          "id": "hsHe0BjkMtw",
          "title": "India's Corrupt Private Hospitals Exposed!",
          "description": "👉 Spam-free Health Insurance - https://ditto.sh/dcb7gg India’s healthcare system is often praised for its growing hospitals, advanced technology, and affordable treatments, but behind the glossy image lies a darker reality. From overprescribed medicines and unnecessary tests to profit-driven hospitals and poor patient awareness, the system is silently harming millions. In this video, we uncover the shocking truth about how everyday Indians are being misled, overcharged, and sometimes even put a",
          "publishedAt": "2025-11-01T11:30:05+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/hsHe0BjkMtw/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=hsHe0BjkMtw",
          "duration": "PT0S",
          "viewCount": "30073",
          "isLive": false,
          "searchableText": "india's corrupt private hospitals exposed! 👉 spam-free health insurance - https://ditto.sh/dcb7gg india’s healthcare system is often praised for its growing hospitals, advanced technology, and affordable treatments, but behind the glossy image lies a darker reality. from overprescribed medicines and unnecessary tests to profit-driven hospitals and poor patient awareness, the system is silently harming millions. in this video, we uncover the shocking truth about how everyday indians are being misled, overcharged, and sometimes even put a   vyre by angad kahai singh",
          "keywords": "",
          "hash": "4031a24d"
        },
        {
          "id": "wgmBfdJZHNQ",
          "title": "How JOBS are Killing Marriages in INDIA",
          "description": "Are Jobs Silently Destroying Indian Marriages? In today’s fast-paced world, Indian couples are caught in a constant tug-of-war between professional ambitions and personal relationships. This video dives deep into how demanding work hours, job relocations, and corporate stress are creating emotional distance between partners. From dual-income households to long-distance marriages, we explore real-life stories and psychological insights behind why modern careers are straining the sacred bond of ma",
          "publishedAt": "2025-10-22T11:30:06+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/wgmBfdJZHNQ/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=wgmBfdJZHNQ",
          "duration": "PT0S",
          "viewCount": "52548",
          "isLive": false,
          "searchableText": "how jobs are killing marriages in india are jobs silently destroying indian marriages? in today’s fast-paced world, indian couples are caught in a constant tug-of-war between professional ambitions and personal relationships. this video dives deep into how demanding work hours, job relocations, and corporate stress are creating emotional distance between partners. from dual-income households to long-distance marriages, we explore real-life stories and psychological insights behind why modern careers are straining the sacred bond of ma   vyre by angad kahai singh",
          "keywords": "",
          "hash": "0e7d2507"
        },
        {
          "id": "kIEorPHVA7o",
          "title": "Why Indians Can’t Stop Pirating Movies (But Really Should)",
          "description": "Movie piracy is a massive problem in India, and many people don’t realize the serious impact it has on the film industry. In this video, we explore the reasons why Indians keep turning to pirated movies despite the risks and the harm it causes to filmmakers, actors, and everyone involved in making the movies we love. From easy access to affordability issues, we break down the real causes behind piracy culture in India, and why it’s time to change this habit. If you care about supporting Indian c",
          "publishedAt": "2025-10-17T14:51:58+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/kIEorPHVA7o/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=kIEorPHVA7o",
          "duration": "PT0S",
          "viewCount": "45895",
          "isLive": false,
          "searchableText": "why indians can’t stop pirating movies (but really should) movie piracy is a massive problem in india, and many people don’t realize the serious impact it has on the film industry. in this video, we explore the reasons why indians keep turning to pirated movies despite the risks and the harm it causes to filmmakers, actors, and everyone involved in making the movies we love. from easy access to affordability issues, we break down the real causes behind piracy culture in india, and why it’s time to change this habit. if you care about supporting indian c   vyre by angad kahai singh",
          "keywords": "",
          "hash": "ec5b3335"
        },
        {
          "id": "0AM7E0XxtA0",
          "title": "Mobile Addiction Is Quietly Destroying Gen Z!",
          "description": "In this video, we explore the rising problem of mobile phone addiction among Gen Z in India. From endless scrolling on social media to sleepless nights on smartphones, we break down the hidden impact on mental health, focus, and relationships. More importantly, we ask the big question: what can parents really do to help their kids escape this trap? Is this just a phase of growing up in the digital age, or a long-term threat to Gen Z’s future? Watch the full video to understand the data, stories,",
          "publishedAt": "2025-10-03T15:25:25+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/0AM7E0XxtA0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=0AM7E0XxtA0",
          "duration": "PT0S",
          "viewCount": "12961",
          "isLive": false,
          "searchableText": "mobile addiction is quietly destroying gen z! in this video, we explore the rising problem of mobile phone addiction among gen z in india. from endless scrolling on social media to sleepless nights on smartphones, we break down the hidden impact on mental health, focus, and relationships. more importantly, we ask the big question: what can parents really do to help their kids escape this trap? is this just a phase of growing up in the digital age, or a long-term threat to gen z’s future? watch the full video to understand the data, stories,   vyre by angad kahai singh",
          "keywords": "",
          "hash": "87a6125a"
        },
        {
          "id": "FnTrFb30RpQ",
          "title": "Why Do Poor Indians Buy Cars They Can’t Afford?",
          "description": "In this video, we dive into the surprising trend of low-income Indians buying luxury cars. From social status and peer pressure to easy loan availability and the desire for a better lifestyle, we break down the real reasons behind this growing phenomenon. Is it financial aspiration or financial risk? Watch the full video to find out! Don’t forget to like, share, and subscribe for more insights into money, lifestyle, and the Indian economy. #india #indian #car #cars Follow us on Instagram: Vyre: ",
          "publishedAt": "2025-09-22T12:00:06+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/FnTrFb30RpQ/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=FnTrFb30RpQ",
          "duration": "PT0S",
          "viewCount": "33978",
          "isLive": false,
          "searchableText": "why do poor indians buy cars they can’t afford? in this video, we dive into the surprising trend of low-income indians buying luxury cars. from social status and peer pressure to easy loan availability and the desire for a better lifestyle, we break down the real reasons behind this growing phenomenon. is it financial aspiration or financial risk? watch the full video to find out! don’t forget to like, share, and subscribe for more insights into money, lifestyle, and the indian economy. #india #indian #car #cars follow us on instagram: vyre:    vyre by angad kahai singh",
          "keywords": "",
          "hash": "95dfc4ff"
        },
        {
          "id": "2AqUSUNUgKo",
          "title": "Dear Indians, iPhone is Fooling YOU!",
          "description": "In this video, I delve into the growing trend of iPhone obsession in India, particularly among middle and lower-income groups. Despite financial limitations, many people are purchasing iPhones as a status symbol, without realizing that Apple's secret strategy is to lure them into its broader product ecosystem. I also explore the mindset behind why so many Indians are drawn to iPhones. Stick around until the end to learn why the iPhone may actually be a liability and how Apple’s marketing tactics",
          "publishedAt": "2025-09-13T11:00:01+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/2AqUSUNUgKo/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=2AqUSUNUgKo",
          "duration": "PT0S",
          "viewCount": "60348",
          "isLive": false,
          "searchableText": "dear indians, iphone is fooling you! in this video, i delve into the growing trend of iphone obsession in india, particularly among middle and lower-income groups. despite financial limitations, many people are purchasing iphones as a status symbol, without realizing that apple's secret strategy is to lure them into its broader product ecosystem. i also explore the mindset behind why so many indians are drawn to iphones. stick around until the end to learn why the iphone may actually be a liability and how apple’s marketing tactics   vyre by angad kahai singh",
          "keywords": "",
          "hash": "074b630f"
        },
        {
          "id": "TaAx1RDz-G8",
          "title": "The Dark Reality of Indian Students Abroad!",
          "description": "In this video, I talk about the harsh reality many Indian students face after moving abroad for higher education. Recent reports reveal that a growing number of Indian students in countries like the USA, UK, and Canada are struggling with serious financial and social challenges. While highlighting flaws in the Indian education system, I also shed light on the unfavorable immigration policies and limited job opportunities abroad that add to their difficulties. Key factors like return on investmen",
          "publishedAt": "2025-09-05T15:35:59+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/TaAx1RDz-G8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=TaAx1RDz-G8",
          "duration": "PT0S",
          "viewCount": "24177",
          "isLive": false,
          "searchableText": "the dark reality of indian students abroad! in this video, i talk about the harsh reality many indian students face after moving abroad for higher education. recent reports reveal that a growing number of indian students in countries like the usa, uk, and canada are struggling with serious financial and social challenges. while highlighting flaws in the indian education system, i also shed light on the unfavorable immigration policies and limited job opportunities abroad that add to their difficulties. key factors like return on investmen   vyre by angad kahai singh",
          "keywords": "",
          "hash": "7db1fe5f"
        },
        {
          "id": "T31CGjYh9Xs",
          "title": "Why Do People Online Hate Indians?",
          "description": "In this video, I dive into the global online image of Indians , a topic that has sparked criticism, trolling, and widespread mockery on the internet. I explore how certain behaviors, attitudes, and lifestyle choices of Indians, when compared to those in developed countries, may contribute to this negative perception. We’ll take a closer look at the kind of content Indian creators and influencers share, and how this shapes India’s digital reputation. I’ve broken down the key factors behind the on",
          "publishedAt": "2025-08-31T15:21:25+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/T31CGjYh9Xs/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=T31CGjYh9Xs",
          "duration": "PT0S",
          "viewCount": "47739",
          "isLive": false,
          "searchableText": "why do people online hate indians? in this video, i dive into the global online image of indians , a topic that has sparked criticism, trolling, and widespread mockery on the internet. i explore how certain behaviors, attitudes, and lifestyle choices of indians, when compared to those in developed countries, may contribute to this negative perception. we’ll take a closer look at the kind of content indian creators and influencers share, and how this shapes india’s digital reputation. i’ve broken down the key factors behind the on   vyre by angad kahai singh",
          "keywords": "",
          "hash": "3cc5a409"
        },
        {
          "id": "I0u_SdNWK98",
          "title": "How Indian Street food is Slowly killing you?",
          "description": "In this video, I discuss the issues surrounding Indian street food. While it's incredibly popular across the country due to its affordability and quick service, there are several major concerns, particularly related to hygiene, sanitation, the quality of ingredients, and how customers are treated. Make sure to watch till the end to understand why these problems persist despite the street food’s popularity, and what steps can be taken to improve overall safety and service. If you found this video",
          "publishedAt": "2025-08-27T14:49:10+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/I0u_SdNWK98/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=I0u_SdNWK98",
          "duration": "PT0S",
          "viewCount": "79522",
          "isLive": false,
          "searchableText": "how indian street food is slowly killing you? in this video, i discuss the issues surrounding indian street food. while it's incredibly popular across the country due to its affordability and quick service, there are several major concerns, particularly related to hygiene, sanitation, the quality of ingredients, and how customers are treated. make sure to watch till the end to understand why these problems persist despite the street food’s popularity, and what steps can be taken to improve overall safety and service. if you found this video   vyre by angad kahai singh",
          "keywords": "",
          "hash": "376da546"
        }
      ]
    },
    "UCtFCIACJgZK5cGVqWYWhGgg": {
      "name": "Americonomics by Akash Bhat",
      "category": "upskilling",
      "color": "orange",
      "lastFetched": "2025-11-07T02:53:26.777Z",
      "fetchStatus": "success",
      "fetchDuration": 218,
      "videos": [
        {
          "id": "eT5is1R2HiI",
          "title": "What Investors ACTUALLY Want to SEE!",
          "description": "Founders are being lied to — and it’s costing them time, money, and credibility. Everyone says “Nail your pitch deck” as if that’s the key to fundraising. But here’s the uncomfortable truth: 98% of investors skim your deck for under 30 seconds and move on. The fundraising “best practices” you’ve been told to follow are broken. In this video, I’ll show you why obsessing over fonts, colors, and slide design is a trap — and what the top 1% of founders do instead. You’ll learn proven examples of how",
          "publishedAt": "2025-11-01T02:41:07+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/eT5is1R2HiI/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=eT5is1R2HiI",
          "duration": "PT0S",
          "viewCount": "116",
          "isLive": false,
          "searchableText": "what investors actually want to see! founders are being lied to — and it’s costing them time, money, and credibility. everyone says “nail your pitch deck” as if that’s the key to fundraising. but here’s the uncomfortable truth: 98% of investors skim your deck for under 30 seconds and move on. the fundraising “best practices” you’ve been told to follow are broken. in this video, i’ll show you why obsessing over fonts, colors, and slide design is a trap — and what the top 1% of founders do instead. you’ll learn proven examples of how   americonomics by akash bhat",
          "keywords": "",
          "hash": "c1ab818a"
        },
        {
          "id": "GSdtbEo3Rr0",
          "title": "Why Are So Many Indians Struggling to Afford the American Dream?",
          "description": "Is the \"American Dream\" secretly a ₹2.3 Crore gamble? While you're chasing a $150,000 salary, the brutal math of student loans, living costs, and the H1B lottery is working against you. In this episode of Americonomics, we break down the hidden reality behind the dream. We calculate the staggering true cost of a US master's degree—an investment that often doesn't guarantee a visa, just a ticket to a high-stakes lottery with odds as low as 11%. Forget the old advice. We dive into the hard economi",
          "publishedAt": "2025-10-18T18:57:20+00:00",
          "thumbnailUrl": "https://i4.ytimg.com/vi/GSdtbEo3Rr0/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=GSdtbEo3Rr0",
          "duration": "PT0S",
          "viewCount": "795",
          "isLive": false,
          "searchableText": "why are so many indians struggling to afford the american dream? is the \"american dream\" secretly a ₹2.3 crore gamble? while you're chasing a $150,000 salary, the brutal math of student loans, living costs, and the h1b lottery is working against you. in this episode of americonomics, we break down the hidden reality behind the dream. we calculate the staggering true cost of a us master's degree—an investment that often doesn't guarantee a visa, just a ticket to a high-stakes lottery with odds as low as 11%. forget the old advice. we dive into the hard economi   americonomics by akash bhat",
          "keywords": "",
          "hash": "5f03128c"
        },
        {
          "id": "8NejpPsoaoE",
          "title": "Earn Extra Money on Investments | Must Know Mutual Fund Strategies",
          "description": "Is your high-yield savings account secretly a guaranteed way to lose money? While you're earning what seems like a great 3.5% or 4.5% interest, a silent penalty in the tax code is eroding your actual returns. In this video, we break down the hidden math that high earners and large corporations use to optimize their cash. Forget conventional advice—we're diving into the world of money market mutual funds, the institutional tool for generating tax-efficient income on your \"safe\" money. You'll lear",
          "publishedAt": "2025-10-11T19:30:00+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/8NejpPsoaoE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=8NejpPsoaoE",
          "duration": "PT0S",
          "viewCount": "172",
          "isLive": false,
          "searchableText": "earn extra money on investments | must know mutual fund strategies is your high-yield savings account secretly a guaranteed way to lose money? while you're earning what seems like a great 3.5% or 4.5% interest, a silent penalty in the tax code is eroding your actual returns. in this video, we break down the hidden math that high earners and large corporations use to optimize their cash. forget conventional advice—we're diving into the world of money market mutual funds, the institutional tool for generating tax-efficient income on your \"safe\" money. you'll lear   americonomics by akash bhat",
          "keywords": "",
          "hash": "2851a669"
        }
      ]
    },
    "UCM1vynzlNMa4r5MxwiEO6ag": {
      "name": "NRI Diaries by Nupur Dave",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-11-07T02:53:26.691Z",
      "fetchStatus": "success",
      "fetchDuration": 131,
      "videos": [
        {
          "id": "L69MTAGWXTM",
          "title": "Top Financial Expert Reveals Best Indian Credit Cards for NRIs",
          "description": "Should NRIs jump on the Credit Card bandwagon in India? Find out! Timestamps 00:00 My Struggle to Get a Credit Card 00:36 Understanding the Indian Credit Card Market 01:14 Why NRIs Should Consider Indian Credit Cards 02:31 Worth the Effort? 03:21 Choosing the Right Credit Card 03:29 Payment Networks and Fees 04:26 Maximizing Card Benefits 06:40 Navigating the Application Process, Uff! 09:34 Pro Tips for NRIs 11:31 Final Thoughts // ABOUT ME Hi, I'm Nupur Dave, an Ex-Googler, Author & NRI Consult",
          "publishedAt": "2025-11-05T15:55:51+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/L69MTAGWXTM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=L69MTAGWXTM",
          "duration": "PT0S",
          "viewCount": "549",
          "isLive": false,
          "searchableText": "top financial expert reveals best indian credit cards for nris should nris jump on the credit card bandwagon in india? find out! timestamps 00:00 my struggle to get a credit card 00:36 understanding the indian credit card market 01:14 why nris should consider indian credit cards 02:31 worth the effort? 03:21 choosing the right credit card 03:29 payment networks and fees 04:26 maximizing card benefits 06:40 navigating the application process, uff! 09:34 pro tips for nris 11:31 final thoughts // about me hi, i'm nupur dave, an ex-googler, author & nri consult   nri diaries by nupur dave",
          "keywords": "",
          "hash": "9c48355f"
        },
        {
          "id": "5yxniUGtc3U",
          "title": "10 Things Every NRI Should Do on Their Next India Visit",
          "description": "Here's what you need to do in your next visit to India! Timestamps: 00:00 Introduction 00:45 Banking Compliance: Your First Priority 02:57 PAN and Aadhar Card Essentials 04:07 Investment Updates and Compliance 04:55 Caring for Your Parents 06:11 Managing Your Real Estate 07:38 Bringing Gold to India: Tips and Tricks 08:08 Mobile Plans and Connectivity 09:00 Health Checkups and Medical Care 09:40 Beauty and Pampering // ABOUT ME Hi, I'm Nupur Dave, an Ex-Googler, Author & NRI Consultant. I have a",
          "publishedAt": "2025-10-25T16:21:04+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/5yxniUGtc3U/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=5yxniUGtc3U",
          "duration": "PT0S",
          "viewCount": "2718",
          "isLive": false,
          "searchableText": "10 things every nri should do on their next india visit here's what you need to do in your next visit to india! timestamps: 00:00 introduction 00:45 banking compliance: your first priority 02:57 pan and aadhar card essentials 04:07 investment updates and compliance 04:55 caring for your parents 06:11 managing your real estate 07:38 bringing gold to india: tips and tricks 08:08 mobile plans and connectivity 09:00 health checkups and medical care 09:40 beauty and pampering // about me hi, i'm nupur dave, an ex-googler, author & nri consultant. i have a   nri diaries by nupur dave",
          "keywords": "",
          "hash": "fa09653e"
        },
        {
          "id": "Pa82ZN1eiYQ",
          "title": "Which City is the Best to Retire in India? (Spoiler: It’s not Bangalore)",
          "description": "Meet our Sponsor : Manifest Law. They are the top law firm in the US for immigrant visas. You can reach out to them for your Immigration questions http://manifestlaw.com/nupur If you're confused about which city to live in India-- this video will show you which cities to seriously consider, and which ones to cross off your list immediatel, no matter how good they look on paper. Chapters 00:00 The NRI Dilemma 01:08 The Parent Move: Pros and Cons 01:59 Choosing a City Based on Friends 03:37 Career",
          "publishedAt": "2025-10-18T13:30:26+00:00",
          "thumbnailUrl": "https://i1.ytimg.com/vi/Pa82ZN1eiYQ/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=Pa82ZN1eiYQ",
          "duration": "PT0S",
          "viewCount": "3199",
          "isLive": false,
          "searchableText": "which city is the best to retire in india? (spoiler: it’s not bangalore) meet our sponsor : manifest law. they are the top law firm in the us for immigrant visas. you can reach out to them for your immigration questions http://manifestlaw.com/nupur if you're confused about which city to live in india-- this video will show you which cities to seriously consider, and which ones to cross off your list immediatel, no matter how good they look on paper. chapters 00:00 the nri dilemma 01:08 the parent move: pros and cons 01:59 choosing a city based on friends 03:37 career   nri diaries by nupur dave",
          "keywords": "",
          "hash": "e83e9e75"
        }
      ]
    },
    "UC19ruvzi32BWrWFpek4p3hA": {
      "name": "Been There, Done That",
      "category": "finance",
      "color": "purple",
      "lastFetched": "2025-11-07T02:53:26.244Z",
      "fetchStatus": "success",
      "fetchDuration": 196,
      "videos": [
        {
          "id": "1TdhN9I-JQE",
          "title": "The Man Whose Voice Defined the Delhi Metro and India | Shammi Narang",
          "description": "What does it take to become the voice of a nation? In this episode of Been There Done That, we sit down with Shammi Narang — the legendary broadcaster, voice artist, and the man behind the Hindi announcements of the Delhi Metro. From his early days at Doordarshan to becoming the voice that millions hear every single day, Shammi Narang shares his extraordinary journey — filled with discipline, humility, and timeless lessons on communication. 🎧 In this conversation, we talk about: His journey fro",
          "publishedAt": "2025-11-05T12:30:02+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/1TdhN9I-JQE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=1TdhN9I-JQE",
          "duration": "PT0S",
          "viewCount": "45",
          "isLive": false,
          "searchableText": "the man whose voice defined the delhi metro and india | shammi narang what does it take to become the voice of a nation? in this episode of been there done that, we sit down with shammi narang — the legendary broadcaster, voice artist, and the man behind the hindi announcements of the delhi metro. from his early days at doordarshan to becoming the voice that millions hear every single day, shammi narang shares his extraordinary journey — filled with discipline, humility, and timeless lessons on communication. 🎧 in this conversation, we talk about: his journey fro   been there, done that",
          "keywords": "",
          "hash": "3794ab8f"
        },
        {
          "id": "f7QcNVNXYxM",
          "title": "Uma Nair: Indian Art Critic — Inside 35 Years of India’s Hidden Art World",
          "description": "In this episode of Been There Done That, host Rajneil Kamath sits down with legendary Indian art critic Uma Nair, who has spent over three decades chronicling India’s art, artists, and the evolution of visual culture. From her encounters with M.F. Husain, S.H. Raza, and F.N. Souza, to her thoughts on authenticity, integrity, and the role of AI in art, Uma Nair shares powerful reflections on creativity, criticism, and life itself. 💬 In this candid conversation, she talks about: How she began her",
          "publishedAt": "2025-10-18T12:30:55+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/f7QcNVNXYxM/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=f7QcNVNXYxM",
          "duration": "PT0S",
          "viewCount": "104",
          "isLive": false,
          "searchableText": "uma nair: indian art critic — inside 35 years of india’s hidden art world in this episode of been there done that, host rajneil kamath sits down with legendary indian art critic uma nair, who has spent over three decades chronicling india’s art, artists, and the evolution of visual culture. from her encounters with m.f. husain, s.h. raza, and f.n. souza, to her thoughts on authenticity, integrity, and the role of ai in art, uma nair shares powerful reflections on creativity, criticism, and life itself. 💬 in this candid conversation, she talks about: how she began her   been there, done that",
          "keywords": "",
          "hash": "3f302bd9"
        }
      ]
    },
    "UCv0ZVHNQmQF1M681j6kK-Hw": {
      "name": "gen.E",
      "category": "sustainability",
      "color": "teal",
      "lastFetched": "2025-11-07T02:53:26.248Z",
      "fetchStatus": "success",
      "fetchDuration": 200,
      "videos": []
    },
    "UCbMzIZqxM7pf8GuyaJDP0Vg": {
      "name": "The Plate India",
      "category": "sustainability",
      "color": "teal",
      "lastFetched": "2025-11-07T02:53:26.382Z",
      "fetchStatus": "success",
      "fetchDuration": 134,
      "videos": [
        {
          "id": "BAe416xeuvA",
          "title": "How smart branding and storytelling made this small Indian coffee estate global",
          "description": "In conversation with Pranoy Thipaiah, Managing Partner of Kerehaklu - an estate in Chikmagalur that’s rebranding the way the world sees Indian coffee. While most farmers rarely think about branding or positioning, Kerehaklu is bringing audiences and global roasters closer to who they are through storytelling, social media, and a window into life on their estate. Rooted in biodiversity and brought to life with vibrant visuals and thoughtful design, their approach has unlocked access to some of th",
          "publishedAt": "2025-09-26T12:40:29+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/BAe416xeuvA/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=BAe416xeuvA",
          "duration": "PT0S",
          "viewCount": "3468",
          "isLive": false,
          "searchableText": "how smart branding and storytelling made this small indian coffee estate global in conversation with pranoy thipaiah, managing partner of kerehaklu - an estate in chikmagalur that’s rebranding the way the world sees indian coffee. while most farmers rarely think about branding or positioning, kerehaklu is bringing audiences and global roasters closer to who they are through storytelling, social media, and a window into life on their estate. rooted in biodiversity and brought to life with vibrant visuals and thoughtful design, their approach has unlocked access to some of th   the plate india",
          "keywords": "",
          "hash": "212446ff"
        },
        {
          "id": "JC8o5Ztx2pE",
          "title": "Andhra Pradesh wants to become a 100% Natural Farming state | Good idea or crazy?",
          "description": "Andhra Pradesh is turning itself into the world's largest agriculture laboratory. The state government wants all of its 60 lakh farmers and 60 lakh hectares of farmland to turn to natural farming by 2035--zero synthetic chemicals or fertilizers. Is it feasible, or even a scientifically sensibly idea? While it seems noble, can a system of farming that relies just on cow dung, urine, jaggery and similar ingredients as chemical replacements, end up lowering our food production and endanger food sec",
          "publishedAt": "2025-08-20T14:00:29+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/JC8o5Ztx2pE/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=JC8o5Ztx2pE",
          "duration": "PT0S",
          "viewCount": "126112",
          "isLive": false,
          "searchableText": "andhra pradesh wants to become a 100% natural farming state | good idea or crazy? andhra pradesh is turning itself into the world's largest agriculture laboratory. the state government wants all of its 60 lakh farmers and 60 lakh hectares of farmland to turn to natural farming by 2035--zero synthetic chemicals or fertilizers. is it feasible, or even a scientifically sensibly idea? while it seems noble, can a system of farming that relies just on cow dung, urine, jaggery and similar ingredients as chemical replacements, end up lowering our food production and endanger food sec   the plate india",
          "keywords": "",
          "hash": "97b490b2"
        },
        {
          "id": "2S7iSj4O59I",
          "title": "The Chai Story | How tea became India's national drink",
          "description": "Chai is the drink that fuels India today. But just over a century ago, hardly anyone in India knew about tea, forget drinking it. So how did India go from ignorance and indifference to becoming one of the largest producers and consumers of tea in the world? Hint: It was the result of one of the greatest marketing campaigns the world has ever seen! We help you understand India from farm to plate. Visit https://ThePlate.in for more The Plate on Instagram: https://Instagram.com/theplateindia The Pl",
          "publishedAt": "2025-08-13T01:30:04+00:00",
          "thumbnailUrl": "https://i3.ytimg.com/vi/2S7iSj4O59I/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=2S7iSj4O59I",
          "duration": "PT0S",
          "viewCount": "6997",
          "isLive": false,
          "searchableText": "the chai story | how tea became india's national drink chai is the drink that fuels india today. but just over a century ago, hardly anyone in india knew about tea, forget drinking it. so how did india go from ignorance and indifference to becoming one of the largest producers and consumers of tea in the world? hint: it was the result of one of the greatest marketing campaigns the world has ever seen! we help you understand india from farm to plate. visit https://theplate.in for more the plate on instagram: https://instagram.com/theplateindia the pl   the plate india",
          "keywords": "",
          "hash": "7dd65eea"
        },
        {
          "id": "iMqGYgboKr8",
          "title": "How a young Punjab woman farmer revived forgotten wheat | And created a pan-India business",
          "description": "Anushka Neyol is a young seventh generation farmer from India's wheat basket of Punjab. Anushka decided to marry her education in business management and economics with her passion for farming, launching a farm business that grows and sells nearly 20 different varieties of heirloom wheats that we've forgotten. Listen to her life story of accidentally turning a wheat nerd and the journey as a self-taught farmpreneur. Contents of video --- 0:00 Intro 1:40 Finding a farm idea 3:30 Black wheat 4:38 ",
          "publishedAt": "2025-07-08T02:30:37+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/iMqGYgboKr8/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=iMqGYgboKr8",
          "duration": "PT0S",
          "viewCount": "1566",
          "isLive": false,
          "searchableText": "how a young punjab woman farmer revived forgotten wheat | and created a pan-india business anushka neyol is a young seventh generation farmer from india's wheat basket of punjab. anushka decided to marry her education in business management and economics with her passion for farming, launching a farm business that grows and sells nearly 20 different varieties of heirloom wheats that we've forgotten. listen to her life story of accidentally turning a wheat nerd and the journey as a self-taught farmpreneur. contents of video --- 0:00 intro 1:40 finding a farm idea 3:30 black wheat 4:38    the plate india",
          "keywords": "",
          "hash": "306105c3"
        },
        {
          "id": "10jiqwZmELY",
          "title": "India’s High-Value Export Behind Luxury Perfumes | From Madurai to Paris",
          "description": "In the world of luxury perfumes, jasmine and rose are the king and queen—no floral fragrance is complete without them. And some 100,000 farmers in a tiny area around Madurai produce the world’s best jasmine that powers scents by Dior, Guerlain or Tom Ford. It takes more than 1,000 kilos of these tiny milky-white flowers to make just one kilo of jasmine oil—an oil that sells for nearly ₹4 lakh. The jasmine sambac or Madurai jasmine is considered a symbol of love, beauty and purity. In this video ",
          "publishedAt": "2025-05-29T13:30:03+00:00",
          "thumbnailUrl": "https://i2.ytimg.com/vi/10jiqwZmELY/hqdefault.jpg",
          "youtubeUrl": "https://www.youtube.com/watch?v=10jiqwZmELY",
          "duration": "PT0S",
          "viewCount": "202704",
          "isLive": false,
          "searchableText": "india’s high-value export behind luxury perfumes | from madurai to paris in the world of luxury perfumes, jasmine and rose are the king and queen—no floral fragrance is complete without them. and some 100,000 farmers in a tiny area around madurai produce the world’s best jasmine that powers scents by dior, guerlain or tom ford. it takes more than 1,000 kilos of these tiny milky-white flowers to make just one kilo of jasmine oil—an oil that sells for nearly ₹4 lakh. the jasmine sambac or madurai jasmine is considered a symbol of love, beauty and purity. in this video    the plate india",
          "keywords": "",
          "hash": "71507b6c"
        }
      ]
    }
  },
  "metadata": {
    "totalVideos": 98,
    "totalChannels": 22,
    "successfulChannels": 22,
    "lastSuccessfulFetch": "2025-11-07T02:53:26.778Z",
    "fetchDuration": 1433
  }
}